{"text": "You retain ownership rights in your Content. However, we do require you to grant certain rights to YouTube and other users of the Service, as described below.", "source": "manual_seed"}
{"text": "You, or your licensors, as applicable, retain ownership of the copyright and other intellectual property in Your Content, subject to the non-exclusive rights granted below.", "source": "manual_seed"}
{"text": "You retain ownership of and responsibility for Your Content. If you're posting anything you did not create yourself or do not own the rights to, you agree that you are responsible for any Content you post.", "source": "manual_seed"}
{"text": "You retain ownership of the intellectual property rights in any content that you create and share on Facebook and other Meta Company Products you use. Nothing in these Terms takes away the rights you have to your own content.", "source": "manual_seed"}
{"text": "Subject to the licenses granted in these Terms, you retain any ownership or intellectual property rights that you hold in the Content you submit to the Services.", "source": "manual_seed"}
{"text": "You retain ownership of your campaign storyboards. By submitting it, you grant Harbor Cloud a non-exclusive, revocable license to test security and reliability of our services. You control whether your content is discoverable by third-party search engines.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your campaign storyboards", "company": "Harbor Cloud", "license": "non-exclusive, revocable", "usage": "test security and reliability of our services"}, "source": "synthetic:v2025.10.07a"}
{"text": "You retain ownership of the lesson plans you publish. By submitting it, you grant Signal Stack a limited, non-transferable license to generate automated captions and translations. We obtain no ownership in derivative works you build outside the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the lesson plans you publish", "company": "Signal Stack", "license": "limited, non-transferable", "usage": "generate automated captions and translations"}, "source": "synthetic:v2025.10.07a"}
{"text": "You retain ownership of your presentation decks. By submitting it, you grant Atlas Studio a non-exclusive, sublicensable license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your presentation decks", "company": "Atlas Studio", "license": "non-exclusive, sublicensable", "usage": "feature it in personalized recommendations"}, "source": "synthetic:v2025.10.07a"}
{"text": "You retain ownership of your AR filters. By submitting it, you grant the Platform a non-exclusive, perpetual license to host and display it to your selected audience. We will never sell your content outright or claim exclusive ownership.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your AR filters", "company": "the Platform", "license": "non-exclusive, perpetual", "usage": "host and display it to your selected audience"}, "source": "synthetic:v2025.10.07a"}
{"text": "You retain ownership of the newsletters you schedule. By submitting it, you grant Nimbus Labs a transferable, sublicensable license to process it for content moderation and analytics. You can revoke the license at any time by removing the item from the platform.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the newsletters you schedule", "company": "Nimbus Labs", "license": "transferable, sublicensable", "usage": "process it for content moderation and analytics"}, "source": "synthetic:v2025.10.07a"}
{"text": "You retain ownership of your product roadmaps. By submitting it, you grant Beacon Media a limited, worldwide, royalty-free license to provide accessibility adjustments. Any sublicenses we grant are solely for operating and improving the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your product roadmaps", "company": "Beacon Media", "license": "limited, worldwide, royalty-free", "usage": "provide accessibility adjustments"}, "source": "synthetic:v2025.10.07a"}
{"text": "You retain ownership of the community guides you draft. By submitting it, you grant Launchpad Networks a limited, non-transferable license to run community safety investigations. We will notify you of material license changes at least 30 days in advance.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the community guides you draft", "company": "Launchpad Networks", "license": "limited, non-transferable", "usage": "run community safety investigations"}, "source": "synthetic:v2025.10.07a"}
{"text": "You retain ownership of your brand style guides. By submitting it, you grant Atlas Studio a transferable, sublicensable license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your brand style guides", "company": "Atlas Studio", "license": "transferable, sublicensable", "usage": "feature it in personalized recommendations"}, "source": "synthetic:v2025.10.07a"}
