{"text": "Restricted Personal Information shall only be processed with your consent or for the establishment, exercise or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of important public interest.", "source": "privacy_policy_qa", "chunk_id": 0, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We use trusted third party processors to keep such data, all in accordance with the provisions of this privacy policy.", "source": "privacy_policy_qa", "chunk_id": 1, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In the meanwhile, you are responsible for the truthfulness, legality, validity and completeness of the information you provide, and update and maintain your personal information in a timely manner to ensure the truthfulness, validity and validity of the information.", "source": "privacy_policy_qa", "chunk_id": 2, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Facilitate and fulfill orders placed on the Site andOther Programs for example, for Groupon vouchers and other goods and services, including tracking redemption;", "source": "privacy_policy_qa", "chunk_id": 3, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also use this information to establish and set up your account, verify or re-issue a password, log your activity and contact you from time to time.", "source": "privacy_policy_qa", "chunk_id": 4, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "cause interference with execution and enforcement of the law and legal private rights (such as in the case of the investigation or detection of legal claims or the right to a fair trial); breach or prejudice the rights of confidentiality and security of others; prejudice security or grievance investigations, corporate re-organizations, future and ongoing negotiations with third parties, the compliance with regulatory requirements relating to economic and financial management; or otherwise violate the interests of others or where the burden or cost of providing access would be disproportionate.", "source": "privacy_policy_qa", "chunk_id": 5, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to prevent, detect, mitigate, and investigate fraud or potentially illegal activities, and enforce our Terms of Service;", "source": "privacy_policy_qa", "chunk_id": 6, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Currently, our computer system does not support, and cannot act on DNT signal headers that we may receive; accordingly, the choices that we provide you concerning out collection and use of personally identifiable information will continue to operate as described in this policy.", "source": "privacy_policy_qa", "chunk_id": 7, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will never share with or sell the information gained through the use of Apple HealthKit, such as age, weight and heart rate data, to advertisers or other agencies without your authorization.", "source": "privacy_policy_qa", "chunk_id": 8, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will ask for your consent before using information for a purpose other than those set out in this Policy.", "source": "privacy_policy_qa", "chunk_id": 9, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In that case, we will provide for adequate safeguards to protect your personal information.", "source": "privacy_policy_qa", "chunk_id": 10, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We useNon-Identifiable InformationandDevice Datato directly serve you interest-based ads on third party websites and mobile applications.", "source": "privacy_policy_qa", "chunk_id": 11, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You have the option to provide us with additional information about yourself through surveys, forms, features and applications.", "source": "privacy_policy_qa", "chunk_id": 12, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Residents of the State of California can request a list of all third-parties to which our App has disclosed certain personal information (as defined by California law) during the preceding year for those third-parties direct marketing purposes.", "source": "privacy_policy_qa", "chunk_id": 13, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "the processing is necessary to support our legitimate interests as a business (e.g.", "source": "privacy_policy_qa", "chunk_id": 14, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We want you to have control over how you communicate.", "source": "privacy_policy_qa", "chunk_id": 15, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Use your data as described in ourCard Linked Dealsprogram, if you consented to participate in such program.", "source": "privacy_policy_qa", "chunk_id": 16, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "On Android Devices, you may opt-out by enabling the Opt out of Ads Personalization setting.", "source": "privacy_policy_qa", "chunk_id": 17, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can choose not to share your photo, opt not to receive location-based messages along with many other additional options, which are available within the app.", "source": "privacy_policy_qa", "chunk_id": 18, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please check back periodically to keep informed of updates or changes to this Privacy Policy.", "source": "privacy_policy_qa", "chunk_id": 19, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you use a third party site, such as Facebook or Twitter, in connection with our Services to communicate with another person (eg, to make or post referrals or to request that we communicate with another person), then in addition to that person's name and contact information, we may also collect other information (eg, your profile picture, network, gender, username, user ID, age range, language, country, friends lists or followers) depending on your privacy settings on the third party site.", "source": "privacy_policy_qa", "chunk_id": 20, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Affiliatemeans an entity owned, directly or indirectly, by Groupon, Inc. or that is controlled by or under common control with Groupon, Inc., and also includes joint ventures entered into by Groupon, Inc. and/or its Affiliates.", "source": "privacy_policy_qa", "chunk_id": 21, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We and service providers acting on our behalf may use Log Files and tracking technologies to collect and analyze certain types of technical information, including Cookies, Flash Cookies, and Web Beacons.", "source": "privacy_policy_qa", "chunk_id": 22, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "in response to a subpoena, or similar legal process, including to law enforcement agencies, regulators, and courts in the United States and other countries where we operate; or", "source": "privacy_policy_qa", "chunk_id": 23, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "with a purchaser or prospective purchaser of Groupon or any of the GrouponAffiliates(or all or a portion of their assets), as described below inSection 10;", "source": "privacy_policy_qa", "chunk_id": 24, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We use your information to ensure our services are working as intended, such as troubleshooting issues reported from you.", "source": "privacy_policy_qa", "chunk_id": 25, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This may include URLs included in messages, which were reported as SPAM by other users, or were otherwise suspected to be unsolicited and using your operating system authentication services.", "source": "privacy_policy_qa", "chunk_id": 26, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For Secret Chats, we will notify the other members of any screenshots youve been taking (so please respect the vibe and do not take them).", "source": "privacy_policy_qa", "chunk_id": 27, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This Privacy Statement does not apply to the collection of information in any way other than as listed above.", "source": "privacy_policy_qa", "chunk_id": 28, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This information is typically collected through the use of third-party mobile device software development kits.", "source": "privacy_policy_qa", "chunk_id": 29, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe may share summary statistics, which do not identify any particular individual or contain individual-level information, with our qualified research collaborators.", "source": "privacy_policy_qa", "chunk_id": 30, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We encourage you to review the privacy policies or statements of these third party advertising companies to learn more about their use ofCookiesand other technologies.", "source": "privacy_policy_qa", "chunk_id": 31, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you share the use of a computer or device, accepting or rejecting the use of cookies may affect all users of that compute or device.", "source": "privacy_policy_qa", "chunk_id": 32, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "open your account, enable purchases and process payments, communicate with you, and implement your requests (eg, referrals); enable and enhance your use of our website and mobile application(s), including authenticatint your visits, providing personalized content and information, and tracking your usage of our Services; contact you about your account, and any relevant information about our Services (eg policy changes, security updates or issues, etc); enforce our Terms of Service and other agreements; monitor, detect, investigate and prevent prohibited or illegal behaviors on our Services, to combat spam and other security risks; and perform research & development activities, which may include, for example, conducting data analysis and research in order to develop new or improve existing products and services, and performing quality control activities.", "source": "privacy_policy_qa", "chunk_id": 33, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Each Promotional Communication will generally offer recipients choices about withdrawing consent so you no longer recieve additional messages.", "source": "privacy_policy_qa", "chunk_id": 34, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "how we use and with whom we share such information;", "source": "privacy_policy_qa", "chunk_id": 35, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We encrypt the transmission of all information using secure socket layer technology (SSL).", "source": "privacy_policy_qa", "chunk_id": 36, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to notify users of in-Game updates, or updates to our Terms of Service or this Privacy Policy; and", "source": "privacy_policy_qa", "chunk_id": 37, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will not share information that you provide us in the process of the registration - including your contact information - except as described in this Policy.", "source": "privacy_policy_qa", "chunk_id": 38, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "(b) App Providers and Other Third-Parties:We may disclose your information to service providers and other third-parties under contract who help with providing you and others our Services on our behalf or other services provided by third-parties via our Services (such as, but not limited to, fraud and spam investigations, payment processing, site analytics and operations, providing special partnership features in our service either on an aggregate non identifiable basis, or using a unique identifier which is not attributable to you).", "source": "privacy_policy_qa", "chunk_id": 39, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For example, we use industry-standard encryption technology to secureFinancial Account Information.", "source": "privacy_policy_qa", "chunk_id": 40, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "By using the Service, you are also agreeing to ourTerms of Use.", "source": "privacy_policy_qa", "chunk_id": 41, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Where the processing of your Personal Information is based on consent, contract, or legitimate interests described under the Legal Bases for Processing heading above, you may restrict or object, at any time, to the processing of your Personal Information as permitted by applicable law.", "source": "privacy_policy_qa", "chunk_id": 42, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Groupon uses your geolocation, including your precise geolocation, consistent with this Privacy Statement as described inSection 5below to deliver location-based offers, products or services that may be of interest to you.", "source": "privacy_policy_qa", "chunk_id": 43, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may manage how your browser handlesCookiesby adjusting its privacy and security settings.", "source": "privacy_policy_qa", "chunk_id": 44, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe Research may be sponsored by, conducted on behalf of, or in collaboration with third parties, such as non-profit foundations, academic institutions or pharmaceutical companies.", "source": "privacy_policy_qa", "chunk_id": 45, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe requires service providers to implement and maintain accepted industry standard administrative, physical and technical safeguards to protect Personal Information.", "source": "privacy_policy_qa", "chunk_id": 46, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This allows us to continuously improve the Site to provide the best information in support of our project aims.", "source": "privacy_policy_qa", "chunk_id": 47, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We use them to collect visitors preferences and thus to better optimize the user experience.", "source": "privacy_policy_qa", "chunk_id": 48, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our Services are not intended for children under the age of 13.", "source": "privacy_policy_qa", "chunk_id": 49, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "On iOS Devices, you may opt-out by enabling the Limit Ad Tracking setting.", "source": "privacy_policy_qa", "chunk_id": 50, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Further, your right of access and deletion is not absolute and may not be available if fulfillment of such right would, among other things:", "source": "privacy_policy_qa", "chunk_id": 51, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We use the User-ID feature of Google Analytics to combine behavioral information across devices and sessions (including authenticated and unauthenticated sessions).", "source": "privacy_policy_qa", "chunk_id": 52, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "As a registered member, you can review and change personal information at any time by accessing your account on the App or contacting our support.", "source": "privacy_policy_qa", "chunk_id": 53, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also offer you the ability to import your contacts or manually enter e-mail addresses so that you can locate your contacts on PeopleFun and invite your contacts to join you in the Games.", "source": "privacy_policy_qa", "chunk_id": 54, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "(e)Change of Control  New Owners: We may share your information with another business entity, if we plan to merge with or be acquired by that business, or are involved in a transaction with similar financial effect.", "source": "privacy_policy_qa", "chunk_id": 55, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will make sure we investigate the matter and correct any inaccuracies as quickly as possible where necessary or give you ways to update it quickly or to delete it - unless we have to keep that information for legitimate business or legal purposes.", "source": "privacy_policy_qa", "chunk_id": 56, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will retain yourPersonal Informationfor as long as your account is active or as needed to provide you services and to maintain a record of your transactions for financial reporting purposes.", "source": "privacy_policy_qa", "chunk_id": 57, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your data is kept safe with us, but we do share your personal information with third parties we trust in order to provide you with our services, as follows:", "source": "privacy_policy_qa", "chunk_id": 58, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We (or ourVendorson our behalf), use information collected as described in this Privacy Statement to:", "source": "privacy_policy_qa", "chunk_id": 59, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can also contact us in writing at Viber Media S. r.l., Attention: Data Privacy Officer, 2, rue du Foss, L- 1536 Luxembourg, Grand Duchy of Luxembourg.", "source": "privacy_policy_qa", "chunk_id": 60, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Before you disclose information about a family member, you should make sure you have permission from the family member to do so.", "source": "privacy_policy_qa", "chunk_id": 61, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In the event that PeopleFun undergoes a business transition, such as a merger, acquisition by another company, change of control, or sale of all or a portion of its assets, we may transfer all of your information, including personal information, to the successor organization in such transition.", "source": "privacy_policy_qa", "chunk_id": 62, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In most cases our processing of your personal information for marketing purposes is based on our legitimate interest, although some cases (such as where required by law) may be based on your consent.", "source": "privacy_policy_qa", "chunk_id": 63, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This means that the encryption keys are stored only on the clients devices and no one, not even Viber itself, has access to them.", "source": "privacy_policy_qa", "chunk_id": 64, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you do not wish to receive marketing communications from us, you can opt-out through the link attached to each communication or by sending an email to optout@fiverr.com.", "source": "privacy_policy_qa", "chunk_id": 65, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We direct all such third party service providers to maintain the confidentiality of the information disclosed to them and to not use your information for any purpose other than to provide services on PeopleFuns behalf.", "source": "privacy_policy_qa", "chunk_id": 66, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We limit access to Personal Information to authorized personnel, based on job function and role.", "source": "privacy_policy_qa", "chunk_id": 67, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In particular, we use Google Analytics cookies to obtain an overall view of user habits and volumes, and to help improve the overall experience on the Site.", "source": "privacy_policy_qa", "chunk_id": 68, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In addition, this information helps us track any fraudulent activities and other inappropriate activities and monitor content integrity; or", "source": "privacy_policy_qa", "chunk_id": 69, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Evaluate your eligibility for certain types of offers, products or services that may be of interest to you, and analyze advertising effectiveness;", "source": "privacy_policy_qa", "chunk_id": 70, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will provide notice to each recipient that we disclosed your Personal Information to regarding any rectification or erasure of Personal Information or restriction of processing, unless you initiated the disclosure or providing notice proves impossible or involves disproportionate effort.", "source": "privacy_policy_qa", "chunk_id": 71, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "However, your Genetic Information and Self-Reported Information may still be used by us and shared with our third party service providers to as outlined in this Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 72, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We have implemented controls to balance our interests with your rights.", "source": "privacy_policy_qa", "chunk_id": 73, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you are a minor, you can use the service only in conjunction with your parents or guardians.", "source": "privacy_policy_qa", "chunk_id": 74, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "These cookies are also used to help us understand how effective our Site is; for instance these cookies tell us which pages visitors go to most often and if they get error messages from web pages.", "source": "privacy_policy_qa", "chunk_id": 75, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You need to attest to the fact that you are a California resident and provide a current California address for our response.", "source": "privacy_policy_qa", "chunk_id": 76, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you have questions about this Privacy Statement, or wish to submit a complaint, please email 23andMe's Privacy Administrator at privacy@23andme.com, or send a letter to:", "source": "privacy_policy_qa", "chunk_id": 77, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Where we are required to identify a data controller pursuant to regulation, PeopleFun is the designated controller of the data we collect.", "source": "privacy_policy_qa", "chunk_id": 78, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Google will use the information collected for the purpose of evaluating your use of our Site on our behalf, compiling reports on website activity and providing other services relating to activity and internet usage to us.", "source": "privacy_policy_qa", "chunk_id": 79, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "However, like other companies, we cannot guarantee 100% the security or confidentiality of the information you provide to us.", "source": "privacy_policy_qa", "chunk_id": 80, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may send an e-mail to privacy@PeopleFun.com with your request to exercise any of the rights identified above.", "source": "privacy_policy_qa", "chunk_id": 81, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Pixel Tags and Web Beaconsmean tiny graphic images placed on website pages or in our emails that allow us to determine whether you have performed specific actions.", "source": "privacy_policy_qa", "chunk_id": 82, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not control the third party site's information practices, so please review the third partys privacy statement and your settings on the third partys site carefully.", "source": "privacy_policy_qa", "chunk_id": 83, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will retain and use yourPersonal Informationas necessary to comply with our legal obligations, resolve disputes, and enforce our agreements.", "source": "privacy_policy_qa", "chunk_id": 84, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This Privacy Policy explains how information is collected, used and disclosed by TickTick with respect to users access and use of our service through the application (Referred to below as TickTick).", "source": "privacy_policy_qa", "chunk_id": 85, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you use our Services, we may collect and store information about your location by converting your IP address into a rough geo-location or by accessing your mobile devices GPS coordinates or coarse location if you enable location services on your device.", "source": "privacy_policy_qa", "chunk_id": 86, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If we are aware that a child under 13 has provided us with personal identifiable Information, we will delete such information from our files.", "source": "privacy_policy_qa", "chunk_id": 87, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Technical information that is gathered by our systems, or third party systems, automatically may be used for Site operation, optimization, analytics, content promotion and enhancement of user experience.", "source": "privacy_policy_qa", "chunk_id": 88, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The withdrawal of your consent will not affect the lawfulness of processing based on consent before its withdrawal.", "source": "privacy_policy_qa", "chunk_id": 89, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If we learn that we have collected PII of any child we will take steps to delete such information from our files as soon as possible.", "source": "privacy_policy_qa", "chunk_id": 90, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Complaints If you believe that we have infringed your rights, we encourage you to contact us so that we can try to address your concerns or dispute informally.", "source": "privacy_policy_qa", "chunk_id": 91, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you deactivate your Viber account, it will delete the address book from our servers (more about this below), quickly and permanently.", "source": "privacy_policy_qa", "chunk_id": 92, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to obtain a copy of or access to safeguards under which your personal information is transferred outside of the EEA.", "source": "privacy_policy_qa", "chunk_id": 93, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The information protection issues that you use in the use of third-party products or services do not apply to the management of this policy.", "source": "privacy_policy_qa", "chunk_id": 94, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In the event that you believe your information is in any way incorrect or inaccurate, please let us know immediately.", "source": "privacy_policy_qa", "chunk_id": 95, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "From time to time, as our services evolve, we may update this Policy.", "source": "privacy_policy_qa", "chunk_id": 96, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We share the information described above in Section 2 with our third party service providers, as necessary for them to provide their services to us and help us perform our contract with you.", "source": "privacy_policy_qa", "chunk_id": 97, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Groupon will use such information in accordance with applicable laws.", "source": "privacy_policy_qa", "chunk_id": 98, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you have any questions, comments or concerns regarding our Privacy Policy and/or practices, please send an e-mail to privacy@PeopleFun.com.", "source": "privacy_policy_qa", "chunk_id": 99, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your data will not be included in studies that start more than 30 days after your account is closed (it may take up to 30 days to withdraw your information after your account is closed).", "source": "privacy_policy_qa", "chunk_id": 100, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Aggregate information We may share Aggregate Information, which is information that has been stripped of your name and contact information and combined with information of others so that you cannot reasonably be identified as an individual, with third parties.", "source": "privacy_policy_qa", "chunk_id": 101, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To process, analyze and deliver your genetic testing results As described above, to receive results through the Personal Genetic Service, you must create a 23andMe account, register your kit, and submit your saliva sample to our contracted genotyping laboratory, which processes and analyzes your sample to provide us with your raw Genetic Information.", "source": "privacy_policy_qa", "chunk_id": 102, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Other websites that may be accessible through links from the Site andOther Programsmay have their own privacy statements and personal information collection, use, and disclosure practices.", "source": "privacy_policy_qa", "chunk_id": 103, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can access and download data processed by 23andMe within your Account Settings and within applicable Reports, Tools, and features.", "source": "privacy_policy_qa", "chunk_id": 104, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We need your help too: it is your responsibility to make sure that your personal information is accurate and that your password(s) and account registration information are secure and not shared with third-parties.", "source": "privacy_policy_qa", "chunk_id": 105, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We collect information that you provide us or voluntarily share with other users, and also some general technical information that is automatically gathered by our systems, such as IP address, browser information and cookies to enable you to have a better user experience and a more personalized browsing experience.", "source": "privacy_policy_qa", "chunk_id": 106, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Otherwise, we keep your contact information for as long as you use the App so we can provide you all functions of the app.", "source": "privacy_policy_qa", "chunk_id": 107, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "By continuing to use this Site, you are agreeing to our placing cookies on your computer or device in accordance with the terms of this Policy.", "source": "privacy_policy_qa", "chunk_id": 108, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you believe we might have any information from or about a child under 13, please contact us at legal@fiverr.com.", "source": "privacy_policy_qa", "chunk_id": 109, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please refer to those third-party sites privacy policies and terms of use to learn more about their privacy practices, as we do not control these.", "source": "privacy_policy_qa", "chunk_id": 110, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will not disclose or transfer your personal information to any non-affiliated third parties, unless:", "source": "privacy_policy_qa", "chunk_id": 111, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You also have a right to lodge a complaint with a competent supervisory authority situated in a Member State of your habitual residence, place of work, or place of alleged infringement.", "source": "privacy_policy_qa", "chunk_id": 112, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your continued use of Services will signify your acceptance of the changes to this Privacy Policy.", "source": "privacy_policy_qa", "chunk_id": 113, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Once you submit your request, we will send an email to the email address linked to your 23andMe account detailing our account deletion policy and requesting that you to confirm your deletion request.", "source": "privacy_policy_qa", "chunk_id": 114, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to improve our services to you or to customise your browsing experience), subject to your interests and fundamental rights and provided it is conducted at all times in a way that is proportionate.", "source": "privacy_policy_qa", "chunk_id": 115, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe has implemented an incident management program using industry best practices, including guidance from the National Institute of Standards and Technology (NIST).", "source": "privacy_policy_qa", "chunk_id": 116, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When updating your personal information, we may ask you to verify your identity before we can act on your request.", "source": "privacy_policy_qa", "chunk_id": 117, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may do this through in-Game dialog boxes, which you may choose to skip.", "source": "privacy_policy_qa", "chunk_id": 118, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "That means your name and photo (if you choose to provide them) will be visible to other Viber users.", "source": "privacy_policy_qa", "chunk_id": 119, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To provide customer support When you contact Customer Care, we may use or request Personal Information, including Sensitive Information, as necessary to answer your questions, resolve disputes, and/or investigate and troubleshoot problems or complaints.", "source": "privacy_policy_qa", "chunk_id": 120, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can voluntarily delete your TickTick account at any time on the Web and have all your data erased from our server.", "source": "privacy_policy_qa", "chunk_id": 121, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We use your information to contact you (via message or other means) to maintain the App, including your Viber Out User Account, to comply with your stated communication preferences or to provide updates about other Viber services.", "source": "privacy_policy_qa", "chunk_id": 122, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "By continuing to access and to use TickTick, you are agreeing to be bound by the revised policy.", "source": "privacy_policy_qa", "chunk_id": 123, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Section 9 only applies to individuals located in the European Economic Area (EEA), United Kingdom, or Switzerland (the Designated Countries).", "source": "privacy_policy_qa", "chunk_id": 124, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For all requests, please ensure you put the statement Your California Privacy Rights in the body of your request, as well as your name, street address, city, state, and zip code.", "source": "privacy_policy_qa", "chunk_id": 125, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can opt-out of being targeted by certainThird-Party Ad-Serversand Groupon-served ads online using theNational Advertising Initiatives Opt-Out Toolor theDigital Advertising Alliances (DAA) About Ads Opt-Out Tool.", "source": "privacy_policy_qa", "chunk_id": 126, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may access, correct or update most of your Registration Information on your own within your Account Settings.", "source": "privacy_policy_qa", "chunk_id": 127, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Other than consented by you, we commit that we will not sell your personal information to any other third parties for their processing for any purposes.", "source": "privacy_policy_qa", "chunk_id": 128, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Global Privacy Officer, 23andMe, Inc., 899 West Evelyn Avenue, Mountain View, CA 94041 1.800.239.5230, privacy@23andme.com", "source": "privacy_policy_qa", "chunk_id": 129, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your personal information may be stored in systems based around the world, and may be processed by third party service providers acting on our behalf.", "source": "privacy_policy_qa", "chunk_id": 130, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In many Games, friends and other players will be able to see your Game profile, which may include your name or a game name and your profile photo, which in certain cases can reveal your PeopleFun ID.", "source": "privacy_policy_qa", "chunk_id": 131, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Flurry Analytics: If you wish to find out more information on Flurry analytics, please follow this link: http://www.flurry.com/legal-privacy/privacy-policy", "source": "privacy_policy_qa", "chunk_id": 132, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In certain Games we will create and assign to your device an identifier that is similar to an account number.", "source": "privacy_policy_qa", "chunk_id": 133, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "At this stage, whatever you share publicly is available to the entire Viber community.", "source": "privacy_policy_qa", "chunk_id": 134, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We take steps to limit direct marketing to a reasonable and proportionate level, and to send you communications which we believe may be of interest or relevance to you, based on the information we have about you.", "source": "privacy_policy_qa", "chunk_id": 135, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We are not responsible for the privacy practices or the content of such websites.", "source": "privacy_policy_qa", "chunk_id": 136, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In addition, we collect information about the accounts you have visited and the content you have viewed in order to improve the relevance of our Services.", "source": "privacy_policy_qa", "chunk_id": 137, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please exercise caution before choosing to share Personal Information publicly on our blogs, Forums or in any other posting.", "source": "privacy_policy_qa", "chunk_id": 138, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our Services include Social Media Features, such as the Facebook \"Like\" or \"Share\" button and widgets (\"Features\").", "source": "privacy_policy_qa", "chunk_id": 139, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "\"Targeted advertising\" service providers We permit third party advertising networks and providers to collect Web-Behavior Information regarding the use of our Services to help us to deliver targeted online advertisements (\"ads\") to you.", "source": "privacy_policy_qa", "chunk_id": 140, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Likewise, if your account or membership is terminated or suspended, we may maintain some information to prevent you from re-registering.", "source": "privacy_policy_qa", "chunk_id": 141, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please contact us if you have any questions or comments about our privacy practices or this Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 142, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will also keep this Privacy Policy in compliance with significant legal frameworks relating to the transfer of data.", "source": "privacy_policy_qa", "chunk_id": 143, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Some third-party services providers that we engage (including third-party advertisers) may also place their own Cookies on your device.", "source": "privacy_policy_qa", "chunk_id": 144, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you interact with Public Accounts, bots and Communities on our Service, we may obtain information about the messages you have liked, comments you have left and also websites youve viewed through links in them.", "source": "privacy_policy_qa", "chunk_id": 145, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For example, if a university tells us about a new cancer research project, we may send an email to 23andMe research participants who potentially fit the relevant eligibility criteria based on their Self-Reported Information to make them aware of the research project and provide a link to participate with the research organization conducting the study.", "source": "privacy_policy_qa", "chunk_id": 146, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You provide us with yourPersonal Informationwhen you register, subscribe, create an account, make a purchase, or otherwise when you provide us with yourPersonal Informationduring your interaction with the Site andOther Programs.", "source": "privacy_policy_qa", "chunk_id": 147, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will help you export the information based on applicable law and your specific request.", "source": "privacy_policy_qa", "chunk_id": 148, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may be able to disallow our use of certain location data through your device or browser settings, for example, by disabling Location services for the Groupon application in iOS privacy settings.", "source": "privacy_policy_qa", "chunk_id": 149, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "As a last resort and under limited circumstances, EU, EEA and Swiss individuals with residual privacy complaints may invoke a binding arbitration option before the Privacy Shield Panel.", "source": "privacy_policy_qa", "chunk_id": 150, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your personal information may be transferred to, and maintained on, computers located outside of your state, province, country or other governmental jurisdiction where the privacy laws may not be as protective as those in your jurisdiction.", "source": "privacy_policy_qa", "chunk_id": 151, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe complies with the Privacy Shield Principles for all onward transfers of Personal Information from the EU, EEA and Switzerland, including the onward transfer liability provisions.", "source": "privacy_policy_qa", "chunk_id": 152, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Any information that is collected via our Services is covered by the Privacy Policy in effect at the time such information is collected.", "source": "privacy_policy_qa", "chunk_id": 153, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may use aggregate, non-personally identifiable information for our own internal promotion or marketing purposes and we may share such aggregate non-personally identifiable information with others for marketing purposes.", "source": "privacy_policy_qa", "chunk_id": 154, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may share (i) aggregated information (information about you and other users collectively, but not specifically identifiable to you); (ii) anonymous information; and (iii) certain technical information (including IP Addresses and mobile device IDs) to develop and deliver targeted advertising in the Games and on the websites of third parties.", "source": "privacy_policy_qa", "chunk_id": 155, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you want to useViber Out, youll need to create a Viber Account by selecting a password, and providing certain personal information (eg, name, email and billing information).", "source": "privacy_policy_qa", "chunk_id": 156, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Relationship Information: information you provide that enables us to determine lifestyle, interests, and activities, including location information related to your state/province, city, or neighborhood; areas of interest, the types of deals that interest you, information collected through your interactions with social networks, demographic information (eg, birth date, age, gender); information about persons for whom you have purchased Groupon vouchers as gifts or who have bought Groupon vouchers as gifts for you; and information about friends who refer you or whom you have referred;", "source": "privacy_policy_qa", "chunk_id": 157, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Device Datameans information concerning a device you use to access, use, or interact with the Site, such as operating system type or mobile device model, browser type, domain, and other system settings, the language your system uses and the country and time zone of your device, geolocation, including precise geolocation, unique device identifier or other device identifier, advertising identifier, mobile phone carrier identification, and device software platform and firmware information.", "source": "privacy_policy_qa", "chunk_id": 158, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You have the right not to be subject to a decision based solely on automated processing, including profiling, which produces legal or similarly significant effects on you, except as allowed under applicable data protection laws.", "source": "privacy_policy_qa", "chunk_id": 159, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please note that even if you unsubscribe from commercial email messages, we may still e-mail you non-commercial e-mails related to your account and your transactions on the Site.", "source": "privacy_policy_qa", "chunk_id": 160, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Information related to our genetic testing services Saliva sample and biobanking.", "source": "privacy_policy_qa", "chunk_id": 161, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also collect your WPS location data  you can choose whether to allow this by changing your geolocation tracking settings.", "source": "privacy_policy_qa", "chunk_id": 162, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If it comes to Lima Skys attention that Personal Information has been collected from a person under the age of 13, Lima Sky will delete this information as quickly as possible.", "source": "privacy_policy_qa", "chunk_id": 163, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your information may be disclosed: (i) when we have a good faith belief that we are required to disclose the information in response to legal process (for example, a court order, search warrant or subpoena); (ii) to satisfy any applicable laws or regulations; (iii) where we believe that the Games are being used in the commission of a crime, including to report such criminal activity or to exchange information with other companies and organizations for the purposes of fraud protection and credit risk reduction; (iv) when we have a good faith belief that there is an emergency that poses a threat to the health and/or safety of you, another person or the public generally; and (v) in order to protect the rights or property of PeopleFun, including to enforce our Terms of Service.", "source": "privacy_policy_qa", "chunk_id": 164, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can turn off push notifications by visiting the options or settings page within the relevant Game.", "source": "privacy_policy_qa", "chunk_id": 165, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To provide you with a better experience through improving our products, services, content, and advertising or otherwise where you have consented, we may share the personal information with our affiliate companies and with joint venture partners and third-party service providers, contractors and agents, and use it consistent with this Privacy Policy.", "source": "privacy_policy_qa", "chunk_id": 166, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This Privacy Statement does not cover the collection methods or use of the information collected byThird-Party Ad-Servers, and Groupon is not responsible forCookiesor clear gifs in third party ads.", "source": "privacy_policy_qa", "chunk_id": 167, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you have chosen to participate in 23andMe Research, from time to time we may inform you of third party research opportunities for which you may be eligible.", "source": "privacy_policy_qa", "chunk_id": 168, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We collect the minimum information required to achieve the purposes set out in this Policy (see below), and you have the ability to limit such collection, as specified below under Your Choices:", "source": "privacy_policy_qa", "chunk_id": 169, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This policy does not apply to any information you choose to provide to third parties.", "source": "privacy_policy_qa", "chunk_id": 170, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "eg, where we tailor marketing communications or send targeted marketing messages via post, phone or social media and other third party platforms; and in providing existing customers with information (via email or other channels) about similar products and services.", "source": "privacy_policy_qa", "chunk_id": 171, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you upload content, including your personal information, to a social network and then tag the Site, your submission will be subject to that social network's terms of use and privacy policy, even where you post on an official Fiver page on the social network.", "source": "privacy_policy_qa", "chunk_id": 172, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "By accessing or using the Services, you agree to this Privacy Policy, our Terms of Service.", "source": "privacy_policy_qa", "chunk_id": 173, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This Privacy Statement applies solely to information collected by 23andMe and our service providers on our behalf.", "source": "privacy_policy_qa", "chunk_id": 174, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can restrict our processing of your Personal Information where one of the following applies: (a) you dispute the accuracy of Personal Information processed by 23andMe (for a period enabling us to verify its accuracy); (b) the processing is unlawful and you oppose the erasure of the Personal Information and request the restriction of its use instead; (c) 23andMe no longer needs the Personal Information for the purposes of the processing, but it is required by you for the establishment, exercise or defense of legal claims; and (d) you have objected to certain processing relying on legitimate interest, pending the verification whether 23andMes legitimate grounds override your rights.", "source": "privacy_policy_qa", "chunk_id": 175, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Genetic Information includes the 23andMe results reported to you as part of our Services, and may be used for other purposes, as outlined in Section 3 below.", "source": "privacy_policy_qa", "chunk_id": 176, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to secure the site and protect it against fraud, unauthorized transactions (such as money laundering), claims or other liabilities.", "source": "privacy_policy_qa", "chunk_id": 177, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please check their policies before submitting any of your personal data.", "source": "privacy_policy_qa", "chunk_id": 178, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The Site may be accessible through or contain connections to areas where you may be able to publicly post information, communicate with others such as discussion boards or blogs, review products and merchants, and submit media content.", "source": "privacy_policy_qa", "chunk_id": 179, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Access to your account We provide access to your 23andMe data within your 23andMe account.", "source": "privacy_policy_qa", "chunk_id": 180, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You should periodically check www.PeopleFun.com and this privacy page for updates.", "source": "privacy_policy_qa", "chunk_id": 181, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Potential situations when you may make personal data available to Lima Sky include, but are not limited to: (i) registration for Services, including leaderboards; (ii) subscribing to newsletters; (iii) requesting technical support; and (iv) otherwise through use of Services where personal data is required for use and/or participation.", "source": "privacy_policy_qa", "chunk_id": 182, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Web-Behavior Information: information on how you use 23andMe Services collected through log files, cookies, web beacons, and similar technologies, (eg, browser type, domains, page views).", "source": "privacy_policy_qa", "chunk_id": 183, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Sensitive Information: information about your health, Genetic Information, and certain Self-Reported Information such as racial and ethnic origin, sexual orientation, and political affiliation.", "source": "privacy_policy_qa", "chunk_id": 184, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will also store the correspondence and any information contained within.", "source": "privacy_policy_qa", "chunk_id": 185, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you request to delete your account, we will take the steps described under Your Choices  Account Deletion and delete all your Personal Information, unless a longer retention period is required or permitted by law.", "source": "privacy_policy_qa", "chunk_id": 186, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may use, record and store archives of these communications on PeopleFuns servers to protect the safety and well being of our users and PeopleFuns rights and property in connection with the Services.", "source": "privacy_policy_qa", "chunk_id": 187, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Service providers are third parties (other companies or individuals) that help us to provide, analyze and improve our Services.", "source": "privacy_policy_qa", "chunk_id": 188, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This Policy applies solely to personal information collected by our Site.", "source": "privacy_policy_qa", "chunk_id": 189, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Viber does not currently take actions to respond to Do Not Track signals because a uniform technological standard has not yet been developed.", "source": "privacy_policy_qa", "chunk_id": 190, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you use our Services, including our website or mobile app(s), our third party service providers may collect Web-Behavior Information about your visit, such as the links you clicked on, the duration of your visit, and the URLs you visited.", "source": "privacy_policy_qa", "chunk_id": 191, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Lima Sky or third parties may collect and use data for this purpose including, but not limited to IP address (including but not limited to for purposes of determining your coarse location), Device ID, MAC, software, applications, hardware, and in-game information.", "source": "privacy_policy_qa", "chunk_id": 192, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can control how and whether we collect your precise geolocation information through your devices settings.", "source": "privacy_policy_qa", "chunk_id": 193, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can reach us via postal mail at the following address:", "source": "privacy_policy_qa", "chunk_id": 194, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The information we receive is dependent upon your privacy settings with the social network.", "source": "privacy_policy_qa", "chunk_id": 195, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To protect your information we recommend that you carefully review the privacy policies of all Third-party Services that you access.", "source": "privacy_policy_qa", "chunk_id": 196, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Business Partnersmeans, collectively, third parties with whom we conduct business, such as merchants, co-marketers, distributors, resellers, and other companies or organizations with whom Groupon enters into agreements to support its business and operations.", "source": "privacy_policy_qa", "chunk_id": 197, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "These files contain a variety of information such as information about Fiverr webpages visited by you, the length of time you visited the Site, data about how you came to visit the Site, areas viewed by you within the Site, and additional information.", "source": "privacy_policy_qa", "chunk_id": 198, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In such a case, your information would remain subject to the promises made in any pre-existing Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 199, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not merge information collected through any Google advertising product with individual-level information collected elsewhere by our Service.", "source": "privacy_policy_qa", "chunk_id": 200, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Viber Media S.a.r.l is the controller of data we collect and process according to this privacy policy.", "source": "privacy_policy_qa", "chunk_id": 201, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may retain some information from closed accounts so that we can comply with law, prevent fraud, assist with investigations, resolve disputes, analyze, or troubleshoot programs, enforce our Terms of Use, or take other actions permitted by law.", "source": "privacy_policy_qa", "chunk_id": 202, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "(e) Additional Information:We collect additional information when you access our App through a certain device (eg your mobile devices unique identifier; information about your devices operating system, your browser, browser or operating system language; your wireless network, and your mobile carrier; the Viber call log).", "source": "privacy_policy_qa", "chunk_id": 203, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to the extent you have purchased or redeemed a Groupon voucher, goods or services offered by aBusiness Partneror participated in an offer, rewards, contest or other activity orOther Programssponsored or offered through Groupon on behalf of thatBusiness Partner;", "source": "privacy_policy_qa", "chunk_id": 204, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If we decide to make material changes to our Privacy Policy, we will notify you and other users by placing a notice on PeopleFun.com or by sending you a notice to the e-mail address we have on file for you, and well update the Last Updated Date above to indicate when those changes will become effective.", "source": "privacy_policy_qa", "chunk_id": 205, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The rights described above may be limited by local laws.", "source": "privacy_policy_qa", "chunk_id": 206, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your unsubscribe or e-mail preference change will be processed promptly, usually within 10 business days.", "source": "privacy_policy_qa", "chunk_id": 207, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To the extent 23andMe requests and you provide your consent to the processing of your Personal Information, you can withdraw your consent at any time.", "source": "privacy_policy_qa", "chunk_id": 208, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The information provided in your registration, if you link your email to the Viber account, will be shared with Rakuten group to create the Rakuten account and/or to link your Rakuten account with your Viber account.", "source": "privacy_policy_qa", "chunk_id": 209, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also use Cookies to monitor aggregate usage and web traffic routing on our Services and to customize and improve our Services.", "source": "privacy_policy_qa", "chunk_id": 210, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For example, we may use the information collected from you to verify your identity.", "source": "privacy_policy_qa", "chunk_id": 211, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you follow a link to any of these websites, please note that this Privacy Policy does not apply to those websites.", "source": "privacy_policy_qa", "chunk_id": 212, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Some of these cookies are managed by third parties, and you may refer to the third parties' own website privacy notifications for further information.", "source": "privacy_policy_qa", "chunk_id": 213, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We need your age, height and weight to calculate your consumption of calorie when you complete each training class.", "source": "privacy_policy_qa", "chunk_id": 214, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to comply with legal orders and government requests, or as needed to support auditing, compliance, and corporate governance functions;", "source": "privacy_policy_qa", "chunk_id": 215, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also offer you the option to complete a user profile that is visible to other PeopleFun users.", "source": "privacy_policy_qa", "chunk_id": 216, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may combine your personal information with information we collect automatically or obtain from other companies and use it to improve and personalize our services, content and advertising.", "source": "privacy_policy_qa", "chunk_id": 217, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also collect the precise location of your device when the app is running in the foreground, background, or even if you are not directly using the application depending on your device and its settings.", "source": "privacy_policy_qa", "chunk_id": 218, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to challenge processing which we have justified on the basis of our legitimate interest;", "source": "privacy_policy_qa", "chunk_id": 219, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please note that the Site may contain links to third party sites and if you link to a third party site from the Site, any data you provide to that site and any use of that data by the third party are not under the control of Fiverr and are not subject to this Policy.", "source": "privacy_policy_qa", "chunk_id": 220, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We continue to review new technologies and may adopt a standard once one is created.", "source": "privacy_policy_qa", "chunk_id": 221, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We store and process your personal information on our computers in the United States, Asia, Europe (including Russia), Australia and Brazil, and use service providers that may be located in various locations outside of the European Economic Area (EEA).We have put in place appropriate safeguards (such as contractual commitments) in accordance with applicable legal requirements to ensure that your data is adequately protected.", "source": "privacy_policy_qa", "chunk_id": 222, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may use your information to prevent, detect, and investigate fraud, security breaches, potentially prohibited or illegal activities, protect our trademarks and enforce ourTerms of Use.", "source": "privacy_policy_qa", "chunk_id": 223, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "By using the Site or giving us yourPersonal Information, you are directly transferring yourPersonal InformationandNon-Identifiable Informationto us in the United States.", "source": "privacy_policy_qa", "chunk_id": 224, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "access your user data Correct the data you have provided to us Have information provided to you in a portable format Request the deletion of the data we have collected Restrict processing Object to processing or the legal basis on which we rely to process your data", "source": "privacy_policy_qa", "chunk_id": 225, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your withdrawal will not affect the lawfulness of our processing based on consent before your withdrawal.", "source": "privacy_policy_qa", "chunk_id": 226, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to service providers for the purpose of opening and operating your account as well as providing ancillary services (example - payment vendors, CRM systems, forum hosting, community management services, mailing systems or technical consultants).", "source": "privacy_policy_qa", "chunk_id": 227, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In some cases, we retain data for limited periods when it needs to be kept for legitimate business or legal purposes or to be protected from accidental or malicious deletion, there may be delays between when you delete something and when copies are deleted from our active and backup systems.", "source": "privacy_policy_qa", "chunk_id": 228, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Neither 23andMe nor any of its Services are designed for, intended to attract, or directed toward children under the age of 18.", "source": "privacy_policy_qa", "chunk_id": 229, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We also may use information collected as described in this Privacy Statement with your consent or as otherwise required or permitted by law.", "source": "privacy_policy_qa", "chunk_id": 230, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may manage how your mobile device and mobile browser share certainDevice Datawith Groupon, as well as how your mobile browser handlesCookiesby adjusting the privacy and security settings on your mobile device.", "source": "privacy_policy_qa", "chunk_id": 231, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Viber Out Account Registration:Our Viber Out service allows you to call a number outside of the Viber registered community at low cost local rates.", "source": "privacy_policy_qa", "chunk_id": 232, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you still have questions about our privacy policy, please feel free to send us an email toprivacy@viber.com,or using the contact us form on the App.", "source": "privacy_policy_qa", "chunk_id": 233, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "However, in some circumstances we may retain your personal information for longer periods of time.", "source": "privacy_policy_qa", "chunk_id": 234, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe is committed to protecting the privacy of children as well as adults.", "source": "privacy_policy_qa", "chunk_id": 235, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For individuals located in the Designated Countries: Our legal basis for processing your Personal Information for the purpose described above depends on the nature of the customer support request.", "source": "privacy_policy_qa", "chunk_id": 236, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When your account is deleted, all associated Personal Information is deleted and any stored samples are discarded, subject to the following limitations:", "source": "privacy_policy_qa", "chunk_id": 237, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not disclose it to others except as disclosed in this Policy or required to provide you with the services of the Site and mobile applications, meaning - to allow you to buy, sell, share the information you want to share on the Site; to contribute on the forum; pay for products; post reviews and so on; or where we have a legal obligation to do so.", "source": "privacy_policy_qa", "chunk_id": 238, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may receive reports based on the use of these technologies from third party service providers as de-identified, Individual-level Information or as Aggregate Information (as described in section 4.c).", "source": "privacy_policy_qa", "chunk_id": 239, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To operate the service, we also may make identifiable and anonymous information available to third parties in these limited circumstances: (1) with your express consent, (2) when we have a good faith belief it is required by law, (3) when we have a good faith belief it is necessary to protect our rights or property, or (4) to any successor or purchaser in a merger, acquisition, liquidation, dissolution or sale of assets.", "source": "privacy_policy_qa", "chunk_id": 240, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please refer to instructions provided by your mobile service provider or the manufacturer of your device to learn how to adjust your settings.", "source": "privacy_policy_qa", "chunk_id": 241, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your De-identified Genetic and Self-Reported Information may be used for 23andMe Research only if you have consented to this use by completing a Consent Document.", "source": "privacy_policy_qa", "chunk_id": 242, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "However we will not share Individual-level Genetic Information or Self-Reported Information with any third party without your consent.", "source": "privacy_policy_qa", "chunk_id": 243, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For example, we may send and receive data to and from Apple HealthKit to collaborate training consumption calculation on your iOS system with your authorization.", "source": "privacy_policy_qa", "chunk_id": 244, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your Account may be used to publicly identify you as part of social features of the Services, which may include user-to-user interaction, chat or messaging functionality, public leaderboards, head-to-head competition, and other similar features.", "source": "privacy_policy_qa", "chunk_id": 245, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Data Retention: Unless otherwise specified, we retain information as long as it is necessary and relevant for us to achieve the purposes referred to above or to enable us to comply with our legal data protection retention obligations.", "source": "privacy_policy_qa", "chunk_id": 246, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This information includes photos you upload, your published portfolio, Gig information, ratings, and additional information you may choose to add to your profile.", "source": "privacy_policy_qa", "chunk_id": 247, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our relationship with you We are the controller with respect to your Personal Information because we determine the means and purposes of processing your information when using our Services.", "source": "privacy_policy_qa", "chunk_id": 248, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our payment processing service provider may also retain this information to enable you to purchase additional items through our Game without having to re-enter it each time.", "source": "privacy_policy_qa", "chunk_id": 249, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Groupon has implemented an information security program that contains administrative, technical and physical controls that are designed to reasonably safeguardPersonal Information.", "source": "privacy_policy_qa", "chunk_id": 250, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Other Programsmeans special programs, features and functionality on our Site or other co-branded websites withBusiness Partnersthat we reasonably control and that have special use terms applicable to such special programs, features and functionality.", "source": "privacy_policy_qa", "chunk_id": 251, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Lima Sky may use personal and non-personal data, both individually and combined together, for purposes of analyzing usage of the Services, providing customer and technical support, managing and providing Services (including managing advertisement serving), customizing Lima Skys communications and to further develop the Services and other products.", "source": "privacy_policy_qa", "chunk_id": 252, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also further use such public information you share, for various reasons, such as improving our service and providing you with relevant content, and analyzing trends.", "source": "privacy_policy_qa", "chunk_id": 253, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Fiverr (including Fiverr Inc., Fiver International Ltd. and its affiliates) respects your privacy and is committed to protect the personal information of its users - buyers, sellers, and visitors browsing the Site (Users).", "source": "privacy_policy_qa", "chunk_id": 254, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This can include information about sellers and their Gigs, User's location, sharing of portfolio, ratings and feedbacks by buyers and anything you choose to add to your user profile.", "source": "privacy_policy_qa", "chunk_id": 255, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You should do this through the browser settings for each browser you use.", "source": "privacy_policy_qa", "chunk_id": 256, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also collect information from commercially available sources such as data aggregators and public databases.", "source": "privacy_policy_qa", "chunk_id": 257, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please read the Privacy Policies of those platforms, as your activity published on those platforms will no longer be governed by this Privacy Policy.", "source": "privacy_policy_qa", "chunk_id": 258, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You are solely responsible for compliance with any data protection or privacy obligations in your jurisdiction when you use the Site or provide us withPersonal Information.", "source": "privacy_policy_qa", "chunk_id": 259, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to restrict processing of your personal information where: (a) the accuracy of the personal information is contested; (b) the processing is unlawful but you object to the erasure of the personal information; (c)  we no longer require the personal information for the purposes for which it was collected, but it is required for the establishment, exercise or defense of a legal claim;", "source": "privacy_policy_qa", "chunk_id": 260, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to facilitate a direct relationship with you, including in connection with any program we administer on behalf of theBusiness Partner;", "source": "privacy_policy_qa", "chunk_id": 261, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You recognize and agree that the advertising companies who deliver ads for Lima Sky may combine the information collected with other information they have independently collected from other services or products.", "source": "privacy_policy_qa", "chunk_id": 262, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "These third parties may use your Personal Information differently than we do under this Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 263, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Analytics companies may access anonymous data (such as your IP address, device vendor ID, and/or device advertising ID) to help us understand how Services are used.", "source": "privacy_policy_qa", "chunk_id": 264, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may also allow advertisers to collect these types of information within the Games and they may share it with us.", "source": "privacy_policy_qa", "chunk_id": 265, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you visit the App and/or our Website, we and our business partners may use cookies and other tracking technologies for a variety of purposes.", "source": "privacy_policy_qa", "chunk_id": 266, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To make such a request, please send an email to privacy@fiverr.com.", "source": "privacy_policy_qa", "chunk_id": 267, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Transaction Information: information you provide when you interact with us and the Site, such as the Groupon vouchers you are interested in, purchase and redeem; email and other communications; and how you interact withBusiness Partnersand ourVendors; and", "source": "privacy_policy_qa", "chunk_id": 268, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "While we are ready to assist you in managing your subscriptions, deactivating your account, and removing your active profile, we cannot always delete records of past interactions and transactions.", "source": "privacy_policy_qa", "chunk_id": 269, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We also collect technical information indirectly and automatically through our systems.", "source": "privacy_policy_qa", "chunk_id": 270, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Information that you choose to publish on the Site (photos, videos, text, music, reviews, deliveries) - is no longer private, just like any information you publish online.", "source": "privacy_policy_qa", "chunk_id": 271, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not knowingly collect personal information from children under 13.", "source": "privacy_policy_qa", "chunk_id": 272, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The information generated by these cookies about your use of the Site (including your IP address) will be transmitted to and stored by Google Inc on servers in the United States.", "source": "privacy_policy_qa", "chunk_id": 273, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to deliver and target behavioral or personalized ads; and to inform users about new products or promotional offers.", "source": "privacy_policy_qa", "chunk_id": 274, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You directly provide us with most of the information we collect.", "source": "privacy_policy_qa", "chunk_id": 275, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Browsers are different, so refer to instructions related to your browser to learn about cookie-related and other privacy and security settings that may be available.", "source": "privacy_policy_qa", "chunk_id": 276, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In certain situations, 23andMe may be required to disclose Personal Information in response to lawful requests by public authorities, including to meet national security or law enforcement requirements.", "source": "privacy_policy_qa", "chunk_id": 277, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This data is then assigned a randomly generated ID so an individual cannot reasonably be identified.", "source": "privacy_policy_qa", "chunk_id": 278, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If we receive your complaints about data transfers, we will cooperate with appropriate regulatory authorities when we cannot directly resolve it.", "source": "privacy_policy_qa", "chunk_id": 279, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you post on Communities, the admin of the Community has the ability to allow everybody to access it, but you can always actively delete messages you posted.", "source": "privacy_policy_qa", "chunk_id": 280, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may use location information to improve and personalize our Services for you.", "source": "privacy_policy_qa", "chunk_id": 281, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When calling through Viber Out, just like regular phone calls you make, details of the call are available to the phone operator of the person you called (and possibly other facilitating phone operators  but this is the same as any regular phone call you make).", "source": "privacy_policy_qa", "chunk_id": 282, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe provides links to third party websites operated by organizations not affiliated with 23andMe.", "source": "privacy_policy_qa", "chunk_id": 283, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can update your sample storage preference to discard a stored sample within your Account Settings once your sample has completed processing.", "source": "privacy_policy_qa", "chunk_id": 284, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you do not want us to collect location information, you may disable that feature on your mobile device.", "source": "privacy_policy_qa", "chunk_id": 285, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Should you wish to have your childs personal information deleted from our records, please contact us at privacy@PeopleFun.com.", "source": "privacy_policy_qa", "chunk_id": 286, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We use a variety of security measures, including encryption and authentication tools, to help protect your information.", "source": "privacy_policy_qa", "chunk_id": 287, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This privacy policy explains our collection, use, disclosure, retention, and protection of your personal information, as well as your rights to your data under US and International Law, including but not limited to EU Directive 2002/58/EC and the EU General Data Protection Regulation (GDPR), the Controlling the Assault of Non-Solicited Pornography And Marketing Act of 2003 (CAN-SPAM), and the US Childrens Online Privacy Protection Act (COPPA).", "source": "privacy_policy_qa", "chunk_id": 288, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For more information on the appropriate safeguards in place, please contact us at the details below.", "source": "privacy_policy_qa", "chunk_id": 289, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "These activities may include, among other things, using your information in a manner consistent with this Privacy Statement to:", "source": "privacy_policy_qa", "chunk_id": 290, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Here is a link to the Privacy Policies for all our advertising partners:", "source": "privacy_policy_qa", "chunk_id": 291, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "As part of the Rakuten Group, Viber relies on the Rakuten Group Binding Corporate Rules to legitimize international data transfers within the Group.", "source": "privacy_policy_qa", "chunk_id": 292, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Although we strive to protect your personal data, we cannot guarantee the security of your data while it is being transmitted through our Services; any transmission is at your own risk.", "source": "privacy_policy_qa", "chunk_id": 293, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If for any reason you have a problem with deleting your personal information please contact Fiverr's Customer Support and we will make reasonable efforts to delete any such information pursuant to any applicable privacy laws.", "source": "privacy_policy_qa", "chunk_id": 294, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our distribution centers ship your kit(s) to you, and in some cases help return your kit safely to our third party laboratory so your sample can be processed.", "source": "privacy_policy_qa", "chunk_id": 295, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To learn more about exercising your EEA rights, visit our EEA rights page.", "source": "privacy_policy_qa", "chunk_id": 296, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please note that requests to restrict processing or delete your data may require the termination of your user account if we require the information subject to the deletion request to maintain your user account or otherwise provide gameplay services to you.", "source": "privacy_policy_qa", "chunk_id": 297, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "That means that your personal information may need to be processed in countries where data protection and privacy regulations may not offer the same level of protection as in your home country.", "source": "privacy_policy_qa", "chunk_id": 298, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Once we receive your raw Genetic Information from the laboratory, we further analyze it to provide you with our health and/or ancestry reports, dependent on the Service purchased.", "source": "privacy_policy_qa", "chunk_id": 299, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "A users location may be used to suggest other users with whom they might want to connect, analyze usage trends, or target certain promotions.", "source": "privacy_policy_qa", "chunk_id": 300, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can exercise your rights over your personal information, by opening a Customer Relations ticket.", "source": "privacy_policy_qa", "chunk_id": 301, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our appmay contain links to other third-party websites or you may access Apps from a third- party site.", "source": "privacy_policy_qa", "chunk_id": 302, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will provide your information to third party companies to perform certain services, including but not limited to payment processing, data analysis, e-mail delivery, hosting services, customer service and to assist us in our marketing efforts.", "source": "privacy_policy_qa", "chunk_id": 303, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "During kit registration, you are asked to review our Consent Document for Sample Storage and Additional Genetic Analyses.", "source": "privacy_policy_qa", "chunk_id": 304, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We have integrated continuous vulnerability scanning in our processes and regularly engage third party security experts to conduct penetration tests.", "source": "privacy_policy_qa", "chunk_id": 305, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may continue to process your Personal Information if it is necessary for the defense of legal claims, or for any other exceptions permitted by applicable law.", "source": "privacy_policy_qa", "chunk_id": 306, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "With your consent we or our service providers may send push notifications to your mobile device to provide Game updates and other relevant messages.", "source": "privacy_policy_qa", "chunk_id": 307, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Changes to this Policy are effective as of the stated \"Last Update\" and your continued use of the Site on or after the Last Update date will constitute acceptance of, and agreement to be bound by, those changes.", "source": "privacy_policy_qa", "chunk_id": 308, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to solicit input and feedback to improve PeopleFun products and services and customize your user experience;", "source": "privacy_policy_qa", "chunk_id": 309, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "No method of transmission over the Internet, or method of electronic storage, is 100% secure, however.", "source": "privacy_policy_qa", "chunk_id": 310, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may obtain your consent to collect and use certain types of personal information when we are required to do so by law (for example, in relation to Cookies and Tracking Technologies or when we process accurate location data for purposes other than performing the service).", "source": "privacy_policy_qa", "chunk_id": 311, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "It is important to remember that many of our services may not function properly if your cookies are disabled.", "source": "privacy_policy_qa", "chunk_id": 312, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "While some newer browsers have incorporated Do Not Track features which, when turned on, send a signal or preference to the web sites you visit indicating that you do not wish your online activity to be tracked, a DNT protocol that can be implemented across multiple devices and sites has not yet been widely adopted.", "source": "privacy_policy_qa", "chunk_id": 313, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For more information about their privacy policy, you may find it at https://www.mopub.com/legal/privacy/.", "source": "privacy_policy_qa", "chunk_id": 314, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "By proceeding through any of the above steps, you grant Groupon permission to access all of the elements of your social network profile information that you have made available to be shared and to use it in accordance with the social networks terms of use and this Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 315, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Data collected by Lima Sky is stored in secure operating environments that are not available to the public.", "source": "privacy_policy_qa", "chunk_id": 316, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Lima Sky may use analytics tools to develop and analyze use of the Services.", "source": "privacy_policy_qa", "chunk_id": 317, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Other marketing activities will happen based on the legitimate interests of 23andMe.", "source": "privacy_policy_qa", "chunk_id": 318, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This helps to support security and basic functionality and are necessary for the proper operation of the Site, so if you block these cookies we can't guarantee your use or the security during your visit.", "source": "privacy_policy_qa", "chunk_id": 319, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe is committed to subjecting all Personal Information received from the EU member countries, EEA and Switzerland, in reliance on the Privacy Shield Frameworks, to the Framework's applicable Principles.", "source": "privacy_policy_qa", "chunk_id": 320, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You have a right to prevent direct marketing of any form at any time - this can be exercised by following the opt-out link attached to each communication or by sending an email to optout@fiverr.com.", "source": "privacy_policy_qa", "chunk_id": 321, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We are not responsible for the privacy practices or the content of these third-party sites.", "source": "privacy_policy_qa", "chunk_id": 322, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We have enabled the following Google Analytics Advertising features: Remarketing, Google Display Network Impression Reporting, Google Analytics Demographics and Interest Reporting, and DoubleClick Campaign Manager integration.", "source": "privacy_policy_qa", "chunk_id": 323, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Proper access and use of information provided on the Site, including UGC, is governed by our Terms of Service.", "source": "privacy_policy_qa", "chunk_id": 324, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not knowingly collect personal information from users deemed to be children under their respective national laws.", "source": "privacy_policy_qa", "chunk_id": 325, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may raise such objection with regard to initial or further processing for purposes of direct marketing at any time and free of charge.", "source": "privacy_policy_qa", "chunk_id": 326, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "However, their use ofPersonal Informationobtained through Groupon is governed by their privacy policies and is not subject to our control.", "source": "privacy_policy_qa", "chunk_id": 327, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To learn more about the Privacy Shield program, and to view our certification, please visit U.S. Department of Commerce's Privacy Shield List.", "source": "privacy_policy_qa", "chunk_id": 328, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "It just means that the advertising you see displayed will not be customized to you and your interests and may be less relevant to you.", "source": "privacy_policy_qa", "chunk_id": 329, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will continue to monitor and assess the appropriateness of other valid data transfer mechanisms as they become available.", "source": "privacy_policy_qa", "chunk_id": 330, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Individual-level Information: information about a single individual's genotypes, diseases or other traits/characteristics, but which is not necessarily tied to Registration Information.", "source": "privacy_policy_qa", "chunk_id": 331, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In addition, we collect information while you access, browse, view or otherwise use the Site.", "source": "privacy_policy_qa", "chunk_id": 332, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The Site is a general audience site not directed at children under the age of 13.", "source": "privacy_policy_qa", "chunk_id": 333, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will store those contacts for purposes of helping you and your contacts make connections through our Services.", "source": "privacy_policy_qa", "chunk_id": 334, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your information will not be shared with others and is only used internally for the purposes described below:", "source": "privacy_policy_qa", "chunk_id": 335, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To send your privacy complaints under the Privacy Shield Principles, please contact the BBB EU PRIVACY SHIELD, operated by the Council of Better Business Bureaus.", "source": "privacy_policy_qa", "chunk_id": 336, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Advertisers may collect this information through the use of tracking technologies like browser cookies and web beacons.", "source": "privacy_policy_qa", "chunk_id": 337, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may use your information to contact you - to provide notices related to your activities, or offer you promotions and general updates, but we will not let any other person, including sellers and buyers, contact you, other than through your user profile on the Site.", "source": "privacy_policy_qa", "chunk_id": 338, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If any content you cannot remove or delete by yourself, please kindly reach us via support@gotokeep.com .", "source": "privacy_policy_qa", "chunk_id": 339, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "De-identified Information: information that has been stripped of your Registration Information (eg, your name and contact information) and other identifying data such that you cannot reasonably be identified as an individual, also known as pseudonymized information.", "source": "privacy_policy_qa", "chunk_id": 340, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "While we take certain precautions against possible security breaches of our Services, no website or Internet transmission is completely secure, and we cannot guarantee that unauthorized access, hacking, data loss, or other breaches will never occur.", "source": "privacy_policy_qa", "chunk_id": 341, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Back-Up: When you back-up your Viber conversations, they are kept on your devices service according to operating systems (Google/ iOS / desktop operating system) terms and policies and are no longer protected by Vibers end to end encryption.", "source": "privacy_policy_qa", "chunk_id": 342, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you are here, you have reached us by visiting www.PeopleFun.com or any other PeopleFun-owned website (the Site), or by registering with PeopleFun or installing any Game, or by using any of our other online or offline services (collectively, the Services).", "source": "privacy_policy_qa", "chunk_id": 343, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Google will not associate your IP address with any other data held by Google.", "source": "privacy_policy_qa", "chunk_id": 344, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our Services may contain links to websites and services that are owned or operated by third parties (each, a Third-party Service).", "source": "privacy_policy_qa", "chunk_id": 345, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Lima Sky requires device owners to specify their age before any Personal Information is collected.", "source": "privacy_policy_qa", "chunk_id": 346, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Also, please note that, unless we define a term in this Privacy Policy, all capitalized terms used in this Privacy Policy have the same meanings as in our Terms of Service.", "source": "privacy_policy_qa", "chunk_id": 347, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe cannot secure Personal Information that you release on your own or that you request us to release.", "source": "privacy_policy_qa", "chunk_id": 348, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "While you view our ads, we may gather user Global Unique Identifier, HTTP request data like, user agent, IP, host, url, country/continent from which request made, browser info, device/operating system/operating system version.", "source": "privacy_policy_qa", "chunk_id": 349, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "What happens if you do NOT consent to 23andMe Research?", "source": "privacy_policy_qa", "chunk_id": 350, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your unique advertising identifier is created by your mobile devices operating system and you can change it or choose not to share it at any time.", "source": "privacy_policy_qa", "chunk_id": 351, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe will not include your Genetic Information or Self-Reported Information in studies that start more than 30 days after you withdraw (it may take up to 30 days to withdraw your information after you withdraw your consent).", "source": "privacy_policy_qa", "chunk_id": 352, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We are not exposed to the payment information provided to our payment vendors, and this information is subject to the privacy policy applicable to the payment vendor; and", "source": "privacy_policy_qa", "chunk_id": 353, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you prefer not to receive interest-based ads from Groupon on third party sites, you can click on the AdChoices icon in the ad, which will direct you to theYour Groupon AdChoicespage where you can opt-out of receiving interest-based ads served by Groupon.", "source": "privacy_policy_qa", "chunk_id": 354, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "IF YOU DO NOT AGREE TO THIS PRIVACY POLICY, PLEASE DO NOT USE THE SERVICE.", "source": "privacy_policy_qa", "chunk_id": 355, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "With adequate data support, we will create and update more popular training classes for you to take.", "source": "privacy_policy_qa", "chunk_id": 356, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For example, we may provide you with advanced training classes with your updated weight and body measurement in aims to help you achieve your training goals smoothly.", "source": "privacy_policy_qa", "chunk_id": 357, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can find further information about Cookies in this Policy below, under \"Cookies\".", "source": "privacy_policy_qa", "chunk_id": 358, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When the laboratory has completed their analysis, they securely send the resulting Genetic Information to us identified by your unique barcode.", "source": "privacy_policy_qa", "chunk_id": 359, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you prevent these cookies, we cannot guarantee how the Site will perform for you.", "source": "privacy_policy_qa", "chunk_id": 360, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to combat fraud or criminal activity, and to protect our rights or those of ourAffiliates, users, andBusiness Partners, or as part of legal proceedings affecting Groupon;", "source": "privacy_policy_qa", "chunk_id": 361, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you are a resident of the European Economic Area, subject to the GDPR guidelines, you will be asked to confirm your desire to receive personalized advertising utilizing your device ID, coarse location and other data and to confirm that you are 16 years of age or older.", "source": "privacy_policy_qa", "chunk_id": 362, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To allow you to share your Personal Information for 23andMe Research purposes You have the choice to participate in 23andMe Research by providing your consent.", "source": "privacy_policy_qa", "chunk_id": 363, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not sell or rent your personal information to third parties for their marketing purposes without your explicit consent.", "source": "privacy_policy_qa", "chunk_id": 364, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To learn how the third party application uses your information, please review the third party's privacy statement.", "source": "privacy_policy_qa", "chunk_id": 365, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Were not responsible for the content, privacy or security practices and policies of any Third-party Service.", "source": "privacy_policy_qa", "chunk_id": 366, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will use your personal information for the following purposes:", "source": "privacy_policy_qa", "chunk_id": 367, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Contact Information: your name, postal addresses, email addresses, social networking website user account names, telephone numbers, or other addresses at which you are able to receive communications.", "source": "privacy_policy_qa", "chunk_id": 368, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may ask you for additional data to confirm your identity and for security purposes, before disclosing data requested to you.", "source": "privacy_policy_qa", "chunk_id": 369, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please note that we will not accept requests via the telephone, mail, or by facsimile, and we are not responsible for notices that are not labeled or sent properly, or that do not have complete information.", "source": "privacy_policy_qa", "chunk_id": 370, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The following is a more detailed explanation of the types of cookies we use:", "source": "privacy_policy_qa", "chunk_id": 371, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe may provide additional \"just-in-time\" disclosures or additional information about the data collection, use and sharing practices of specific Services.", "source": "privacy_policy_qa", "chunk_id": 372, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can request erasure of Personal Information that: (a) is no longer necessary in relation to the purposes for which it was collected or otherwise processed; (b) was collected in relation to processing to which you previously consented, but later withdrew such consent; or (c) was collected in relation to processing activities to which you object, and there are no overriding legitimate grounds for our processing.", "source": "privacy_policy_qa", "chunk_id": 373, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Users can disable cookies in their own browser settings, but please note that you may not be able to access certain features on our Website as a result.", "source": "privacy_policy_qa", "chunk_id": 374, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "(b) Improve our Services:We use call log information and usage information (as described above) to better understand network behavior and trends (numbers of messages and calls made by users, typical destinations, call lengths, network type, etc), detect potential outages and technical issues (this helps us notice things like a drop in call volume in a certain geography, a shift in call length, a change in typical networks, etc) to improve our Services.", "source": "privacy_policy_qa", "chunk_id": 375, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Google Analytics is used to perform many of the tasks listed above.", "source": "privacy_policy_qa", "chunk_id": 376, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you have any questions about security on our Web site, you can contact us at privacy@groupon.com.", "source": "privacy_policy_qa", "chunk_id": 377, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Visit the DAAs AdChoices page to learn more about interest-based advertising and to opt-out of having cookies placed by ad-serving companies.", "source": "privacy_policy_qa", "chunk_id": 378, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We cannot control any of your personal information held by third parties.", "source": "privacy_policy_qa", "chunk_id": 379, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For example, we may collect Personal Information with Keep via the following:", "source": "privacy_policy_qa", "chunk_id": 380, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you do not have an active Fiverr account, please contact us at privacy@fiverr.com.", "source": "privacy_policy_qa", "chunk_id": 381, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In the body of your request, please provide enough information for us to determine if this applies to you.", "source": "privacy_policy_qa", "chunk_id": 382, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe continuously works to improve our Services based on our research and product development, and genetic associations identified in scientific literature.", "source": "privacy_policy_qa", "chunk_id": 383, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "visit any page online that displays our ads or content;", "source": "privacy_policy_qa", "chunk_id": 384, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe Research may study a specific group or population, identify potential areas or targets for therapeutics development, conduct or support the development of drugs, diagnostics or devices to diagnose, predict or treat medical or other health conditions, work with public, private and/or non-profit entities on genetic research initiatives, or otherwise create, commercialize, and apply this new knowledge to improve health care.", "source": "privacy_policy_qa", "chunk_id": 385, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "the processing is necessary to comply with a relevant legal obligation or regulatory obligation that we have (e.g.", "source": "privacy_policy_qa", "chunk_id": 386, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To exercise any of your rights in connection with your personal information, we kindly ask that you open a Customer Relations ticket.", "source": "privacy_policy_qa", "chunk_id": 387, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The information may be disclosed to: (i) provide joint content and our services (eg, registration, coordination of membership accounts between the Viber corporate family, transactions, analytics and customer support); (ii) help detect and prevent potentially illegal acts, violations of our policies, fraud and/or data security breaches.", "source": "privacy_policy_qa", "chunk_id": 388, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We and our third party service providers do not use your Sensitive Information, such as Genetic Information and Self-Reported Information, for targeted advertising.", "source": "privacy_policy_qa", "chunk_id": 389, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We maintain technical, physical, and administrative security measures to protect the security of your personal information against loss, misuse, unauthorized access, disclosure, or alteration.", "source": "privacy_policy_qa", "chunk_id": 390, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will respond to your request within thirty (30) days.", "source": "privacy_policy_qa", "chunk_id": 391, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For more information about our marketing practices, please review our Cookie Policy.", "source": "privacy_policy_qa", "chunk_id": 392, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The person you referred may contact us at privacy@23andme.com to request that we remove this information from our database.", "source": "privacy_policy_qa", "chunk_id": 393, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The PeopleFun username will be public and will be shown to other users, but will only permit access to information that is considered public or that you have designated as public in your user profile settings.", "source": "privacy_policy_qa", "chunk_id": 394, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Non-Identifiable Informationmeans information that alone cannot identify you, including data fromCookies,Pixel Tags and Web Beacons, andDevice Data.", "source": "privacy_policy_qa", "chunk_id": 395, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To conduct surveys or polls, and obtain testimonials We value your feedback and may send you surveys, polls, or requests for testimonials to improve and optimize our Services.", "source": "privacy_policy_qa", "chunk_id": 396, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Sharing outside of the 23andMe Services You may decide to share your Personal Information with friends and/or family members, doctors or other health care professionals, and/or other individuals outside of our Services, including through third party services such as social networks and third party apps that connect to our website and mobile apps through our application programming interface (\"API\").", "source": "privacy_policy_qa", "chunk_id": 397, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will ask for your explicit consent to share any sensitive personal information such as race, religion, sexual orientation, or health.", "source": "privacy_policy_qa", "chunk_id": 398, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We use the information we collect to customize our services for you.", "source": "privacy_policy_qa", "chunk_id": 399, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our payment processor processes certain Registration Information, such as your billing address and credit card information, as necessary to enable you to purchase a 23andMe kit from the 23andMe.com online store.", "source": "privacy_policy_qa", "chunk_id": 400, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may collect additional information such as physical address, telephone number or other contact details and additional authentication information, to provide you with the services you need (such as payment or withdrawal of funds, sending physical goods), or to ensure the marketplace integrity (for example, prevention of fraud).", "source": "privacy_policy_qa", "chunk_id": 401, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We implement procedures and maintain contractual terms with each service provider to protect the confidentiality and security of your information.", "source": "privacy_policy_qa", "chunk_id": 402, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you would like more information about these practices and to know your choices about not having this information used by third party advertisers, please visithttp://www.networkadvertising.organdhttp://www.aboutads.info/choices/.", "source": "privacy_policy_qa", "chunk_id": 403, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will be happy to remove your childs information as appropriate.", "source": "privacy_policy_qa", "chunk_id": 404, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We take steps to ensure that the personal information we collect is accurate and up to date, and we provide you with the opportunity to update your information through your account profile settings.", "source": "privacy_policy_qa", "chunk_id": 405, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe does not endorse or sponsor any API applications, and does not affirm the accuracy or validity of any interpretations made by third party API applications.", "source": "privacy_policy_qa", "chunk_id": 406, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In the event you read this Privacy Policy in any language other than English, you agree that in the event of any discrepancies, the English version shall prevail.", "source": "privacy_policy_qa", "chunk_id": 407, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will process any requests in line with any local laws and our policies and procedures.", "source": "privacy_policy_qa", "chunk_id": 408, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to erase your personal information in limited circumstances where it is no longer necessary in relation to the purposes for which it was collected or processed;", "source": "privacy_policy_qa", "chunk_id": 409, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "These cookies are, for instance, used to personalise content for you in line with your location.", "source": "privacy_policy_qa", "chunk_id": 410, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to contact you with information that we reasonably believe may be relevant to you; and", "source": "privacy_policy_qa", "chunk_id": 411, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe maintains a formal incident management program designed to ensure the secure, continuous delivery of its Services.", "source": "privacy_policy_qa", "chunk_id": 412, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If for some reason, the message, wasnt delivered to its destination within up to 2 weeks, it will be deleted from our servers.", "source": "privacy_policy_qa", "chunk_id": 413, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "All the information you post may be accessible to anyone with Internet access, and anyPersonal Informationyou include in your posting may be read, collected, and used by others.", "source": "privacy_policy_qa", "chunk_id": 414, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you install our Games on your mobile device you can choose to receive push notifications.", "source": "privacy_policy_qa", "chunk_id": 415, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If we process your Personal Information based on a contract with you or based on your consent, or the processing is carried out by automated means, you may request to receive your Personal Information in a structured, commonly used and machine-readable format, and to have us transfer your Personal Information directly to another controller, where technically feasible, unless exercise of this right adversely affects the rights and freedoms of others.", "source": "privacy_policy_qa", "chunk_id": 416, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Some of our Services allow you to share information with others on a public basis.", "source": "privacy_policy_qa", "chunk_id": 417, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For individuals located in the European Economic Area (EEA), United Kingdom, or Switzerland (collectively the Designated Countries): We process your Personal Information in this way to provide our Services to you in accordance with our Terms of Service.", "source": "privacy_policy_qa", "chunk_id": 418, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may not opt-out of receiving non-promotional messages regarding your account, such as technical notices, purchase confirmations, or Service-related emails.", "source": "privacy_policy_qa", "chunk_id": 419, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can also remove or delete content from your account or entirely delete your whole Keep account.", "source": "privacy_policy_qa", "chunk_id": 420, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "so that we have an accurate record of your dealings with us in the event of any complaints or challenge; and", "source": "privacy_policy_qa", "chunk_id": 421, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you contact Customer Care or correspond with us about our Service, we collect information to: track and respond to your inquiry; investigate any breach of our Terms of Service, Privacy Statement or applicable laws or regulations; and analyze and improve our Services.", "source": "privacy_policy_qa", "chunk_id": 422, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe will use and share your Personal Information with third parties only in the ways that are described in this Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 423, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This Policy explains our privacy practices for the Site and services provided by Fiverr.", "source": "privacy_policy_qa", "chunk_id": 424, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not share personal information with third parties for their direct marketing purposes unless you affirmatively agree to such disclosure, typically by opting in to receive information from a third party that is participating in a sweepstakes or other promotion through our Services.", "source": "privacy_policy_qa", "chunk_id": 425, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Once you confirm your request, this process cannot be cancelled, undone, withdrawn, or reversed.", "source": "privacy_policy_qa", "chunk_id": 426, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you use our Chat Extensions and shopping solution we may know which items you searched and shared.", "source": "privacy_policy_qa", "chunk_id": 427, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Per applicable data protection regulations, our EU, UK, and International websites present visitors with a cookie opt in to allow the processing described above via Functionality and Advertising Cookies.", "source": "privacy_policy_qa", "chunk_id": 428, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Our Services may contain advertisements from companies other than PeopleFun that may link to their own websites.", "source": "privacy_policy_qa", "chunk_id": 429, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "(d) Process Your Payments: We may use your Information like your name and phone number to process your payments for our Services through a secured third-party service provider and, on an aggregate basis to determine charges for our phone carriers and other service providers.", "source": "privacy_policy_qa", "chunk_id": 430, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Learn more about how Google collects and uses data here.", "source": "privacy_policy_qa", "chunk_id": 431, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We or our service providers may also send local notifications to your mobile device to provide Game updates and other relevant information.", "source": "privacy_policy_qa", "chunk_id": 432, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Unless you make a request for us to delete your account or delete certain Personal Information (i.e., User Content, etc), we will store your Personal Information as long as your account is open.", "source": "privacy_policy_qa", "chunk_id": 433, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Games may use location-based tracking, which relies upon a mobile devices GPS coordinates.", "source": "privacy_policy_qa", "chunk_id": 434, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Some of the personal information you provide to us may be stored or processed on our behalf by third party suppliers and data processors and may be located in other jurisdictions, such as the United States and Israel, whose laws may differ from the jurisdiction in which you live.", "source": "privacy_policy_qa", "chunk_id": 435, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may provide your personal details to third parties, only in order to operate the Site, provide our services to you, fulfil obligations imposed on us by applicable laws and regulations, and prevent fraud and illegal activities, as detailed below:", "source": "privacy_policy_qa", "chunk_id": 436, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We collect information from you when you use Keep App  for example, when you:", "source": "privacy_policy_qa", "chunk_id": 437, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Furthermore you can prevent Googles collection and use of data (cookies and IP address) by downloading and installing the browser plug-in.", "source": "privacy_policy_qa", "chunk_id": 438, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may log in to the Site using certain social network credentials.", "source": "privacy_policy_qa", "chunk_id": 439, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We cannot prevent or control further use of this information so please make sure you only post information that youre happy to be seen publicly.", "source": "privacy_policy_qa", "chunk_id": 440, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe is responsible for the processing of Personal Information it receives, under the Privacy Shield Frameworks, or subsequently transfers to a third party acting as an agent on its behalf.", "source": "privacy_policy_qa", "chunk_id": 441, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Information on deleting or controlling cookies is also available at www.aboutcookies.org (note that this website is not provided by Fiverr, and we therefore cannot ensure its accuracy, completeness or availability).", "source": "privacy_policy_qa", "chunk_id": 442, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You agree and consent to our collection, transfer, and processing of yourPersonal InformationandNon-Identifiable Informationin accordance with this Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 443, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Under the EU General Data Protection Regulation, individuals residing in the EU and other territories that have adopted GDPR compliance or comparable regulation have a right to:", "source": "privacy_policy_qa", "chunk_id": 444, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "In particular, the law provides that companies must inform consumers about the categories of personal information that have been shared with third parties, the names and addresses of those third parties, and examples of the types of services or products marketed by those third parties.", "source": "privacy_policy_qa", "chunk_id": 445, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If we learn we have collected or received personal information from a child under 13, we will delete that personal information.", "source": "privacy_policy_qa", "chunk_id": 446, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Using Keep App.We collect information from and about you through your use of Keep App.", "source": "privacy_policy_qa", "chunk_id": 447, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To better enrich your experience, there may be products or services provided by third parties.", "source": "privacy_policy_qa", "chunk_id": 448, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Although Lima Sky takes commercially reasonable steps to instruct such advertising companies to comply with the terms and conditions of this Privacy Policy, Lima Sky does not have access to or control of third party technologies.", "source": "privacy_policy_qa", "chunk_id": 449, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you order any good or service through the Game, including any virtual currency or virtual good, our payment processing service provider will collect your name, phone number, e-mail address, mailing address, billing address, and complete credit card information that enables them to receive your payment.", "source": "privacy_policy_qa", "chunk_id": 450, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not have control over these terms of use and privacy policies, and have not reviewed their adequacy.", "source": "privacy_policy_qa", "chunk_id": 451, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "When you interact with our Services, we may collect and store information from you directly as described below:", "source": "privacy_policy_qa", "chunk_id": 452, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may use automated decisions to close an account based on such data and other logic we have created for this, in order to protect other users and prevent recurring breaches.", "source": "privacy_policy_qa", "chunk_id": 453, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Additionally, non-personal data means aggregate and de-personalized information, which is data Lima Sky collects about the use of Services, from which any personally identifiable data has been removed.", "source": "privacy_policy_qa", "chunk_id": 454, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You can download your raw Genetic Information within your Account Settings or by going to the applicable tool in Tools. If you would like to access or rectify any other information, contact Customer Care and we will do our best to assist you without undue delay.", "source": "privacy_policy_qa", "chunk_id": 455, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We believe that you have a right to know our practices regarding the information we may collect when you visit and/or use the Site.", "source": "privacy_policy_qa", "chunk_id": 456, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "During the register process, we read data from Apple HealthKit to simplify the age and weight input process, in the meantime, your training data will be sync back to Apple HealthKit.", "source": "privacy_policy_qa", "chunk_id": 457, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We apply a general rule of keeping personal information only for as long as is required to fulfil the purpose for which it was collected.", "source": "privacy_policy_qa", "chunk_id": 458, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "NOTE: If you are participating in 23andMe Research, 23andMe will withhold disclosure of your Personal Information involved in such Research in response to judicial or other government subpoenas, warrants or orders in accordance with any applicable Certificate of Confidentiality that 23andMe has obtained from the National Institutes of Health (NIH).", "source": "privacy_policy_qa", "chunk_id": 459, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The remainder of this Privacy Policy sets out further information regarding some of these categories.", "source": "privacy_policy_qa", "chunk_id": 460, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To manage the sharing of certainPersonal Informationwith us when you connect with us through social networking platforms or applications, refer to the privacy policy and settings of the social networking website or application.", "source": "privacy_policy_qa", "chunk_id": 461, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Please note that purchases from third parties may also be subject to additional policies.", "source": "privacy_policy_qa", "chunk_id": 462, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Information we collect may be stored or processed on computers located in any country where we do business.", "source": "privacy_policy_qa", "chunk_id": 463, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you delete your User Generated Content (UGC), as defined in the Fiverr Terms of Service, from the Site, copies of your UGC may remain viewable in cached and archived pages, or might have been copied or stored by other Site users.", "source": "privacy_policy_qa", "chunk_id": 464, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "So, please make sure that you have read and understand our Terms of Service.", "source": "privacy_policy_qa", "chunk_id": 465, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We do not sharePersonal InformationwithThird-Party Ad-Servers; however,Third-Party Ad-Serversmay automatically collectNon-Identifying Informationabout your visit to the Site and other websites, your device address, your Internet Service Provider and the browser you use to visit the Site.", "source": "privacy_policy_qa", "chunk_id": 466, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "(d) Information from Other Sources:The information we collect may be combined with information from outside records (eg demographic information and additional contact information) that we have received in accordance with the law.", "source": "privacy_policy_qa", "chunk_id": 467, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Lima Sky does not knowingly collect Personal Information from persons under the age of 13 without parental consent.", "source": "privacy_policy_qa", "chunk_id": 468, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may collect or receive information from other sources including (i) other PeopleFun users who choose to upload their email contacts, and (ii) third party information providers.", "source": "privacy_policy_qa", "chunk_id": 469, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe does not review or endorse, and is not responsible for, the privacy practices of these organizations.", "source": "privacy_policy_qa", "chunk_id": 470, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For purposes of this Privacy Policy, non-personal data means information that does not directly identify you.", "source": "privacy_policy_qa", "chunk_id": 471, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will post on this page and notify you via official notifications or emails.", "source": "privacy_policy_qa", "chunk_id": 472, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If there is any conflict between the terms in this Privacy Statement and the Privacy Shield Principles, the Privacy Shield Principles shall govern.", "source": "privacy_policy_qa", "chunk_id": 473, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "For Accounts registered directly with PeopleFun profile information is initially only available from the device that was used for registration.", "source": "privacy_policy_qa", "chunk_id": 474, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Should you ever deactivate your account with us, we will keep your information for a limited period in order to meet the above purposes.", "source": "privacy_policy_qa", "chunk_id": 475, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Location Data, Log Data and your device.Keep automatically collects Log Data from your device to enable and assist Keeps functionalities.", "source": "privacy_policy_qa", "chunk_id": 476, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Such notices may supplement or clarify 23andMes privacy practices or may provide you with additional choices about how 23andMe processes your Personal Information.", "source": "privacy_policy_qa", "chunk_id": 477, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We also receivePersonal Informationand other online and offline information fromOther Sources.", "source": "privacy_policy_qa", "chunk_id": 478, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "(c) Activity Information:While using the Viber Services, we will collect, and other users can see, your connection status, whether you have received and seen messages sent to you, if you are currently on another call, and information related to the calls and messages you have sent and received such as length of the call, who called who, who messaged who, and at what time; if you do not want people to know that youre online or that youve seen messages, you can change these options in your settings.", "source": "privacy_policy_qa", "chunk_id": 479, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "This creates an opt-out cookie which prevents the further processing of your data.", "source": "privacy_policy_qa", "chunk_id": 480, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "to a subsequent owner, co-owner or operator of one or more of the Sites or any portion or operation related to part of one or more of the Sites; or", "source": "privacy_policy_qa", "chunk_id": 481, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We may reject part or all of your request if responding to your request could adversely affect the rights and freedoms of others.", "source": "privacy_policy_qa", "chunk_id": 482, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Direct Marketing We will obtain your consent where required to send you marketing communications using electronic means.", "source": "privacy_policy_qa", "chunk_id": 483, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We will receive interaction information from your use of our Services.", "source": "privacy_policy_qa", "chunk_id": 484, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "The Rakuten Group Binding Corporate Rules can be found at https://corp.rakuten.co.jp/privacy/en/bcr.html.", "source": "privacy_policy_qa", "chunk_id": 485, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "To request a copy of the information disclosure provided by Groupon pursuant to Section 1798.83 of the California Civil Code, please contact us via the email or address stated above.", "source": "privacy_policy_qa", "chunk_id": 486, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "With respect to Personal Information received or transferred pursuant to the Privacy Shield Frameworks, 23andMe is subject to the regulatory enforcement powers of the U.S. Federal Trade Commission.", "source": "privacy_policy_qa", "chunk_id": 487, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We ask you to be responsible for safeguarding your password, secret questions and answers, and other authentication information you use to access our Services.", "source": "privacy_policy_qa", "chunk_id": 488, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "We reserve the right to charge a fee where permitted by law.", "source": "privacy_policy_qa", "chunk_id": 489, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "First of all, we want you to be assured that we do not read or listen to the content of your messages and/or calls made privately via Viber and we do not store those messages once they have been delivered to their destination (which on average takes less than one second).", "source": "privacy_policy_qa", "chunk_id": 490, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Receiving personnel do not perform testing, and testing personnel handle saliva samples that are only identified by a unique barcode.", "source": "privacy_policy_qa", "chunk_id": 491, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "If you have any questions (or comments) concerning this Policy, please email us at privacy@fiverr.com, and we will make an effort to reply within a reasonable timeframe.", "source": "privacy_policy_qa", "chunk_id": 492, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "23andMe will also retain limited information related to your account and data deletion request, including but not limited to, your email address, account deletion request identifier, and record of legal agreements for a limited period of time as required by contractual obligations, and/or as necessary for the establishment, exercise or defense of legal claims and for audit and compliance purposes.", "source": "privacy_policy_qa", "chunk_id": 493, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Your posts on public accounts and communities may remain available if you do not delete them.", "source": "privacy_policy_qa", "chunk_id": 494, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Prior to posting in these areas, please read ourTerms of Usecarefully.", "source": "privacy_policy_qa", "chunk_id": 495, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "You may also have the ability to share information directly with individuals who have not participated in our Service via a unique, shareable URL or through a social media platform (such information is \"User Content\").", "source": "privacy_policy_qa", "chunk_id": 496, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Any research involving your data that has already been performed or published prior to your withdrawal from 23andMe Research will not be reversed, undone, or withdrawn.", "source": "privacy_policy_qa", "chunk_id": 497, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "Legal bases for processing Personal Information from the EU We describe how we process your Personal Information in Sections 2 through 4 of this Privacy Statement.", "source": "privacy_policy_qa", "chunk_id": 498, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
{"text": "\"23andMe Research\" refers to research aimed at publication in peer-reviewed journals and other research funded by the federal government (such as the National Institutes of Health - NIH) conducted by 23andMe.", "source": "privacy_policy_qa", "chunk_id": 499, "meta": {"dataset": "amentaga-nttd/privacy-policy-qa-classification", "extraction_method": "qa_clause_extraction"}}
