{"text": "In the event either party (a) becomes adjudicated insolvent, (b) discontinues its business, (c) has voluntary of involuntary bankruptcy proceedings instituted against it, or (d) makes an assignment for the benefit of creditors, the other party shall be entitled to terminate this Agreement effective immediately upon written notice.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "FURTHER, SUBJECT TO AND WITHOUT LIMITING THE INDEMNIFICATION OBLIGATIONS OF EACH PARTY WITH RESPECT TO THIRD PARTY ACTIONS UNDER SECTIONS 12.1 AND 12.2, AND EXCEPT WITH RESPECT TO LIABILITY ARISING FROM BREACH OF SECTION 9.1 BY A PARTY OR ARISING FROM THE GROSS NEGLIGENCE OR WILLFUL MISCONDUCT OF A PARTY, EACH PARTY'S AGGREGATE LIABILITY TO THE OTHER PARTY FOR ALL CASES AND CONTROVERSIES ARISING OUT OF THE SUBJECT MATTER OF THIS AGREEMENT, REGARDLESS OF THE CAUSE OF ACTION AND WHETHER BROUGHT IN CONTRACT, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, WILL BE LIMITED TO $[***].", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "The arbitrator shall not award any Party punitive, exemplary, multiplied or consequential damages, and each Party hereby irrevocably waives any right to seek such damages in arbitration or in judicial proceedings.", "labels": {"binding_arbitration": 1.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 0.0}}
{"text": "In addition to and not in limitation of any other provision of this Article 9, each party hereby knowingly, voluntarily, and intentionally waives any right to recover from the other party, and Customer waives any right to recover from any Eligible Provider, any economic losses or damages in any action brought under tort theories, including, misrepresentation, negligence and/or strict liability, and/or relating to the quality or performance of any products or services provided by Metavante.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "SUCH LIMITATION SHALL BE THE EXTENT OF PCQ OR ABW'S LIABILITY REGARDLESS OF THE FORM IN WHICH ANY LEGAL OR EQUITABLE ACTION MAY BE BROUGHT AGAINST PCQ OR ABW, AND THE FOREGOING SHALL CONSTITUTE PCQ'S OR ABW'S SOLE REMEDY.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement shall be governed by the laws of the State of New York and all disputes and controversies arising out of or in connection with the Agreement shall be brought exclusively before the competent courts in New York County, New York; provided however that judgment shall be enforceable in any country and that nothing in this Section shall prevent or restrict either Party from seeking interim relief in any competent jurisdiction as it may deem fit.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement will be governed by the laws of the state where a suit is properly filed under the terms of this paragraph, being either Illinois or New York, and without giving effect to conflict of law principles.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement will be governed and construed in accordance with the laws of the State of New York without giving effect to conflict of laws principles. Both parties submit to personal jurisdiction in New York and further agree that any cause of action arising under this Agreement shall be brought in a court in New York City, NY.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "All disputes or claims by Payment Data Systems hereunder shall be resolved by arbitration in McLean, Virginia, pursuant to the rules of the American Arbitration Association.", "labels": {"binding_arbitration": 1.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 0.0}}
{"text": "All disputes or claims by NETWORK 1 hereunder shall be resolved by arbitration in San Antonio, Texas, pursuant to the rules of the American Arbitration Association.", "labels": {"binding_arbitration": 1.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 0.0}}
{"text": "This Agreement shall be governed by the laws of England and Wales, and all actions brought hereunder whether at law or in equity shall be brought in England.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement, the legal relations between the parties, and any action, whether contractual or non-contractual, instituted by any party with respect to matters arising under or growing out of or in connection with or in respect of this Agreement shall be governed by and construed in accordance with the internal laws of the State of Arizona (U.S.A.), excluding any choice of law rules that may direct the application of the laws of another jurisdiction, and except that questions affecting the construction and effect of any Patent shall be determined by the law of the country in which the Patent has been granted.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement will be governed by and construed inaccordance with the laws of British Columbia and the federal laws of Canada applicable in British Columbia, and the parties irrevocably submit to and accept generally and unconditionally the exclusive jurisdiction of the courts and appellate courts of British Columbia in that regard.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement shall be governed by and interpreted in accordance with the laws of England and Wales and the parties to this Agreement submit to the exclusive jurisdiction of the Courts of England and Wales in relation to any claim, dispute or matter arising out of or relating to this Agreement.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement shall be governed by and construed in accordance with the laws of the State of Texas and venue for any legal action brought in State Court shall lie exclusively in Tarrant County, Texas and venue for any action brought in federal court shall lie exclusively in the Northern District of Texas, Fort Worth Division.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement shall be governed by and construed in accordance with, the laws of the State of New York applicable to contracts executed in and to be performed in that State. All actions arising out of or relating to this Agreement shall be heard and determined exclusively in any New York state or federal court sitting in the Borough of Manhattan of The City of New York.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This agreement will be construed in accordance with the laws of Papua New Guinea and the parties submit to the non-exclusive jurisdiction of the National Court of Papua New Guinea.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement is governed by English law and the parties submit to the exclusive jurisdiction of the English courts in relation to any dispute (contractual or non-contractual) concerning this Agreement save that either party may apply to any court for an injunction or other relief to protect its Intellectual Property Rights.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "4.8 This Agreement will be governed exclusively by and construed in accordance with the laws of the Province of British Columbia, and the parties attorn to the exclusive jurisdiction of the Courts of British Columbia.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Letter of Authorization will be governed by and construed in accordance with the laws of California, excluding its conflict of laws provisions, and be subject to the non-exclusive jurisdiction of the California courts.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "his Agreement shall be governed by and construed in accordance with the laws of India and the Delhi Courts shall have exclusive jurisdiction over any legal proceedings in respect of this Agreement.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This AGREEMENT is controlled by the laws of the State of Texas, and venue for any actions brought to enforce this AGREEMENT shall be brought exclusively in a court of competent jurisdiction in Pecos County, Texas.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement shall be governed by and construed in accordance with the laws of the Commonwealth of Virginia applicable to contracts entered into and wholly to be performed within the Commonwealth of Virginia and, in the event of any litigation arising out of this Agreement, venue shall be the Commonwealth of Virginia.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement shall be governed by and construed in all respects in accordance with the law of England and Wales and both parties submit to the exclusive jurisdiction of the English Courts.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement and the transactions contemplated herein shall be governed by, and construed in accordance with, the laws of the State of Delaware, USA and disputes, if not resolved by the Parties, will be settled by binding arbitration in and under the rules of arbitration in London, England.", "labels": {"binding_arbitration": 1.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 0.0}}
{"text": "This Agreement and the relationship between the Parties shall be governed by, and interpreted in accordance with New York law without regard to provisions related to conflicts of laws, and, except as provided in Section 21.2 above, the Parties agree to submit any dispute to the exclusive jurisdiction of the federal and state courts sitting in New York.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement shall be governed by and construed in accordance with the laws of the State of California, excluding the choice of law rules, and the parties hereby agree to submit to the jurisdiction and venue of the State and Federal courts of the State of California, and agree that the State and Federal courts of the State of California shall be the exclusive forum for the resolution of all disputes related to or arising out of this Agreement.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "The Parties agree that this Agreement shall be governed by and construed in accordance with the laws of the State of Arizona without regard to conflicts of law provisions thereof or any other applicable law and that exclusive venue shall be in the federal or state courts located in Maricopa County, Arizona.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "This Agreement will be governed by the law of British Columbia and the parties attorn to the non-exclusive jurisdiction of the courts of British Columbia for the resolution of all disputes arising in connection with this Agreement.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "The Party seeking to enforce such infringement claims [***] of any suit brought by it claiming infringement of any Joint Patent. T", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "The parties acknowledge and agree that a \"Release Condition\" for purposes of the Escrow Agreement shall be deemed to mean any one or more of the following listed events (in addition to any other event specified as a release condition under the Escrow Agreement): (i) Ehave makes a general assignment for the benefit of creditors; (ii) Ehave voluntarily institutes any bankruptcy, insolvency, reorganization, moratorium, arrangement, readjustment or debt, dissolution, liquidation or similar proceeding relating to it under the laws of any jurisdiction, or any such proceeding is instituted against Ehave and is not dismissed within sixty (60) Business Days; or any judgment, writ, warrant or attachment or execution of similar process is issued or levied against a substantial part of Ehave's property and remains unsatisfied for sixty (60) Business Days; or Ehave applies for or consents to the appointment of any receiver, trustee or similar officer for it or for all or any substantial part of its property; or such receiver, trustee or similar officer is appointed without the consent of Ehave; (iii) Ehave consents to the filing of a petition of bankruptcy against it; (iv) a petition of bankruptcy is filed against Ehave which is not discharged within sixty (60) days; (v) Ehave becomes or is adjudicated by a court of competent jurisdiction as being bankrupt or insolvent or admits in writing its inability to pay its debts as they mature; Ehave ceases doing business as a going concern; (vi) Ehave undergoes a change of control or is a party to a merger or amalgamation; (vii) Ehave takes steps to dissolve, liquidate, wind up or otherwise terminate its existence; (viii) Ehave has terminated its provision of or ceased to provide the Ehave Companion Solution or support services for a continuing period of fifteen (15) Business Days or more, except pursuant to the termination of this Agreement by Ehave in accordance with its rights contained hrein.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "Corio shall notify Commerce One in writing if it believes that one of the following events (the \"RELEASE CONDITIONS\") has occurred and that it intends to seek release of the Source Code from the escrow account: (i) Commerce One's dissolution or ceasing to do business in the normal course, or (ii) Commerce One's repeated and material breach of its support and maintenance obligations under Section 5 of this Agreement and such breach is not cured within sixty (60) days of receipt of written notice thereof from Corio. If Commerce One notifies Corio in writing that it disputes whether any such event has occurred, officers of each of the parties shall negotiate for a period of ten (10) business days to attempt to resolve the dispute. At the end of such ten (10) business day period, if the parties have not resolved the dispute, the matter shall be referred to arbitration in the manner provided in Section 14.3 of this Agreement.", "labels": {"binding_arbitration": 1.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 0.0}}
{"text": "In addition, Impresse shall not now or in the future contest the validity of VerticalNet's ownership of its Intellectual Property; provided, however, that Impresse may contest the validity of VerticalNet's Intellectual Property in any proceeding brought against Impresse alleging infringement or misappropriation of VerticalNet's Intellectual Property.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "In addition, VerticalNet shall not now or in the future contest the validity of Impresse's ownership of its Intellectual Property; provided, however, that VerticalNet may contest the validity of Impresse's Intellectual Property in any proceeding brought against VerticalNet alleging infringement or misappropriation of Impresse's Intellectual Property.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "In addition, LeadersOnline shall not now or in the future contest the validity of VerticalNet's ownership of its Intellectual Property; provided, however, that LeadersOnline may contest the validity of VerticalNet's Intellectual Property in any proceeding brought against LeadersOnline alleging infringement or misappropriation of VerticalNet's Intellectual Property.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "In addition, VerticalNet shall not now or in the future contest the validity of LeadersOnline's ownership of its Intellectual Property; provided, however, that VerticalNet may contest the validity of LeadersOnline's Intellectual Property in any proceeding brought against VerticalNet alleging infringement or misappropriation of LeadersOnline's Intellectual Property.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "The Investor hereby irrevocably waives, to the extent that it may do so under applicable law: (a) any defense based on the adequacy of a remedy at law which may be asserted as a bar to the remedy of specific performance in any action brought against the Investor for specific performance of this Agreement by Agent, for itself and on behalf of the Lenders, or for the benefit of the Agent and the Lenders by a receiver or trustee appointed for any Borrower or in respect of all or a substantial part of any Borrower's assets under the bankruptcy or insolvency laws of any jurisdiction to which such Borrower is, or its assets are, subject, (b) all statutes of limitations as a defense to any action or proceeding brought against the Investor by the Agent, for itself and on behalf of the Lenders under this Agreement, to the fullest extent permitted by law, (c) any right the Investor may have to require the Agent or the Lenders to proceed against the Borrowers (or any of them), proceed against or exhaust any security held from the Borrowers (or any of them), or pursue any other remedy in the Agent's or the Lenders' power to pursue, (d) any defense based on any claim that the Investor's obligations hereunder exceed or are more burdensome than those of the Borrowers under the Financing Agreement or the other Loan Documents", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
{"text": "EACH OF THE INVESTOR, THE AGENT AND THE LENDERS IRREVOCABLY WAIVES ANY AND ALL RIGHT TO TRIAL BY JURY IN ANY LEGAL PROCEEDING ARISING OUT OF OR RELATING TO THIS AGREEMENT.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 1.0, "venue_selection": 0.0}}
{"text": "Notwithstanding any prior termination of this Agreement, [*], solely in its capacity as Remarketing Agent, hereby covenants and agrees that it shall not, prior to the date which is one year and one day after the redemption and the payment in full of the VRRM-MFP Shares and all accumulated dividends, petition or otherwise invoke the process of any court or government authority for the purpose of commencing a case against, the Fund under any federal or state bankruptcy, insolvency or similar law or appointing a receiver, liquidator, assignee, trustee, custodian, sequestrator or other similar official of the Fund or any substantial part of the property of the Fund; provided, however, that nothing in this provision shall preclude, or be deemed to stop, the Remarketing Agent from taking any action prior to the expiration of the aforementioned one year and one day period in (x) any case or proceeding voluntarily filed or commenced by the Fund, (y) any involuntary insolvency proceeding filed or commenced against the Fund by a Person other than the Remarketing Agent, or (z) with respect to its rights or preferences as a Beneficial Owner or Holder of VRRM-MFP Shares.", "labels": {"binding_arbitration": 0.0, "class_action_waiver": 0.0, "jury_trial_waiver": 0.0, "venue_selection": 1.0}}
