{"text": "the information we collect for as long as it is necessary for the purpose(s) for which we originally collected it. We may retain certain information for legitimate business purposes and/or if we believe doing so is in accordance with, or as required by, any applicable law. For example, if you violate our policies and your account is suspended or banned, we may store the identifiers used to create the account (such as phone number) to prevent you from creating new accounts. Your Rights and Choices You have choices about how to protect and limit the collection, use, and sharing of information about you when you use the Services. Depending on where you live, you may also have the right to correction/rectification of your personal information, to opt out of certain advertising practices, or to withdraw consent for processing where you have previously provided consent. Please see “Additional Information for EEA, Swiss, and UK Users” and “Additional Information for California & Other U.S. State Users.” Below we explain how to exercise each of these rights. Reddit does not discriminate against users for exercising their rights under data protection laws. Accessing and Changing Your Information You can access your information and change or correct certain information through the Services. See our Help Center page for more information. You can also request a copy of the personal information Reddit maintains about you by following the process described here. Deleting Your Account You may delete your account at any time from the settings page in your account. For more information, please visit our Help Center. When you delete your account, your profile is no longer visible to other users and disassociated from content you posted under that account. Please note, however, that the posts, comments, and messages you submitted prior to deleting your account", "labels": {"easy_termination": 1.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
{"text": "the date, application, and version of X) and information about your broadcast activity (e.g., Spaces), including broadcasts youâve created and when you created them, your lists, bookmarks, and Communities you are a part of. Your interactions with other usersâ content, such as reposts, likes, bookmarks, shares, downloads, replies, if other users mention or tag you in content or if you mention or tag them, and broadcasts youâve participated in (including your viewing history, listening, commenting, speaking, and reacting). How you interact with others on the platform, such as people you follow and people who follow you, metadata related toÂ Encrypted Messages, and when you useÂ Direct Messages, including the contents of the messages, the recipients, and date and time of messages. If you communicate with us, such as through email, we will collect information about the communication and its content. We collect information on links you interact with across our services (including in our emails sent to you). Purchase and payments. To allow you to make a payment or send money using X features or services, including through an intermediary, we may receive information about your transaction such as when it was made, when a subscription is set to expire or auto-renew, and amounts paid or received. Device Information. We collect information from and about the devices you use to access X, including: Information about your connection, such as your IP address, browser type, and related information. Information about your device and its settings, such as device and advertising ID, operating system, carrier, language, memory, apps installed, and battery level. Your device address book, if youâve chosen to share it with us. Location Information. When you use X, we collect some information about your approximate location to provide the service you expect, including showing you relevant ads. You can also", "labels": {"easy_termination": 0.0, "auto_renewal_friction": 1.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
{"text": "Children. If we become aware that personal information has been collected on the Platform from a Child, we will delete this information and terminate the Childâs account. If you believe there is a user who is below the age of 13, please contact us at: https://www.tiktok.com/legal/report/feedback.If you are a parent or guardian, our Guardian's Guide contains information and resources to help you understand the Platform and the tools and controls you can use. As a parent or guardian, you can also request the deletion of the account of your underage child or download the account data of your underage child by contacting us at https://www.tiktok.com/legal/report/privacy.If you are a parent or guardian, depending on your state of residence, you may have the ability to exercise certain rights over your child's or teen's account. For example, you may request the deletion of their accounts, download account data, or exercise other rights in connection with your child or teen by contacting us at https://www.tiktok.com/legal/report/privacy. We will address these requests in accordance with applicable law.Other RightsSharing for Direct Marketing Purposes (Shine the Light)If you are a California resident, once a calendar year, you may be entitled to obtain information about personal information that we shared, if any, with other businesses for their own direct marketing uses. To submit a request, contact us at:Â https://www.tiktok.com/legal/report/privacy.Content Removal for Users Under 18Users of the Platform who are California residents and are under 18 years of age may request and obtain removal of User Content they posted by contacting us at: https://www.tiktok.com/legal/report/privacy. All requests must provide a description of the User Content you want removed and information reasonably sufficient to permit us to locate that User Content. We do not accept California Removal Requests via postal mail, telephone, or facsimile. We may not be able to respond if", "labels": {"easy_termination": 1.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
{"text": "European Union (EU), European Economic Area (EEA), and Switzerland. Members and Visitors located in the Designated Countries or the UK can review additional information in our European Regional Privacy Notice. Services This Privacy Policy, including our Cookie Policy applies to your use of our Services. This Privacy Policy applies to LinkedIn.com, LinkedIn-branded apps, and other LinkedIn-branded sites, apps, communications and services offered by LinkedIn (“Services”), including off-site Services, such as our ad services and the “Apply with LinkedIn” and “Share with LinkedIn” plugins, but excluding services that state that they are offered under a different privacy policy. For California residents, additional disclosures required by California law may be found in our California Privacy Disclosure. Data Controllers and Contracting PartiesIf you are in the “Designated Countries”, LinkedIn Ireland Unlimited Company (“LinkedIn Ireland”) will be the controller of your personal data provided to, or collected by or for, or processed in connection with our Services.If you are outside of the Designated Countries, LinkedIn Corporation will be the controller of (or business responsible for) your personal data provided to, or collected by or for, or processed in connection with our Services.As a Visitor or Member of our Services, the collection, use and sharing of your personal data is subject to this Privacy Policy and other documents referenced in this Privacy Policy, as well as updates. Change Changes to the Privacy Policy apply to your use of our Services after the “effective date.” LinkedIn (“we” or “us”) can modify this Privacy Policy, and if we make material changes to it, we will provide notice through our Services, or by other means, to provide you the opportunity to review the changes before they become effective. If you object to any changes, you may close your account.You acknowledge that your continued use of our Services after", "labels": {"easy_termination": 1.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
{"text": "we make material changes to it, we will provide notice through our Services, or by other means, to provide you the opportunity to review the changes before they become effective. If you object to any changes, you may close your account.You acknowledge that your continued use of our Services after we publish or send a notice about our changes to this Privacy Policy means that the collection, use and sharing of your personal data is subject to the updated Privacy Policy, as of its effective date. 1. Data We Collect1.1 Data You Provide To Us You provide data to create an account with us. RegistrationTo create an account you need to provide data including your name, email address and/or mobile number, general location (e.g., city), and a password. If you register for a premium Service, you will need to provide payment (e.g., credit card) and billing information. You create your LinkedIn profile (a complete profile helps you get the most from our Services). ProfileYou have choices about the information on your profile, such as your education, work experience, skills, photo, city or area, endorsements, and optional verifications of information on your profile (such as verifications of your identity or workplace). You don’t have to provide additional information on your profile; however, profile information helps you to get more from our Services, including helping recruiters and business opportunities find you. It’s your choice whether to include sensitive information on your profile and to make that sensitive information public. Please do not post or add personal data to your profile that you would not want to be publicly available. You may give other data to us, such as by syncing your calendar. Posting and UploadingWe collect personal data from you when you provide, post or upload it to our Services, such as", "labels": {"easy_termination": 1.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
{"text": "which we recommend you review. We may provide support for the Netflix service (such as an online support forum for Netflix customer support, or a particular Netflix game). Information that you post or make available on such sites and forums are publicly available (unless otherwise noted on the site or forum).MinorsYou must be at least 18 years of age or older (or the age of majority in your country of residence) to subscribe to the Netflix service. Individuals under this age may only use the service with the involvement, supervision, and approval of a parent or legal guardian. To assist parents or legal guardians, we have various parental controls available and you can learn more here: help.netflix.com/node/264.Changes to this Privacy Statement We will update this Privacy Statement from time to time in response to changing legal, regulatory, or operational requirements. We will provide notice of any such changes (including when they will take effect) as required by law. Your continued use of the Netflix service after any such updates take effect will constitute acknowledgement and (as applicable) acceptance of those changes. If you do not want to acknowledge or accept any updates to this Privacy Statement, you may cancel your account. To see when this Privacy Statement was last updated, please see the \"Last Updated\" date below. Section F: Supplemental Privacy Disclosures for Certain Services and Regions The Supplemental Privacy Disclosures for Certain Services and Regions below apply in addition to disclosures above in this Privacy Statement. In addition, data protection laws in certain countries or regions may require us to provide additional or different information to disclosures above in this Privacy Statement. Where this is the case, such information is also provided in the section \"Supplemental Privacy Disclosures for Certain Services and Regions\" below. Netflix Games Supplemental Privacy DisclosuresWhen", "labels": {"easy_termination": 1.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
{"text": "At any time and from time to time after the occurrence of any Event of Default, Lender may accelerate this Note by written notice to Borrower, with the Outstanding Balance becoming immediately due and payable in cash at the Mandatory Default Amount. Notwithstanding the foregoing, at any time following the occurrence of any Event of Default, Lender may, at its option, elect to increase the Outstanding Balance by applying the Default Effect (subject to the limitation set forth below) via written notice to Borrower without accelerating the Outstanding Balance, in which event the Outstanding Balance shall be increased as of the date of the occurrence of the applicable Event of Default pursuant to the Default Effect, but the Outstanding Balance shall not be immediately due and payable unless so declared by Lender (for the avoidance of doubt, if Lender elects to apply the Default Effect pursuant to this sentence, it shall reserve the right to declare the Outstanding Balance immediately due and payable at any time and no such election by Lender shall be deemed to be a waiver of its right to declare the Outstanding Balance immediately due and payable as set forth herein unless otherwise agreed to by Lender in writing). Notwithstanding the foregoing, upon the occurrence of any Event of Default described in clauses (c), (d), (e), (f) or (g) of Section 4.1, the Outstanding Balance as of the date of acceleration shall become immediately and automatically due and payable in cash at the Mandatory Default Amount, without any written notice required by Lender. For the avoidance of doubt, Lender may continue making Conversions at any time following an Event of Default until such time as the Outstanding Balance is paid in full. Borrower further acknowledges and agrees that Lender may continue making Conversions following the entry of any judgment or arbitration award in favor of Lender until such time that the entire judgment amount or arbitration award is paid in full. Borrower agrees that any judgment or arbitration award will, by its terms, be made convertible into Common Stock. Any Conversions made following a judgment or arbitration award shall be made pursuant to the following formula: the amount of the judgment or arbitration award being converted divided by 80% of the lowest daily VWAP in the ten (10) Trading Days immediately preceding the date of Conversion. In such event, Borrower and Lender agree that it is their expectation that any such judgment amount or arbitration award that is converted will tack back to the Purchase Price Date for purposes of determining the holding period under Rule 144. Borrower and Lender agree and stipulate that any judgment or arbitration award entered against Borrower shall be reduced by $1,000.00 and such $1,000.00 shall become the new Outstanding Balance of this Note and this Note shall expressly survive such judgment or arbitration award. Additionally, following the occurrence of any Event of Default, Borrower may, at its option, pay any Conversion in cash instead of Conversion Shares by paying to Lender on or before the applicable Delivery Date (as defined below) a cash amount equal to the number of Conversion Shares set forth in the applicable Conversion Notice multiplied by the highest daily VWAP of the Common Stock that occurs during the period beginning on the date the applicable Event of Default occurred and ending on the date of the applicable Conversion Notice. In connection with acceleration described herein, Lender need not provide, and Borrower hereby waives, any presentment, demand, protest or other notice of any kind, and Lender may immediately and without expiration of any grace period enforce any and all of its rights and remedies hereunder and all other remedies available to it under applicable law. Such acceleration may be rescinded and annulled by Lender at any time prior to payment hereunder and Lender shall have all rights as a holder of the Note until such time, if any, as Lender receives full payment pursuant to this Section 4.2. No such rescission or annulment shall affect any subsequent Event of Default or impair any right consequent thereon. Nothing herein shall limit Lender’s right to pursue any other remedies available to it at law or in equity including, without limitation, a decree of specific performance and/or injunctive relief with respect to Borrower’s failure to timely deliver Conversion Shares upon Conversion of the Notes as required pursuant to the terms hereof.", "labels": {"easy_termination": 0.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 1.0}}
{"text": "At any time and from time to time after Lender becomes aware of the occurrence of any Event of Default, Lender may accelerate this Note by written notice to Borrower, with the Outstanding Balance becoming immediately due and payable in cash at the Mandatory Default Amount. Notwithstanding the foregoing, at any time following the occurrence of any Event of Default, Lender may, at its option, elect to increase the Outstanding Balance by applying the Default Effect (subject to the limitation set forth below) via written notice to Borrower without accelerating the Outstanding Balance, in which event the Outstanding Balance shall be increased as of the date of the occurrence of the applicable Event of Default pursuant to the Default Effect, but the Outstanding Balance shall not be immediately due and payable unless so declared by Lender (for the avoidance of doubt, if Lender elects to apply the Default Effect pursuant to this sentence, it shall reserve the right to declare the Outstanding Balance immediately due and payable at any time and no such election by Lender shall be deemed to be a waiver of its right to declare the Outstanding Balance immediately due and payable as set forth herein unless otherwise agreed to by Lender in writing). Notwithstanding the foregoing, upon the occurrence of any Event of Default described in clauses (c), (d), (e), (f) or (g) of Section 4.1, the Outstanding Balance as of the date of acceleration shall become immediately and automatically due and payable in cash at the Mandatory Default Amount, without any written notice required by Lender. At any time following the occurrence of any Event of Default, upon written notice given by Lender to Borrower, interest shall accrue on the Outstanding Balance beginning on the date the applicable Event of Default occurred at an interest rate equal to the lesser of 22% per annum or the maximum rate permitted under applicable law ( \"Default Interest\" ). For the avoidance of doubt, Lender may continue making Lender Conversions at any time following an Event of Default until such time as the Outstanding Balance is paid in full. Borrower further acknowledges and agrees that Lender may continue making Conversion following the entry of any judgment or arbitration award in favor of Lender until such time that the entire judgment amount or arbitration award is paid in full. Borrower agrees that any judgment or arbitration award will, by its terms, be made convertible into Common Stock. Any Conversions made following a judgment or arbitration award shall be made pursuant to the following formula: the amount of the judgment or arbitration award being converted divided by 80% of the lowest Closing Bid Price in the ten (10) Trading Days immediately preceding the date of Conversion. In such event, Borrower and Lender agree that it is their expectation that any such judgment amount or arbitration award that is converted will tack back to the Purchase Price Date for purposes of determining the holding period under Rule 144. Borrower and Lender agree and stipulate that any judgment or arbitration award entered against Borrower shall be reduced by $1,000.00 and such $1,000.00 shall become the new Outstanding Balance of this Note and this Note shall expressly survive such judgment or arbitration award. Additionally, following the occurrence of any Event of Default, Borrower may, at its option, pay any Conversion in cash instead of Conversion Shares by paying to Lender on or before the applicable Delivery Date (as defined below) a cash amount equal to the number of Conversion Shares set forth in the applicable Conversion Notice multiplied by the highest intra-day trading price of the Common Stock that occurs during the period beginning on the date the applicable Event of Default occurred and ending on the date of the applicable Conversion Notice. In connection with acceleration described herein, Lender need not provide, and Borrower hereby waives, any presentment, demand, protest or other notice of any kind, and Lender may immediately and without expiration of any grace period enforce any and all of its rights and remedies hereunder and all other remedies available to it under applicable law. Such acceleration may be rescinded and annulled by Lender at any time prior to payment hereunder and Lender shall have all rights as a holder of the Note until such time, if any, as Lender receives full payment pursuant to this Section 4.2. No such rescission or annulment shall affect any subsequent Event of Default or impair any right consequent thereon. Nothing herein shall limit Lender's right to pursue any other remedies available to it at law or in equity including, without limitation, a decree of specific performance and/or injunctive relief with respect to Borrower's failure to timely deliver Conversion Shares upon Conversion of the Notes as required pursuant to the terms hereof.", "labels": {"easy_termination": 0.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 1.0}}
{"text": "At any time and from time to time after Lender becomes aware of the occurrence of any Event of Default, Lender may accelerate this Note by written notice to Borrower, with the Outstanding Balance becoming immediately due and payable in cash at the Mandatory Default Amount. Notwithstanding the foregoing, at any time following the occurrence of any Event of Default, Lender may, at its option, elect to increase the Outstanding Balance by applying the Default Effect (subject to the limitation set forth below) via written notice to Borrower without accelerating the Outstanding Balance, in which event the Outstanding Balance shall be increased as of the date of the occurrence of the applicable Event of Default pursuant to the Default Effect, but the Outstanding Balance shall not be immediately due and payable unless so declared by Lender (for the avoidance of doubt, if Lender elects to apply the Default Effect pursuant to this sentence, it shall reserve the right to declare the Outstanding Balance immediately due and payable at any time and no such election by Lender shall be deemed to be a waiver of its right to declare the Outstanding Balance immediately due and payable as set forth herein unless otherwise agreed to by Lender in writing). Notwithstanding the foregoing, upon the occurrence of any Event of Default described in clauses (c), (d), (e), (f) or (g) of Section 4.1, the Outstanding Balance as of the date of acceleration shall become immediately and automatically due and payable in cash at the Mandatory Default Amount, without any written notice required by Lender. At any time following the occurrence of any Event of Default, upon written notice given by Lender to Borrower, interest shall accrue on the Outstanding Balance beginning on the date the applicable Event of Default occurred at an interest rate equal to the lesser of 22% per annum or the maximum rate permitted under applicable law (“ Default Interest ”). For the avoidance of doubt, Lender may continue making Conversions at any time following an Event of Default until such time as the Outstanding Balance is paid in full. Borrower further acknowledges and agrees that Lender may continue making Conversions following the entry of any judgment or arbitration award in favor of Lender until such time that the entire judgment amount or arbitration award is paid in full. Borrower agrees that any judgment or arbitration award will, by its terms, be made convertible into Common Stock. Any Conversions made following a judgment or arbitration award shall be made pursuant to the following formula: the amount of the judgment or arbitration award being converted divided by 80% of the lowest Closing Bid Price in the ten (10) Trading Days immediately preceding the date of Conversion. In such event, Borrower and Lender agree that it is their expectation that any such judgment amount or arbitration award that is converted will tack back to the Purchase Price Date for purposes of determining the holding period under Rule 144. Borrower and Lender agree and stipulate that any judgment or arbitration award entered against Borrower shall be reduced by $1,000.00 and such $1,000.00 shall become the new Outstanding Balance of this Note and this Note shall expressly survive such judgment or arbitration award. Additionally, following the occurrence of any Event of Default, Borrower may, at its option, pay any Conversion in cash instead of Conversion Shares by paying to Lender on or before the applicable Delivery Date (as defined below) a cash amount equal to the number of Conversion Shares set forth in the applicable Conversion Notice multiplied by the highest intra-day trading price of the Common Stock that occurs during the period beginning on the date the applicable Event of Default occurred and ending on the date of the applicable Conversion Notice. In connection with acceleration described herein, Lender need not provide, and Borrower hereby waives, any presentment, demand, protest or other notice of any kind, and Lender may immediately and without expiration of any grace period enforce any and all of its rights and remedies hereunder and all other remedies available to it under applicable law. Such acceleration may be rescinded and annulled by Lender at any time prior to payment hereunder and Lender shall have all rights as a holder of the Note until such time, if any, as Lender receives full payment pursuant to this Section 4.2. No such rescission or annulment shall affect any subsequent Event of Default or impair any right consequent thereon. Nothing herein shall limit Lender’s right to pursue any other remedies available to it at law or in equity including, without limitation, a decree of specific performance and/or injunctive relief with respect to Borrower’s failure to timely deliver Conversion Shares upon Conversion of the Notes as required pursuant to the terms hereof.", "labels": {"easy_termination": 0.0, "auto_renewal_friction": 0.0, "manual_cancellation": 0.0, "grace_period": 1.0}}
{"text": "To request the issuance of a Letter of Credit (or the amendment, renewal or extension of an outstanding Letter of Credit, other than an automatic renewal permitted pursuant to paragraph (c) of this Section), the Borrower shall deliver or fax (or transmit by electronic communication, if arrangements for doing so have been approved by the recipient) to the applicable Issuing Bank and the Administrative Agent, reasonably in advance of the requested date of issuance, amendment, renewal or extension, a notice requesting the issuance of a Letter of Credit, or identifying the Letter of Credit to be amended, renewed or extended, and specifying the date of issuance, amendment, renewal or extension (which shall be a Business Day), the date on which such Letter of Credit is to expire (which shall comply with paragraph (c) of this Section), the amount and currency of such Letter of Credit, the name and address of the beneficiary thereof and such other information as shall be reasonably necessary to enable the applicable Issuing Bank to prepare, amend, renew or extend such Letter of Credit. If requested by the applicable Issuing Bank, the Borrower also shall submit a letter of credit application on such Issuing Bank’s standard form in connection with any such request. A Letter of Credit shall be issued, amended, renewed or extended only if (and upon issuance, amendment, renewal or extension of each Letter of Credit the Borrower shall be deemed to represent and warrant that), after giving effect to such issuance, amendment, renewal or extension (i) the LC Exposure shall not exceed US$25,000,000 and (ii) the total Credit Exposures will not exceed the total Commitments and (iii) in the event the Existing Maturity Date shall have been extended as provided in Section 2.09, the sum of the LC Exposure attributable to Letters of Credit expiring after any Existing Maturity Date shall not exceed the total Commitments that shall have been extended to a date after the latest expiration date of such Letters of Credit. Notwithstanding the foregoing, no Issuing Bank shall be under any obligation to issue any Letter of Credit if (i) any order, judgment or decree of any Governmental Authority or arbitrator shall by its terms purport to enjoin or restrain such Issuing Bank from issuing the Letter of Credit, or any law applicable to such Issuing Bank or any request or directive (whether or not having the force of law) from any Governmental Authority with jurisdiction over such Issuing Bank shall prohibit, or request that such Issuing Bank refrain from, the issuance of letters of credit generally or the Letter of Credit in particular or shall impose upon such Issuing Bank with respect to the Letter of Credit any restriction, reserve or capital requirement (for which such Issuing Bank is not otherwise compensated hereunder) not in effect on the Restatement Effective Date, or shall impose upon such Issuing Bank any unreimbursed loss, cost or expense which was not applicable on the Restatement Effective Date and which such Issuing Bank in good faith deems material to it, (ii) the issuance of the Letter of Credit would violate one or more policies of such Issuing Bank applicable to letters of credit generally or (iii) such Issuing Bank does not as of the issuance date of the requested Letter of Credit issue Letters of Credit in the requested currency.", "labels": {"easy_termination": 0.0, "auto_renewal_friction": 1.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
{"text": "To request the issuance of a Letter of Credit (or the amendment, renewal or extension of an outstanding Letter of Credit, other than an automatic renewal permitted pursuant to paragraph (c) of this Section), the requesting Borrower shall deliver (or transmit by electronic communication, if arrangements for doing so have been approved by the recipient) to the applicable Issuing Bank and the Administrative Agent, reasonably in advance of the requested date of issuance, amendment, renewal or extension, a notice requesting the issuance of a Letter of Credit, or identifying the Letter of Credit to be amended, renewed or extended, and specifying the date of issuance, amendment, renewal or extension (which shall be a Business Day), the date on which such Letter of Credit is to expire (which shall comply with paragraph (c) of this Section), the amount and currency of such Letter of Credit, the name and address of the beneficiary thereof and such other information as shall be reasonably necessary to enable the applicable Issuing Bank to prepare, amend, renew or extend such Letter of Credit. If requested by the applicable Issuing Bank, the applicable Borrower also shall submit a letter of credit application on such Issuing Bank’s standard form in connection with any request for a Letter of Credit. A Letter of Credit shall be issued, amended, renewed or extended only if (and upon issuance, amendment, renewal or extension of each Letter of Credit the applicable Borrower shall be deemed to represent and warrant that), after giving effect to such issuance, amendment, renewal or extension (i) the LC Exposure shall not exceed US$75,000,000 and (ii) the total Revolving Credit Exposures will not exceed the total Commitments and (iii) in the event the Existing Maturity Date shall have been extended as provided in Section 2.09, the sum of the LC Exposure attributable to Letters of Credit expiring after any Existing Maturity Date and the Swingline Exposure attributable to Swingline Loans maturing after such Existing Maturity Date shall not exceed the total Commitments that shall have been extended to a date after the latest expiration date of such Letters of Credit and the latest maturity date of such Swingline Loans. Notwithstanding the foregoing, no Issuing Bank shall be under any obligation to issue any Letter of Credit if (i) any order, judgment or decree of any Governmental Authority or arbitrator shall by its terms purport to enjoin or restrain such Issuing Bank from issuing the Letter of Credit, or any law applicable to such Issuing Bank or any request or directive (whether or not having the force of law) from any Governmental Authority with jurisdiction over such Issuing Bank shall prohibit, or request that such Issuing Bank refrain from, the issuance of letters of credit generally or the Letter of Credit in particular or shall impose upon such Issuing Bank with respect to the Letter of Credit any restriction, reserve or capital requirement (for which such Issuing Bank is not otherwise compensated hereunder) not in effect on the Effective Date, or shall impose upon such Issuing Bank any unreimbursed loss, cost or expense which was not applicable on the Effective Date and which such Issuing Bank in good faith deems material to it, (ii) the issuance of the Letter of Credit would violate one or more policies of such Issuing Bank applicable to letters of credit generally or (iii) such Issuing Bank does not as of the issuance date of the requested Letter of Credit issue Letters of Credit in the requested currency.", "labels": {"easy_termination": 0.0, "auto_renewal_friction": 1.0, "manual_cancellation": 0.0, "grace_period": 0.0}}
