{"text": "We do not sell or rent your personal information to third parties for their direct marketing purposes without your explicit consent.\n\nQuestion: do you have to use your real name on fiverr?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 1.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We collect and hold only the information absolutely necessary for using our services, as well as limiting the internal access to your personal information for the purposes stated in Information Usage below.\n\nQuestion: would there be a way to see what data you collect?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 1.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "You may be able to correct Self-Reported Information entered into a survey, form, or feature within your account, such as on the surveys page, by clicking Edit your answers here. Please note that you may not be able to delete User Content that has been shared with others through the Service and that you may not be able to delete information that has been shared with third parties.\n\nQuestion: is the information encrypted", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "The purpose of this practice is to provide joint content and a better service from us and the group, and allow you to enjoy from the Rakuten ecosystem benefits, as well as for fraud prevention and personalization of the services,and any other purpose described in the privacy policy of the other Rakuten group company providing the service.\n\nQuestion: how is my data used?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "You should not disclose your authentication information to any third party and should immediately notify 23andMe of any unauthorized use of your password.\n\nQuestion: do you keep my data forever", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We do not share personal information with third parties for their direct marketing purposes unless you affirmatively agree to such disclosure, typically by opting in to receive information from a third party that is participating in a sweepstakes or other promotion through our Services.\n\nQuestion: does it collect location", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "For example, we use industry-standard encryption technology to secureFinancial Account Information.\n\nQuestion: do i need to enter any personal information to use it?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "We do not sharePersonal InformationwithThird-Party Ad-Servers; however,Third-Party Ad-Serversmay automatically collectNon-Identifying Informationabout your visit to the Site and other websites, your device address, your Internet Service Provider and the browser you use to visit the Site.\n\nQuestion: does it share my purchase information with others?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We will provide your information to third party companies to perform certain services, including but not limited to payment processing, data analysis, e-mail delivery, hosting services, customer service and to assist us in our marketing efforts.\n\nQuestion: is my information sold", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We will not disclose or transfer your personal information to any non-affiliated third parties, unless:\n\nQuestion: will my workout data be given to anyone else or shared with anyone (i.e. insurance companies)?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "Your data is kept safe with us, but we do share your personal information with third parties we trust in order to provide you with our services, as follows:\n\nQuestion: how are my contacts stored?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We may disclose aggregated and anonymous information to describe the Services to prospective partners, advertisers, and other third parties, and for other lawful purposes.\n\nQuestion: does the app sell any personal information?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We do not sell or rent your personal information to third parties for their marketing purposes without your explicit consent.\n\nQuestion: will potential employers be able to obtain my address?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 1.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "To provide you with a better experience through improving our products, services, content, and advertising or otherwise where you have consented, we may share the personal information with our affiliate companies and with joint venture partners and third-party service providers, contractors and agents, and use it consistent with this Privacy Policy.\n\nQuestion: will the personal info i share with this app to sign up be shared with other companies, etc?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "(d) Legal and Law Enforcement: We may disclose your information to law enforcement, governmental agencies, or authorized third-parties, in response to a verified request relating to terror acts, criminal investigations or alleged illegal activity or any other activity that may expose us, you, or any other Viber user to legal liability.\n\nQuestion: if it's free, does viber profit off its users in some way?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "You can restrict our processing of your Personal Information where one of the following applies: (a) you dispute the accuracy of Personal Information processed by 23andMe (for a period enabling us to verify its accuracy); (b) the processing is unlawful and you oppose the erasure of the Personal Information and request the restriction of its use instead; (c) 23andMe no longer needs the Personal Information for the purposes of the processing, but it is required by you for the establishment, exercise or defense of legal claims; and (d) you have objected to certain processing relying on legitimate interest, pending the verification whether 23andMes legitimate grounds override your rights.\n\nQuestion: can other customers i connect with access my personal information?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 1.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We will ask for your explicit consent to share any sensitive personal information such as race, religion, sexual orientation, or health.\n\nQuestion: can it access my other social media accounts?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 1.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We share the information described above in Section 2 with our third party service providers, as necessary for them to provide their services to us and help us perform our contract with you.\n\nQuestion: can other members view my real name?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "23andMe will ask for your consent to share Individual-level Genetic Information or Self-Reported Information with any third party, other than our service providers as necessary for us to provide the Services to you.\n\nQuestion: do you keep my information and build a database for selling me products with it?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We direct all such third party service providers to maintain the confidentiality of the information disclosed to them and to not use your information for any purpose other than to provide services on PeopleFuns behalf.\n\nQuestion: is my information sold", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "For example, we may use information collected from you in any one or more of the following ways:\n\nQuestion: how do they keep track of how many people are playing the game?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "Please note that the Site may contain links to third party sites and if you link to a third party site from the Site, any data you provide to that site and any use of that data by the third party are not under the control of Fiverr and are not subject to this Policy.\n\nQuestion: do you sell my information to third parties?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "If you have completed the Individual Level Data Sharing Consent, or additional consent agreement, in addition to the uses above under the Main Consent Document, 23andMe may share De-identified Individual-level Genetic Information and Self-Reported Information with select third party research collaborators for 23andMe partners for Research purposes.\n\nQuestion: does it store my dna information for long periods of time?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We do not actively share personal information with third party advertisers for their direct marketing purposes unless you give us your consent.\n\nQuestion: does this app sell customer information?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "However we will not share Individual-level Genetic Information or Self-Reported Information with any third party without your consent.\n\nQuestion: if my genetic data turns out to be unexpected, can my family see it?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "These include the following rights to: access your personal information, rectify the information we hold about you, erase your personal information, restrict our use of your personal information, object to our use of your personal information, receive your personal information in a usable electronic format and transmit it to a third party (right to data portability), lodge a complaint with your local data protection authority.\n\nQuestion: what control do i have as a user to limit the access to my account?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 1.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We may share your information (in some cases personal information) with third parties in the following circumstances:\n\nQuestion: will this app sell my information to any 3rd parties?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "23andMe will use and share your Personal Information with third parties only in the ways that are described in this Privacy Statement.\n\nQuestion: do you publish my data", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "If you provide us with Personal Information about others, or if others give us your information, for the purpose of ordering the Service as a gift, we will only use that information for the specific reason for which it was provided to us.\n\nQuestion: is any information recorded", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "Games may use location-based tracking, which relies upon a mobile devices GPS coordinates.\n\nQuestion: does it have access to financial apps i use?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "If you do ask us to share your personal information with a third party for its marketing purposes, we will only share information in connection with that specific promotion, as we do not share information with any third party (other than our service providers) on a continual basis.\n\nQuestion: are there any in game purchases in the wordscapes app that i should be concerned about?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "(b) App Providers and Other Third-Parties:We may disclose your information to service providers and other third-parties under contract who help with providing you and others our Services on our behalf or other services provided by third-parties via our Services (such as, but not limited to, fraud and spam investigations, payment processing, site analytics and operations, providing special partnership features in our service either on an aggregate non identifiable basis, or using a unique identifier which is not attributable to you).\n\nQuestion: does viber have any affiliation with the advertisement industry?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "By accessing or using the Services, you agree to this Privacy Policy, our Terms of Service.\n\nQuestion: what kind of permissions does this app require?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 1.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We will only share your Personal Information with third parties for marketing purposes with your explicit consent.\n\nQuestion: do you keep my information and build a database for selling me products with it?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 1.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "We are not exposed to the payment information provided to our payment vendors, and this information is subject to the privacy policy applicable to the payment vendor; and\n\nQuestion: can other people see my financial information", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "Residents of the State of California can request a list of all third-parties to which our App has disclosed certain personal information (as defined by California law) during the preceding year for those third-parties direct marketing purposes.\n\nQuestion: does the app consume data or use wifi when in use?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "23andMe does not disclose your information to organizations operating such linked third party websites.\n\nQuestion: what steps do you take to protect my data from hackers?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "In general, we collect, store and use your information to provide you with a customized experience.\n\nQuestion: is my information secure", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "This includes whether you are presently online, your personal preferences (such as connecting the service to Viber) and the way you use that service (for example how often, for how long).\n\nQuestion: do you require me to submit identifying information?", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "For example, we may use the information collected from you to verify your identity.\n\nQuestion: how are payment transactions handled on your platform.", "labels": {"data_collection_extensive": 0.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 1.0}}
{"text": "While some newer browsers have incorporated Do Not Track features which, when turned on, send a signal or preference to the web sites you visit indicating that you do not wish your online activity to be tracked, a DNT protocol that can be implemented across multiple devices and sites has not yet been widely adopted.\n\nQuestion: does it share data with others", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
{"text": "In particular, the law provides that companies must inform consumers about the categories of personal information that have been shared with third parties, the names and addresses of those third parties, and examples of the types of services or products marketed by those third parties.\n\nQuestion: what security system do you have in place for the app?", "labels": {"data_collection_extensive": 1.0, "data_collection_minimal": 0.0, "consent_explicit": 0.0, "consent_implied": 0.0, "purpose_specific": 0.0, "purpose_broad": 0.0}}
