{"text": "You should carefully review their privacy statements and other conditions of use.&nbsp; DISCLAIMER OF WARRANTIES AND LIMITATION OF LIABILITY THE AMAZON SERVICES AND ALL INFORMATION, CONTENT, MATERIALS, PRODUCTS (INCLUDING SOFTWARE) AND OTHER SERVICES INCLUDED ON OR OTHERWISE MADE AVAILABLE TO YOU THROUGH THE AMAZON SERVICES ARE PROVIDED BY AMAZON ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS, UNLESS OTHERWISE SPECIFIED IN WRITING.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Conditions of Use - Amazon Customer Service.html"}
{"text": "Limitations of Liability We are not liable for any special or consequential damages resulting from your use of, or your inability to use, this site or the materials in this site or any linked site, including, but not limited to, lost profits, business interruption, and loss of programs or other data on your information handling system.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/FamilySearch Terms of Use. Everything you need to know, in one place..html"}
{"text": "Disclaimer of Warranties O.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/GitHub Terms of Service - GitHub Docs.html"}
{"text": "Limitation of Liability P.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/GitHub Terms of Service - GitHub Docs.html"}
{"text": "Disclaimer of Warranties We provide our service as is, and we make no promises or guarantees about this service.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/GitHub Terms of Service - GitHub Docs.html"}
{"text": "Limitation of Liability We will not be liable for damages or losses arising from your use or inability to use the service or otherwise arising under this agreement.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/GitHub Terms of Service - GitHub Docs.html"}
{"text": "Disclaimer of Warranties Short version: We provide our service as is, and we make no promises or guarantees about this service.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/GitHub Terms of Service - GitHub Docs.html"}
{"text": "Limitation of Liability Short version: We will not be liable for damages or losses arising from your use or inability to use the service or otherwise arising under this agreement.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/GitHub Terms of Service - GitHub Docs.html"}
{"text": "Please review Section 25 of this Agreement carefully, as it contains an arbitration provision and class action waiver which requires User to resolve disputes with Provider through final, binding arbitration on an individual basis.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "Please review Section 25 of this Agreement carefully, as it contains an arbitration provision and class action waiver which requires User to resolve disputes with Provider through final, binding arbitration on an individual basis.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "By entering into this Agreement, User is acknowledging that User has read and that User understands the terms of this Agreement and that User agrees to be bound by the arbitration provision and class action waiver.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "By entering into this Agreement, User is acknowledging that User has read and that User understands the terms of this Agreement and that User agrees to be bound by the arbitration provision and class action waiver.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "To initiate an arbitration proceeding, an arbitration claim must be submitted by the claimant (the“Claimant”) to the AAA, and a written Demand for Arbitration must be provided to the other party (the “Opposing Party”), pursuant to the AAA Rules.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "Arbitration hearings will be held in Baltimore County, Maryland.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "If PROVIDER and User cannot mutually agree upon an arbitrator within ten (10) days of the Opposing Party’s receipt of the Demand for Arbitration from the Claimant, then the AAA shall appoint a single arbitrator that satisfies the Arbitrator Requirements.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "The arbitrator will follow the law and will give effect to any applicable statutes of limitation and/or any limitation on claims by Employer as provided for in an applicable PROVIDER service agreement.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "The arbitrator may award attorneys' fees and expert witnesses' fees and costs to the prevailing party.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "The award rendered by the arbitrator shall be final and binding upon User and PROVIDER.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "User and PROVIDER agree and acknowledge that this Agreement evidences a transaction involving interstate commerce and that the Federal Arbitration Act (Title 9 of the United States Code) shall govern the interpretation, enforcement, and proceedings pursuant to the arbitration clause in this Agreement.", "label": "ARBITRATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "USER FURTHER ACKNOWLEDGES, UNDERSTANDS, AND AGREES THAT USER AND PROVIDER ARE EACH WAIVING THEIR RESPECTIVE RIGHTS TO A TRIAL BY JURY AS TO DISPUTES HEREUNDER AND THAT USER IS WAIVING ITS RIGHT TO PARTICIPATE IN ANY CLASS ACTION PROCEEDING ARISING FROM THIS AGREEMENT.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "Disclaimer of Warranties; Limitation of Liability.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/KTBSOnline User Agreement.txt"}
{"text": "ALL INFORMATION PROVIDED ON THE SITE IS SUBJECT TO CHANGE WITHOUT NOTICE.", "label": "UNILATERAL_CHANGES", "source": "test-pages/curated-tos/Legal - Website Terms of Use - Apple.html"}
{"text": "Limitation of Liability Except where prohibited by law, in no event will Apple be liable to you for any indirect, consequential, exemplary, incidental or punitive damages, including lost profits, even if Apple has been advised of the possibility of such damages.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Legal - Website Terms of Use - Apple.html"}
{"text": "The information contained in this web site is subject to change without notice.", "label": "UNILATERAL_CHANGES", "source": "test-pages/curated-tos/Legal - Website Terms of Use - Apple.html"}
{"text": "We are not liable for any damages, costs, or expenses incurred by You as a result of the discontinuation of any Model, provided that We have complied with the notice periods set forth above.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Legal terms and conditions _ Mistral AI _ Frontier AI in your hands.html"}
{"text": "Limitation of liability Liability Cap for Free Services.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Legal terms and conditions _ Mistral AI _ Frontier AI in your hands.html"}
{"text": "Where the User is not located in France, all disputes arising out of or in connection with this Agreement or its subject matter or formation shall be finally settled under the rules of arbitration of the international chamber of commerce (the “ ICC ”) by one arbitrator appointed in accordance with the said rules.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Legal terms and conditions _ Mistral AI _ Frontier AI in your hands.html"}
{"text": "The arbitration proceedings shall take place exclusively at the ICC headquarters in Paris, France.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Legal terms and conditions _ Mistral AI _ Frontier AI in your hands.html"}
{"text": "The appointed arbitrator shall adjudicate the dispute in accordance with the applicable law.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Legal terms and conditions _ Mistral AI _ Frontier AI in your hands.html"}
{"text": "If You are not located in France, all disputes arising out of or in connection with these Deployment Terms or their matter or formation shall be finally settled under the rules of arbitration of the international chamber of commerce (the “ICC”) by one arbitrator appointed in accordance with the said rules.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Legal terms and conditions _ Mistral AI _ Frontier AI in your hands.html"}
{"text": "Limitation of Liability The liability of each Party and each Party’s affiliates under this DPA is subject to the exclusions and limitations of liability set out in the Agreement.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Legal terms and conditions _ Mistral AI _ Frontier AI in your hands.html"}
{"text": "D&amp;B and any third-party information suppliers are not liable for how others use D&amp;B data.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/SAM.gov _ Sign Terms of Use.html"}
{"text": "You agree that: (i) Splunk’s total liability under these General Terms as set out in section 20 (Limitation of Liability) states the overall combined liability of Splunk and our Splunk Affiliate Distributors; (ii) entering into Orders by a Splunk Affiliate Distributor will not be deemed to expand Splunk and its Affiliates’ overall responsibilities or liability under these General Terms; and (iii) you will have no right to recover more than once from the same event.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Splunk General Terms _ Splunk.html"}
{"text": "The termination or expiration of these General Terms will not affect any provisions which, by their nature, survive termination or expiration, including the provisions that deal with the following subject matters: definitions, ownership of intellectual property, confidentiality, payment obligations, effect of termination, limitation of liability, privacy, and the “Miscellaneous” section in these General Terms.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Splunk General Terms _ Splunk.html"}
{"text": "Limitation of Liability Each party’s aggregate liability, together with any of its Affiliates, arising out of or related to these General Terms will not, in any event, exceed the total amount paid by you for the affected Offering in the 12 months preceding the first incident out of which the liability arose.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Splunk General Terms _ Splunk.html"}
{"text": "Limitation of Liability 21.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Splunk General Terms _ Splunk.html"}
{"text": "Disclaimer Of Warranty.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Glider AI.html"}
{"text": "Limitation Of Liability.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Glider AI.html"}
{"text": "IMPORTANT ARBITRATION NOTICE: IF YOU ARE IN THE UNITED STATES OR CANADA, YOU AGREE THAT DISPUTES BETWEEN YOU AND QUORA WILL BE RESOLVED BY BINDING, INDIVIDUAL ARBITRATION AND YOU WAIVE YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION LAWSUIT OR CLASS-WIDE ARBITRATION.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "IMPORTANT ARBITRATION NOTICE: IF YOU ARE IN THE UNITED STATES OR CANADA, YOU AGREE THAT DISPUTES BETWEEN YOU AND QUORA WILL BE RESOLVED BY BINDING, INDIVIDUAL ARBITRATION AND YOU WAIVE YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION LAWSUIT OR CLASS-WIDE ARBITRATION.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "WE EXPLAIN SOME EXCEPTIONS AND HOW YOU CAN OPT OUT OF ARBITRATION BELOW IN SECTION 11.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The right for Quora to copy, display, transmit, publish, perform, distribute, store, modify, and otherwise use any question you post, and sublicense those rights to others, is perpetual and irrevocable, to the maximum extent permitted by law, except as otherwise specified in these Terms.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Disclaimers And Limitation Of Liability PLEASE READ THIS SECTION CAREFULLY SINCE IT LIMITS THE LIABILITY OF QUORA ENTITIES TO YOU.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "10.3 YOU AGREE THAT TO THE MAXIMUM EXTENT PERMITTED BY LAW, QUORA ENTITIES WILL NOT BE LIABLE TO YOU UNDER ANY THEORY OF LIABILITY.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "WITHOUT LIMITING THE FOREGOING, YOU AGREE THAT, TO THE MAXIMUM EXTENT PERMITTED BY LAW, QUORA ENTITIES SPECIFICALLY WILL NOT BE LIABLE FOR ANY INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL, OR EXEMPLARY DAMAGES, LOSS OF PROFITS, BUSINESS INTERRUPTION, REPUTATIONAL HARM, OR LOSS OF DATA (EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES OR SUCH DAMAGES ARE FORESEEABLE) ARISING OUT OF OR IN ANY WAY CONNECTED WITH YOUR USE OF, OR INABILITY TO USE, THE QUORA PLATFORM.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Legal Disputes and Arbitration Agreement for Users PLEASE READ THE FOLLOWING SECTION CAREFULLY – IT MAY SIGNIFICANTLY AFFECT YOUR LEGAL RIGHTS, INCLUDING YOUR RIGHT TO FILE A LAWSUIT IN COURT.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The parties agree to use best efforts to settle any dispute, claim, question, or disagreement directly through consultation and good faith negotiations with us, before initiating a lawsuit or arbitration.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Only after the parties have engaged in a good-faith effort to resolve the dispute in accordance with this Initial Dispute Resolution process, and only if those efforts fail, then either party may initiate binding arbitration as the sole means to resolve claims using the procedures set forth below in Sections 11.4 &amp; 11.5.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If you are initiating arbitration, a copy of the demand shall also be emailed to legal@quora.com .", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If Quora is initiating arbitration, it will serve a copy of the demand to the email address associated with your Quora account.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitrator has the right to impose sanctions in accordance with the National Arbitration and Mediation (“NAM”) rules and procedures for any frivolous claims or submissions the arbitrator determines have not been filed in good faith, as well as for a party's failure to comply with this Section.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The applicable NAM rules and procedures are available at Homepage or by emailing National Arbitration and Mediation’s Commercial Dept at commercial@namadr.com .", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "11.2 Agreement to Binding Arbitration.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If an agreed upon solution is not reached through informal dispute resolution as outlined above within a period of sixty (60) days pursuant to the initial dispute resolution procedure provided in Section 11.1 above, then either party may initiate binding arbitration to formally resolve claims, subject to the terms and exclusion set forth below.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "This includes claims that arose, were asserted, or involve facts occurring before the existence of this Arbitration Agreement or any prior agreement as well as claims that may arise after the termination of this Arbitration Agreement, in accordance with the notice and opt-out provisions set forth in Section 11.9).", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "This Arbitration Agreement is governed by the Federal Arbitration Act (\"FAA\") in all respects and evidences a transaction involving interstate commerce.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "You and Quora expressly agree that the FAA shall exclusively govern the interpretation and enforcement of this Arbitration Agreement.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If for whatever reason the rules and procedures of the FAA cannot apply, the state law governing arbitration agreements in the state in which you reside shall apply.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitrator shall be empowered to grant whatever relief would be available in a court under law or in equity.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "They further understand that, in some instances, the costs of arbitration could exceed the costs of litigation and the right to discovery may be more limited in arbitration than in court.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "YOU HEREBY ACKNOWLEDGE AND AGREE THAT YOU AND QUORA ARE EACH WAIVING THE RIGHT TO A TRIAL BY JURY TO THE MAXIMUM EXTENT PERMITTED BY LAW.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Except as set forth in Sections 11.5 &amp; 11.6 below, if any provision of this Arbitration Agreement is found by an arbitrator or court of competent jurisdiction to be invalid, the parties nevertheless agree that the arbitrator or court should endeavor to give effect to the parties' intentions as reflected in the provision, and the other provisions thereof remain in full force and effect.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If you are a resident of the United States, arbitration will take place in the County where you reside.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "For residents in Canada (and anywhere else outside the United States), arbitration shall be initiated in the County of Santa Clara, State of California, United States of America, unless you and Quora otherwise agree or unless the designated arbitrator determines that such venue would be unreasonably burdensome to any party, in which case the arbitrator shall have the discretion to select another venue.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "For any arbitration conducted in California, You and Quora agree to submit to the personal jurisdiction of any federal or state court in Santa Clara County, California, in order to compel arbitration, to stay proceedings pending arbitration, or to confirm, modify, vacate or enter judgment on the award entered by the arbitrator; and in connection with any such proceeding, further agree to accept service of process by U.S.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitration will be administered by NAM and resolved before a single arbitrator.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If NAM is not available to arbitrate, the parties will select an alternative arbitration provider, but in no event shall any arbitration be administered by the American Arbitration Association.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Except as modified by this \"Dispute Resolution\" provision, NAM will administer the arbitration in accordance with the NAM Comprehensive Dispute Resolution Rules and Procedures, Fees For Disputes When One of the Parties is a Consumer and the Mass Filing Dispute Resolution Rules and Procedures in effect at the time any demand for arbitration is filed with NAM, excluding any rules or procedures governing or permitting class or representative actions.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "You are responsible for your own attorneys’ fees unless the arbitration rules and/or applicable law provide otherwise.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The parties agree that NAM has discretion to reduce the amount or modify the timing of any administrative or arbitration fees due under NAM’s Rules where it deems appropriate (including as specified in Section 11.5, provided that such modification does not increase the costs to you, and you further agree that you waive any objection to such fee modification.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The parties also agree that a good-faith challenge by either party to the fees imposed by NAM does not constitute a default, waiver, or breach of this Section 11.4 while such challenge remains pending before NAM, the arbitrator, and/or a court of competent jurisdiction, and that any and all due dates for those fees shall be tolled during the pendency of such challenge.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Any arbitration demand or counterclaim asserted by either party must contain sufficient information to provide fair notice to the other party of the asserting party’s identity, the claims being asserted, and the factual allegations on which they are based.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitrator and/or NAM may require amendment of any demand or counterclaim that does not satisfy these requirements.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitrator has the right to impose sanctions for any claims the arbitrator determines to be frivolous or improper (under the standard set forth in Federal Rule of Civil Procedure 11).", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If the amount in controversy does not exceed $10,000 and you do not seek injunctive or declaratory relief, then the arbitration will be conducted solely on the basis of documents you and Quora submit to the arbitrator, unless the arbitrator determines that a hearing is necessary.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If the amount in controversy exceeds $10,000 or seeks declaratory or injunctive relief, either party may request (or the arbitrator may determine) to hold a hearing, which shall be via videoconference or telephone conference unless the parties agree otherwise.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Subject to the applicable NAM rules and procedures, the parties agree that the arbitrator will have the discretion to allow the filing of dispositive motions if they are likely to efficiently resolve or narrow issues in dispute.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Unless otherwise prohibited by law, all arbitration proceedings will be confidential and closed to the public and any parties other than you and Quora (and each of the parties’ authorized representatives and agents), and all records relating thereto will be permanently sealed, except as necessary to obtain court confirmation of the arbitration award (provided that the party seeking confirmation shall seek to file such records under seal to the extent permitted by law).", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Arbitrator selection for each batch shall be conducted to the greatest extent possible in accordance with the applicable NAM rules and procedures for such selection, and the arbitrator will determine the location where the proceedings will be conducted.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "You agree to cooperate in good faith with Quora and the arbitration provider to implement such a “batch approach” or other similar approach to provide for an efficient resolution of claims, including the payment of combined reduced fees, set by NAM in its discretion, for each batch of claims.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The parties further agree to cooperate with each other and the arbitration provider or arbitrator to establish any other processes or procedures that the arbitration provider or arbitrator believe will provide for an efficient resolution of claims.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Any disagreement between the parties as to whether this provision applies or as to the process or procedure for batching shall be resolved by a Procedural Arbitrator appointed by NAM, as defined by NAM’s Supplemental Rules.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "This \"Batch Arbitration\" provision shall in no way be interpreted as increasing the number of claims necessary to trigger the applicability of NAM’s Mass Filing Supplemental Dispute Resolution Rules and Procedures or authorizing class arbitration of any kind.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Unless Quora otherwise consents in writing, Quora does not agree or consent to class arbitration, private attorney general arbitration, or arbitration involving joint or consolidated claims under any circumstances, except as set forth in section 11.6 and this section 11.5.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If your demand for arbitration is included in the Mass Filing, your claims will remain tolled until your demand for arbitration is decided, withdrawn, or is settled.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitrator will render an award within the time frame specified in the applicable NAM rules and procedures.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitrator's decision will include the essential findings and conclusions upon which the arbitrator based the award.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Judgment on the arbitration award may be entered in any court having jurisdiction thereof.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The arbitrator will have the authority to award monetary damages on an individual basis and to grant, on an individual basis, any non-monetary remedy or relief available to an individual to the extent available under applicable law, the arbitral forum's rules, and this Arbitration Agreement.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The parties agree that the damages and/or other relief must be consistent with Section 11.6 and also must be consistent with the terms of the \"Limitation of Liability\" section of the Agreement as to the types and the amounts of damages or other relief for which a party may be held liable.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "No arbitration award or decision will have any preclusive effect as to issues or claims in any dispute with anyone who is not a named party to the arbitration.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Attorneys' fees will be available to the prevailing party in the arbitration only if authorized under applicable substantive law governing the claims in the arbitration.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "11.6 Class Action and Class Arbitration Waiver.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "11.6 Class Action and Class Arbitration Waiver.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "YOU AND QUORA ACKNOWLEDGE AND AGREE THAT, TO THE MAXIMUM EXTENT ALLOWED BY LAW, ANY ARBITRATION SHALL BE CONDUCTED IN AN INDIVIDUAL CAPACITY ONLY AND NOT AS A CLASS OR ANY OTHER TYPE OF CONSOLIDATED ACTION AND THE ARBITRATOR MAY AWARD RELIEF ONLY IN FAVOR OF THE INDIVIDUAL PARTY SEEKING RELIEF AND ONLY TO THE EXTENT NECESSARY TO RESOLVE AN INDIVIDUAL PARTY’S CLAIM, UNLESS QUORA PROVIDES ITS CONSENT TO CONSOLIDATE IN WRITING.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If there is a final judicial determination that applicable law precludes enforcement of this Paragraph’s limitations as to a particular remedy, then that remedy (and only that remedy) must be severed from the arbitration and may be sought in court.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The parties agree, however, that any adjudication of remedies not subject to arbitration shall be stayed pending the outcome of any arbitrable claims and remedies.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If there is a final judicial determination that either the Class Arbitration Action and Collective Relief Waiver or the provisions in Section 11.4 are not enforceable as to a particular claim or request for relief, then the parties agree that that particular claim or request for relief may proceed in court but shall be severed and stayed pending arbitration of the remaining claims.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If there is a final judicial determination that either the Class Arbitration Action and Collective Relief Waiver or the provisions in Section 11.4 are not enforceable as to a particular claim or request for relief, then the parties agree that that particular claim or request for relief may proceed in court but shall be severed and stayed pending arbitration of the remaining claims.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "This provision does not prevent you or Quora from participating in a class-wide settlement of claims.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Notwithstanding the parties’ agreement to resolve all disputes through arbitration, either party may also elect to have disputes or claims resolved in a small claims court that are within the scope of that court’s jurisdiction regardless of what forum the filing party initially chose.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Seeking such relief shall not waive a party’s right to arbitration under this agreement, and any filed arbitrations related to any action filed pursuant to this paragraph shall automatically be stayed pending the outcome of such action.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Notwithstanding the parties’ agreement to resolve all disputes through arbitration, this binding arbitration section does not apply to disputes relating to either party’s intellectual property rights (trademark, copyright, patent, and trade secret) or violations of Quora’s Acceptable Use Policy.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "For further clarification, disputes relating to your privacy rights are not excepted from this binding arbitration section.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "You have the right to opt-out and not be bound by the arbitration and class action waiver provisions set forth in Sections 11.4-11.6 by sending written notice of your decision to opt-out by emailing us at arbitration.optout@quora.com .", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "You have the right to opt-out and not be bound by the arbitration and class action waiver provisions set forth in Sections 11.4-11.6 by sending written notice of your decision to opt-out by emailing us at arbitration.optout@quora.com .", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The notice must be sent within thirty (30) days of registering to use the Quora Platform, otherwise you will be bound to arbitrate disputes in accordance with the terms of those sections.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If you opt out of these arbitration provisions, we also will not be bound by them.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Quora will continue to honor any valid opt outs if you opted out of arbitration in a prior version of the Agreement pursuant to the requirements set forth in that version.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If you do not timely opt out of this Arbitration Agreement, such action shall constitute mutual acceptance of the terms of these “Dispute Resolution” provisions by you and Quora.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If you reject any such changes by opting out of the Arbitration Agreement, you may exercise your right to a trial by jury or judge, as permitted by applicable law, but any prior existing agreement to arbitrate disputes under a prior version of the Arbitration Agreement will not apply to claims not yet filed.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "If you are not a user in the European Economic Area, the United Kingdom, or Switzerland, to the extent that the arbitration provisions set forth in Section 11) do not apply, or if you have opted out of arbitration, the parties agree that any litigation between them must be filed exclusively in state or federal courts located in Santa Clara County, California (except for small claims court actions which may be brought in the county where you reside).", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "In the event of litigation relating to these Terms of Service, the parties agree to waive, to the maximum extent permitted by law, any right to a jury trial, except where a jury trial waiver is not permissible under applicable law.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "Except for the Dispute Resolution Section of these Terms (Section 11), we may amend these Terms (including any policies, such as the Privacy Policy , Acceptable Use Policy , Copyright Policy , and Trademark Policy that are incorporated into these Terms) at any time, in our sole discretion.", "label": "UNILATERAL_CHANGES", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The following provisions will survive expiration or termination of these Terms: 1.6 (Feedback), Section 3 (Your Content), Section 4.1-4.2 and 4.4-4.7(Our Content and Materials), Section 6 (Third-Party Links, Sites, and Services), Section 8 (Termination), Section 9 (Disclaimers and Limitation of Liability), Section 10 (Indemnification), Sections 11 (Legal Disputes and Arbitration Agreement), and Section 12 (General Terms).", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "The following provisions will survive expiration or termination of these Terms: 1.6 (Feedback), Section 3 (Your Content), Section 4.1-4.2 and 4.4-4.7(Our Content and Materials), Section 6 (Third-Party Links, Sites, and Services), Section 8 (Termination), Section 9 (Disclaimers and Limitation of Liability), Section 10 (Indemnification), Sections 11 (Legal Disputes and Arbitration Agreement), and Section 12 (General Terms).", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service - Quora.html"}
{"text": "PLEASE NOTE THAT THESE TERMS INCLUDE A BINDING ARBITRATION PROVISION , INCLUDING A CLASS ACTION WAIVER.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "PLEASE NOTE THAT THESE TERMS INCLUDE A BINDING ARBITRATION PROVISION , INCLUDING A CLASS ACTION WAIVER.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "BY AGREEING TO BINDING ARBITRATION, TO THE EXTENT PERMITTED UNDER APPLICABLE LAW, YOU WAIVE YOUR RIGHT TO LITIGATE DISPUTES THROUGH A COURT AND TO HAVE A JUDGE OR JURY DECIDE YOUR CASE.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Limitation of Liability and Damages 14.1.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Miscellaneous (Including Dispute Resolution and Arbitration) 15.1.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Dispute Resolution and Arbitration PLEASE READ THIS SECTION CAREFULLY BECAUSE IT AFFECTS YOUR RIGHTS.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "BY AGREEING TO BINDING ARBITRATION, YOU WAIVE YOUR RIGHT TO LITIGATE DISPUTES THROUGH A COURT AND TO HAVE A JUDGE OR JURY DECIDE YOUR CASE.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "After sixty (60) days, you or Khan Academy may commence arbitration.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Binding Arbitration .", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Class Action Waiver .", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Any proceedings to resolve or litigate any Dispute in any forum will be conducted solely on an individual basis.&nbsp; Neither you nor Khan Academy will seek to have any Dispute heard as a class action or in any other proceeding in which either party acts or proposes to act in a representative capacity.&nbsp; No arbitration or proceeding will be combined with another without the prior written consent of all parties to all affected arbitrations or proceedings.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Any proceedings to resolve or litigate any Dispute in any forum will be conducted solely on an individual basis.&nbsp; Neither you nor Khan Academy will seek to have any Dispute heard as a class action or in any other proceeding in which either party acts or proposes to act in a representative capacity.&nbsp; No arbitration or proceeding will be combined with another without the prior written consent of all parties to all affected arbitrations or proceedings.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "If there is a final judicial determination that any particular Dispute cannot be arbitrated in accordance with the limitations of this Section 15.4 (Dispute Resolution and Arbitration), then only that Dispute may be severed and brought in court.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "All other Disputes remain subject to this Section 15.4 (Dispute Resolution and Arbitration).", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Arbitration Procedures .", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Any arbitration will be conducted by JAMS under the JAMS Comprehensive Arbitration Rules and Procedures (“ JAMS Rules ”) in effect at the time the Dispute is filed.&nbsp; You may request a telephonic or in-person hearing by following the JAMS Rules.&nbsp; In a dispute involving $10,000 or less, any hearing will be telephonic unless the arbitrator finds good cause to hold an in-person hearing instead.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "To the extent the forum provided by JAMS is unavailable, Khan Academy and you agree to select a mutually agreeable alternative dispute resolution service and that such alternative dispute resolution service shall apply the JAMS Rules.&nbsp; The arbitrator may award the same damages to you individually as a court could.&nbsp; The arbitrator may award declaratory or injunctive relief to you only individually, and only to the extent required to satisfy your individual claim.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Arbitration Fees .", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Whoever files the arbitration will pay the initial filing fee.&nbsp; If Khan Academy files, then Khan Academy will pay; if you file, then you will pay unless you get a fee waiver under the applicable arbitration rules.&nbsp; Each party will bear the expense of that party’s attorneys, experts, and witnesses, and other expenses, regardless of which party prevails, but a party may recover any or all expenses from another party if the arbitrator, applying applicable law, so determines.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Filing Period .&nbsp; To the extent permitted by law, any Dispute under these Terms must be filed within one (1) year in an arbitration proceeding.&nbsp; The one-year period begins when the events giving rise to the Dispute first occur.&nbsp; If a Dispute is not filed within one year, it is permanently barred.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "In the event that any Dispute cannot be resolved by binding arbitration in accordance with this Section 15.4 (Dispute Resolution and Arbitration), you agree that such Dispute will be filed only in the state or federal courts in and for Santa Clara County, California, and each of you and Khan Academy hereby consent and submit to the personal and exclusive jurisdiction of such courts for the purpose of litigating any such action.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "Survival Upon termination of the Terms, any provision which, by its nature or express terms should survive, will survive such termination or expiration, including, but not limited to, Sections 2 ( Privacy Policy ), 4 ( Modification of the Terms ) through 6 ( Digital Millennium Copyright Act ), 7.1 ( Proprietary Materials ), 7.4 ( Non-Commercial Use ), 7.5 ( Crediting Khan Academy ), and 8 ( Prohibited Conduct ) through 15 ( Miscellaneous (Including Dispute Resolution and Arbitration )).", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Khan Academy.html"}
{"text": "This limitation of liability won't apply to any statutory liability that cannot be limited, to liability for death or personal injury caused by our negligence or willful misconduct, or to exclude our responsibility for something we have specifically promised to you.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "We're not liable for various losses or damages.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Arbitration If you are a consumer in the EEA or United Kingdom (UK), Section 11 doesn't apply to you.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "To the extent permitted by law, neither party may initiate any legal proceeding—whether in court, arbitration, or any other forum—until the Notice of Dispute and Informal Dispute Resolution processes described below are completed.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Nothing in this Section, however, will prevent either you or us from seeking temporary injunctive relief in court (or in arbitration) to preserve the status quo or to help enforce this arbitration clause at the outset of any dispute.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "After the 60-day period has elapsed, either party may initiate arbitration.&nbsp; Arbitration : If we haven’t been able to resolve the dispute through the mandatory processes above, you and we each agree to resolve any claim, dispute, or controversy arising out of or relating to these Terms or the Service through binding arbitration or, for qualifying claims, in small claims court.&nbsp; Arbitration is a more informal way to resolve our disagreements than a lawsuit in court.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Federal Arbitration Act governs the interpretation and enforcement of this Section, and that you and Pinterest are each waiving the right to a trial by jury or to participate in a class action.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Federal Arbitration Act governs the interpretation and enforcement of this Section, and that you and Pinterest are each waiving the right to a trial by jury or to participate in a class action.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "The arbitrator also has exclusive authority to resolve any dispute relating to the interpretation, applicability, or enforceability of this binding arbitration agreement.&nbsp; Any arbitration will be administered by the American Arbitration Association (\"AAA\") under the applicable rules then in effect for the AAA.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "If the AAA rules conflict in any way with these Terms, the Terms will govern.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "You can find AAA’s forms at www.adr.org www.adr.org .", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "The arbitrator shall issue a reasoned written decision explaining the essential findings and conclusions on which the award is based.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "A judgment on the arbitrator’s award may be entered in any court of competent jurisdiction.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Where the AAA’s Consumer Arbitration Rules apply, if the arbitrator determines that a party’s claim was frivolous or brought for an improper purpose, the arbitrator must assign all fees and costs associated with the arbitration to that party.&nbsp; All disputes must be brought in the party's individual capacity, and not as a member in any class or representative proceeding.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "You agree that, by entering into these Terms, you are waiving the right to a trial by jury or to participate in a class action.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Batched Arbitration : To provide a more efficient arbitration process, you and we each agree that if 50 or more similar arbitration demands are filed within a 60-day period or with the assistance of the same law firm or group of law firms, AAA will consolidate the arbitration demands.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "For each batch, AAA will administer one set of filing and administrative fees per side, per batch, and AAA will appoint one arbitrator to resolve each batch as a single consolidated arbitration.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Arbitration demands are similar if they arise from similar facts and raise similar legal issues while seeking similar relief.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Any dispute about similarity will be submitted to a single arbitrator, whose fees will be paid by us.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "If that doesn’t work, the dispute will be efficiently decided through arbitration, not in court.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "For any actions not subject to Section 11 (Arbitration), the exclusive place of jurisdiction for any claim, dispute, or controversy arising from or in connection with these Terms or the Service is San Francisco County, California, or the United States District Court for the Northern District of California, and such disputes will be determined under California law.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Limitation of Liability 10.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Limitation of Liability 11.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Arbitration 11.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Arbitration 12.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Terms of Service _ Pinterest Policy.html"}
{"text": "Disclaimers and Limitation of Liability Nothing in these Terms will prejudice the statutory rights that you may have as a user of the Services.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/User Agreement - February 15, 2024 - Reddit.html"}
{"text": "Some countries, states, provinces or other jurisdictions do not allow the exclusion of certain warranties or the limitation of liability as stated in this section, so the below terms may not fully apply to you.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/User Agreement - February 15, 2024 - Reddit.html"}
{"text": "The following sections will survive any termination of these Terms or of your Account: 5 (Your Content), 7 (Things You Cannot Do), 12 (Indemnity), 13 (Disclaimers and Limitation of Liability), 14 (Governing Law and Venue), 17 (Termination), and 18 (Miscellaneous).", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/User Agreement - February 15, 2024 - Reddit.html"}
{"text": "Limitation of Liability By using the Services you agree that the Reddit Entities’ liability is limited to the maximum extent permissible in your country of residence.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/User Agreement - February 15, 2024 - Reddit.html"}
{"text": "This limitation of liability will not apply to any statutory liability that cannot be limited, to liability for death or personal injury caused by our negligence or willful misconduct, or if and to exclude our responsibility for something we have specifically promised to you.", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/User Agreement - February 15, 2024 - Reddit.html"}
{"text": "The following sections will survive any termination of these Terms or of your Account: 5 (Your Content), 7 (Things You Cannot Do), 12 (Indemnity), 13 (Limitation of Liability), 16 (Termination), and 17 (Miscellaneous).", "label": "LIABILITY_LIMITATION", "source": "test-pages/curated-tos/User Agreement - February 15, 2024 - Reddit.html"}
{"text": "You agree to comply with the final decisions of dispute resolution bodies that are established by the community for the specific Project editions (such as arbitration committees); these decisions may include sanctions as set out by the policy of the specific Project edition.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Wikimedia Foundation Terms of Use - Wikimedia Foundation Governance Wiki.html"}
{"text": "The parties will split all fees and expenses related to the mediation/arbitration equally.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Wikimedia Foundation Terms of Use - Wikimedia Foundation Governance Wiki.html"}
{"text": "Marketing Company Mediations are subject to and governed by the Federal Arbitration Act to the extent that the mediator becomes an arbitrator.", "label": "ARBITRATION", "source": "test-pages/curated-tos/Wikimedia Foundation Terms of Use - Wikimedia Foundation Governance Wiki.html"}
