{"text": "Please review Section 25 of this Agreement carefully, as it contains an arbitration provision and class action waiver which requires User to resolve disputes with Provider through final, binding arbitration on an individual basis.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/KTBSOnline User Agreement.txt"}
{"text": "By entering into this Agreement, User is acknowledging that User has read and that User understands the terms of this Agreement and that User agrees to be bound by the arbitration provision and class action waiver.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/KTBSOnline User Agreement.txt"}
{"text": "USER FURTHER ACKNOWLEDGES, UNDERSTANDS, AND AGREES THAT USER AND PROVIDER ARE EACH WAIVING THEIR RESPECTIVE RIGHTS TO A TRIAL BY JURY AS TO DISPUTES HEREUNDER AND THAT USER IS WAIVING ITS RIGHT TO PARTICIPATE IN ANY CLASS ACTION PROCEEDING ARISING FROM THIS AGREEMENT.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/KTBSOnline User Agreement.txt"}
{"text": "IMPORTANT ARBITRATION NOTICE: IF YOU ARE IN THE UNITED STATES OR CANADA, YOU AGREE THAT DISPUTES BETWEEN YOU AND QUORA WILL BE RESOLVED BY BINDING, INDIVIDUAL ARBITRATION AND YOU WAIVE YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION LAWSUIT OR CLASS-WIDE ARBITRATION.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/Terms of Service - Quora.html"}
{"text": "You have the right to opt-out and not be bound by the arbitration and class action waiver provisions set forth in Sections 11.4-11.6 by sending written notice of your decision to opt-out by emailing us at    arbitration.optout@quora.com           .", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/Terms of Service - Quora.html"}
{"text": "PLEASE NOTE THAT THESE TERMS INCLUDE A BINDING  ARBITRATION PROVISION , INCLUDING A CLASS ACTION WAIVER.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/Terms of Service _ Khan Academy.html"}
{"text": "Class Action Waiver .", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/Terms of Service _ Khan Academy.html"}
{"text": "Federal Arbitration Act governs the interpretation and enforcement of this Section, and that you and Pinterest are each waiving the right to a trial by jury or to participate in a class action.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/Terms of Service _ Pinterest Policy.html"}
{"text": "You agree that, by entering into these Terms, you are waiving the right to a trial by jury or to participate in a class action.", "label": "CLASS_ACTION_WAIVER", "source": "test-pages/all-mocks/test-pages/Website Terms of Service/Terms of Service _ Pinterest Policy.html"}
