{"text": "To request that we remove or de-identify your Personal Information from our blog or Forums, contact us at privacy@23andme.com.\n\nQuestion: do you use my date to modify the app", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "Account deletion If you no longer wish to participate in our Services, or no longer wish to have your Personal Information be processed, you may delete your 23andMe account and Personal Information within your Account Settings.\n\nQuestion: how long do you store my medical information for?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "When using our products and services, you can always manage, review and update information in your account, for instance, you can manage your personal information at any time, such as your Keep ID and photo.\n\nQuestion: what information is shared when i share something with friends?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "The PeopleFun username will be public and will be shown to other users, but will only permit access to information that is considered public or that you have designated as public in your user profile settings.\n\nQuestion: are there any reports of malware that have affected users of this app?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You can download your raw Genetic Information within your Account Settings or by going to the applicable tool in Tools. If you would like to access or rectify any other information, contact Customer Care and we will do our best to assist you without undue delay.\n\nQuestion: is my information shared with any third parties?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Our site allows you to access and rectify certain Registration Information within your Account Settings, and your Self-Reported Information by going to the surveys page.\n\nQuestion: is it possible for health insurance companies to get ahold of my data?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Business transactions In the event that 23andMe goes through a business transition such as a merger, acquisition by another company, or sale of all or a portion of its assets your Personal Information will likely be among the assets transferred.\n\nQuestion: will anyone have digital access to my test results?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "If you have completed the Individual Level Data Sharing Consent, or additional consent agreement, in addition to the uses above under the Main Consent Document, 23andMe may share De-identified Individual-level Genetic Information and Self-Reported Information with select third party research collaborators for 23andMe partners for Research purposes.\n\nQuestion: does it store my dna information for long periods of time?", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "You can access and download data processed by 23andMe within your Account Settings and within applicable Reports, Tools, and features.\n\nQuestion: does 23andme use my test results for marketing purposes?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You can request erasure of Personal Information that: (a) is no longer necessary in relation to the purposes for which it was collected or otherwise processed; (b) was collected in relation to processing to which you previously consented, but later withdrew such consent; or (c) was collected in relation to processing activities to which you object, and there are no overriding legitimate grounds for our processing.\n\nQuestion: how long do you store my medical information for?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "These include the following rights to: access your personal information, rectify the information we hold about you, erase your personal information, restrict our use of your personal information, object to our use of your personal information, receive your personal information in a usable electronic format and transmit it to a third party (right to data portability), lodge a complaint with your local data protection authority.\n\nQuestion: what control do i have as a user to limit the access to my account?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Should you ever deactivate your account with us, we will keep your information for a limited period in order to meet the above purposes.\n\nQuestion: how is information used?", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "As a registered member, you can review and change personal information at any time by accessing your account on the App or contacting our support.\n\nQuestion: if it's free, does viber profit off its users in some way?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "access your user data Correct the data you have provided to us Have information provided to you in a portable format Request the deletion of the data we have collected Restrict processing Object to processing or the legal basis on which we rely to process your data\n\nQuestion: when i installation time any personal details ask in this app?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "In addition, you may also permit Keep to access other content and data on your device for example, your contact list and photo storage.\n\nQuestion: who can see my data?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "However, in some circumstances we may retain your personal information for longer periods of time.\n\nQuestion: is there any way for a freelancer to contact a customer outside of fiverr?", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "This information includes photos you upload, your published portfolio, Gig information, ratings, and additional information you may choose to add to your profile.\n\nQuestion: what type of identifiable information is passed between users on the platform", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You may access, correct or update most of your Registration Information on your own within your Account Settings.\n\nQuestion: does the app require any special permissions for access on my phone?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "We will help you export the information based on applicable law and your specific request.\n\nQuestion: do you keep and upload my activity to your database", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "If you reside in Canada, you may have the right to be provided with access to Personal Information that we have collected about you and written information about our policies and practices with respect to the transfer of your personal information to Vendors outside Canada.\n\nQuestion: what happen if my account get compromise?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "If we process your Personal Information based on a contract with you or based on your consent, or the processing is carried out by automated means, you may request to receive your Personal Information in a structured, commonly used and machine-readable format, and to have us transfer your Personal Information directly to another controller, where technically feasible, unless exercise of this right adversely affects the rights and freedoms of others.\n\nQuestion: do you use my data to do medical research", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You can review and change your personal information by logging into the Site and visiting your account profile page.\n\nQuestion: how does fiverr ensure payments from customers are secure?", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Additionally, as permitted by applicable laws, we may need to retain certain personal information for a limited period of time for record-keeping, accounting and fraud prevention purposes.\n\nQuestion: what are the permissions?", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "In the event that PeopleFun undergoes a business transition, such as a merger, acquisition by another company, change of control, or sale of all or a portion of its assets, we may transfer all of your information, including personal information, to the successor organization in such transition.\n\nQuestion: is my information sold", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "to obtain a portable copy of your personal information, or to have a copy transferred to a third party controller; or\n\nQuestion: has people's information been compromised recently", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Lima Sky retains the data collected pursuant to this Privacy Policy for the period necessary to fulfill the purposes outlined in this Privacy Policy unless a longer retention period is required or permitted by law.\n\nQuestion: does it save anything locally?", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
