{"text": "You retain ownership of the videos you upload. By submitting it, you grant the Platform a limited, worldwide, royalty-free license to host and display it to your selected audience. We will never sell your content outright or claim exclusive ownership.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the videos you upload", "company": "the Platform", "license": "limited, worldwide, royalty-free", "usage": "host and display it to your selected audience"}}
{"text": "You retain ownership of any original artwork you publish. By submitting it, you grant Nimbus Labs a non-exclusive, revocable license to process it for content moderation and analytics. You can revoke the license at any time by removing the item from the platform.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "any original artwork you publish", "company": "Nimbus Labs", "license": "non-exclusive, revocable", "usage": "process it for content moderation and analytics"}}
{"text": "You retain ownership of your podcast recordings. By submitting it, you grant Atlas Studio a non-exclusive, perpetual license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your podcast recordings", "company": "Atlas Studio", "license": "non-exclusive, perpetual", "usage": "feature it in personalized recommendations"}}
{"text": "You retain ownership of the code snippets you share. By submitting it, you grant Orbital Apps a transferable, sublicensable license to deliver it through our API integrations. We do not require you to waive any moral rights where local law recognizes them.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the code snippets you share", "company": "Orbital Apps", "license": "transferable, sublicensable", "usage": "deliver it through our API integrations"}}
{"text": "You retain ownership of your live stream content. By submitting it, you grant Canvas Collective a limited, non-transferable license to produce platform-wide marketing previews. You may export a complete copy of your content before closing your account.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your live stream content", "company": "Canvas Collective", "license": "limited, non-transferable", "usage": "produce platform-wide marketing previews"}}
{"text": "You retain ownership of the blog posts you draft. By submitting it, you grant Signal Stack a non-exclusive, sublicensable license to generate automated captions and translations. We obtain no ownership in derivative works you build outside the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the blog posts you draft", "company": "Signal Stack", "license": "non-exclusive, sublicensable", "usage": "generate automated captions and translations"}}
{"text": "You retain ownership of all product descriptions you create. By submitting it, you grant Harbor Cloud a limited, revocable license to test security and reliability of our services. You control whether your content is discoverable by third-party search engines.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "all product descriptions you create", "company": "Harbor Cloud", "license": "limited, revocable", "usage": "test security and reliability of our services"}}
{"text": "You retain ownership of your custom avatar designs. By submitting it, you grant Vector Foundry a limited, worldwide, royalty-free license to back up the service and prevent data loss. We will request additional consent before using your content in paid advertising.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your custom avatar designs", "company": "Vector Foundry", "license": "limited, worldwide, royalty-free", "usage": "back up the service and prevent data loss"}}
{"text": "You retain ownership of the photographs you submit. By submitting it, you grant Beacon Media a non-exclusive, revocable license to provide accessibility adjustments. Any sublicenses we grant are solely for operating and improving the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the photographs you submit", "company": "Beacon Media", "license": "non-exclusive, revocable", "usage": "provide accessibility adjustments"}}
{"text": "You retain ownership of any music tracks you distribute. By submitting it, you grant Launchpad Networks a non-exclusive, perpetual license to run community safety investigations. We will notify you of material license changes at least 30 days in advance.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "any music tracks you distribute", "company": "Launchpad Networks", "license": "non-exclusive, perpetual", "usage": "run community safety investigations"}}
{"text": "You retain ownership of your tutorial documents. By submitting it, you grant the Platform a transferable, sublicensable license to host and display it to your selected audience. We will never sell your content outright or claim exclusive ownership.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your tutorial documents", "company": "the Platform", "license": "transferable, sublicensable", "usage": "host and display it to your selected audience"}}
{"text": "You retain ownership of the design files you store. By submitting it, you grant Nimbus Labs a limited, non-transferable license to process it for content moderation and analytics. You can revoke the license at any time by removing the item from the platform.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the design files you store", "company": "Nimbus Labs", "license": "limited, non-transferable", "usage": "process it for content moderation and analytics"}}
{"text": "You retain ownership of your presentation decks. By submitting it, you grant Atlas Studio a non-exclusive, sublicensable license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your presentation decks", "company": "Atlas Studio", "license": "non-exclusive, sublicensable", "usage": "feature it in personalized recommendations"}}
{"text": "You retain ownership of the marketing copy you compose. By submitting it, you grant Orbital Apps a limited, revocable license to deliver it through our API integrations. We do not require you to waive any moral rights where local law recognizes them.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the marketing copy you compose", "company": "Orbital Apps", "license": "limited, revocable", "usage": "deliver it through our API integrations"}}
{"text": "You retain ownership of your 3D models. By submitting it, you grant Canvas Collective a limited, worldwide, royalty-free license to produce platform-wide marketing previews. You may export a complete copy of your content before closing your account.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your 3D models", "company": "Canvas Collective", "license": "limited, worldwide, royalty-free", "usage": "produce platform-wide marketing previews"}}
{"text": "You retain ownership of the interactive experiences you build. By submitting it, you grant Signal Stack a non-exclusive, revocable license to generate automated captions and translations. We obtain no ownership in derivative works you build outside the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the interactive experiences you build", "company": "Signal Stack", "license": "non-exclusive, revocable", "usage": "generate automated captions and translations"}}
{"text": "You retain ownership of your research summaries. By submitting it, you grant Harbor Cloud a non-exclusive, perpetual license to test security and reliability of our services. You control whether your content is discoverable by third-party search engines.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your research summaries", "company": "Harbor Cloud", "license": "non-exclusive, perpetual", "usage": "test security and reliability of our services"}}
{"text": "You retain ownership of the recipes you contribute. By submitting it, you grant Vector Foundry a transferable, sublicensable license to back up the service and prevent data loss. We will request additional consent before using your content in paid advertising.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the recipes you contribute", "company": "Vector Foundry", "license": "transferable, sublicensable", "usage": "back up the service and prevent data loss"}}
{"text": "You retain ownership of your fashion lookbooks. By submitting it, you grant Beacon Media a limited, non-transferable license to provide accessibility adjustments. Any sublicenses we grant are solely for operating and improving the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your fashion lookbooks", "company": "Beacon Media", "license": "limited, non-transferable", "usage": "provide accessibility adjustments"}}
{"text": "You retain ownership of the datasets you upload. By submitting it, you grant Launchpad Networks a non-exclusive, sublicensable license to run community safety investigations. We will notify you of material license changes at least 30 days in advance.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the datasets you upload", "company": "Launchpad Networks", "license": "non-exclusive, sublicensable", "usage": "run community safety investigations"}}
{"text": "You retain ownership of your virtual event recordings. By submitting it, you grant the Platform a limited, revocable license to host and display it to your selected audience. We will never sell your content outright or claim exclusive ownership.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your virtual event recordings", "company": "the Platform", "license": "limited, revocable", "usage": "host and display it to your selected audience"}}
{"text": "You retain ownership of the comments you author. By submitting it, you grant Nimbus Labs a limited, worldwide, royalty-free license to process it for content moderation and analytics. You can revoke the license at any time by removing the item from the platform.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the comments you author", "company": "Nimbus Labs", "license": "limited, worldwide, royalty-free", "usage": "process it for content moderation and analytics"}}
{"text": "You retain ownership of your community posts. By submitting it, you grant Atlas Studio a non-exclusive, revocable license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your community posts", "company": "Atlas Studio", "license": "non-exclusive, revocable", "usage": "feature it in personalized recommendations"}}
{"text": "You retain ownership of the feedback you leave. By submitting it, you grant Orbital Apps a non-exclusive, perpetual license to deliver it through our API integrations. We do not require you to waive any moral rights where local law recognizes them.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the feedback you leave", "company": "Orbital Apps", "license": "non-exclusive, perpetual", "usage": "deliver it through our API integrations"}}
{"text": "You retain ownership of your brand assets. By submitting it, you grant Canvas Collective a transferable, sublicensable license to produce platform-wide marketing previews. You may export a complete copy of your content before closing your account.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your brand assets", "company": "Canvas Collective", "license": "transferable, sublicensable", "usage": "produce platform-wide marketing previews"}}
{"text": "You retain ownership of the lesson plans you publish. By submitting it, you grant Signal Stack a limited, non-transferable license to generate automated captions and translations. We obtain no ownership in derivative works you build outside the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the lesson plans you publish", "company": "Signal Stack", "license": "limited, non-transferable", "usage": "generate automated captions and translations"}}
{"text": "You retain ownership of your training modules. By submitting it, you grant Harbor Cloud a non-exclusive, sublicensable license to test security and reliability of our services. You control whether your content is discoverable by third-party search engines.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your training modules", "company": "Harbor Cloud", "license": "non-exclusive, sublicensable", "usage": "test security and reliability of our services"}}
{"text": "You retain ownership of the case studies you submit. By submitting it, you grant Vector Foundry a limited, revocable license to back up the service and prevent data loss. We will request additional consent before using your content in paid advertising.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the case studies you submit", "company": "Vector Foundry", "license": "limited, revocable", "usage": "back up the service and prevent data loss"}}
{"text": "You retain ownership of your product roadmaps. By submitting it, you grant Beacon Media a limited, worldwide, royalty-free license to provide accessibility adjustments. Any sublicenses we grant are solely for operating and improving the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your product roadmaps", "company": "Beacon Media", "license": "limited, worldwide, royalty-free", "usage": "provide accessibility adjustments"}}
{"text": "You retain ownership of the VR environments you render. By submitting it, you grant Launchpad Networks a non-exclusive, revocable license to run community safety investigations. We will notify you of material license changes at least 30 days in advance.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the VR environments you render", "company": "Launchpad Networks", "license": "non-exclusive, revocable", "usage": "run community safety investigations"}}
{"text": "You retain ownership of your AR filters. By submitting it, you grant the Platform a non-exclusive, perpetual license to host and display it to your selected audience. We will never sell your content outright or claim exclusive ownership.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your AR filters", "company": "the Platform", "license": "non-exclusive, perpetual", "usage": "host and display it to your selected audience"}}
{"text": "You retain ownership of the newsletters you schedule. By submitting it, you grant Nimbus Labs a transferable, sublicensable license to process it for content moderation and analytics. You can revoke the license at any time by removing the item from the platform.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the newsletters you schedule", "company": "Nimbus Labs", "license": "transferable, sublicensable", "usage": "process it for content moderation and analytics"}}
{"text": "You retain ownership of your animation reels. By submitting it, you grant Atlas Studio a limited, non-transferable license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your animation reels", "company": "Atlas Studio", "license": "limited, non-transferable", "usage": "feature it in personalized recommendations"}}
{"text": "You retain ownership of the infographics you design. By submitting it, you grant Orbital Apps a non-exclusive, sublicensable license to deliver it through our API integrations. We do not require you to waive any moral rights where local law recognizes them.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the infographics you design", "company": "Orbital Apps", "license": "non-exclusive, sublicensable", "usage": "deliver it through our API integrations"}}
{"text": "You retain ownership of your open-source libraries. By submitting it, you grant Canvas Collective a limited, revocable license to produce platform-wide marketing previews. You may export a complete copy of your content before closing your account.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your open-source libraries", "company": "Canvas Collective", "license": "limited, revocable", "usage": "produce platform-wide marketing previews"}}
{"text": "You retain ownership of the knowledge base articles you write. By submitting it, you grant Signal Stack a limited, worldwide, royalty-free license to generate automated captions and translations. We obtain no ownership in derivative works you build outside the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the knowledge base articles you write", "company": "Signal Stack", "license": "limited, worldwide, royalty-free", "usage": "generate automated captions and translations"}}
{"text": "You retain ownership of your campaign storyboards. By submitting it, you grant Harbor Cloud a non-exclusive, revocable license to test security and reliability of our services. You control whether your content is discoverable by third-party search engines.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your campaign storyboards", "company": "Harbor Cloud", "license": "non-exclusive, revocable", "usage": "test security and reliability of our services"}}
{"text": "You retain ownership of the templates you provide. By submitting it, you grant Vector Foundry a non-exclusive, perpetual license to back up the service and prevent data loss. We will request additional consent before using your content in paid advertising.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the templates you provide", "company": "Vector Foundry", "license": "non-exclusive, perpetual", "usage": "back up the service and prevent data loss"}}
{"text": "You retain ownership of your prototype files. By submitting it, you grant Beacon Media a transferable, sublicensable license to provide accessibility adjustments. Any sublicenses we grant are solely for operating and improving the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your prototype files", "company": "Beacon Media", "license": "transferable, sublicensable", "usage": "provide accessibility adjustments"}}
{"text": "You retain ownership of the community guides you draft. By submitting it, you grant Launchpad Networks a limited, non-transferable license to run community safety investigations. We will notify you of material license changes at least 30 days in advance.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the community guides you draft", "company": "Launchpad Networks", "license": "limited, non-transferable", "usage": "run community safety investigations"}}
{"text": "You retain ownership of your terms of sale language. By submitting it, you grant the Platform a non-exclusive, sublicensable license to host and display it to your selected audience. We will never sell your content outright or claim exclusive ownership.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your terms of sale language", "company": "the Platform", "license": "non-exclusive, sublicensable", "usage": "host and display it to your selected audience"}}
{"text": "You retain ownership of the slogans you ideate. By submitting it, you grant Nimbus Labs a limited, revocable license to process it for content moderation and analytics. You can revoke the license at any time by removing the item from the platform.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the slogans you ideate", "company": "Nimbus Labs", "license": "limited, revocable", "usage": "process it for content moderation and analytics"}}
{"text": "You retain ownership of your character bios. By submitting it, you grant Atlas Studio a limited, worldwide, royalty-free license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your character bios", "company": "Atlas Studio", "license": "limited, worldwide, royalty-free", "usage": "feature it in personalized recommendations"}}
{"text": "You retain ownership of the onboarding scripts you craft. By submitting it, you grant Orbital Apps a non-exclusive, revocable license to deliver it through our API integrations. We do not require you to waive any moral rights where local law recognizes them.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the onboarding scripts you craft", "company": "Orbital Apps", "license": "non-exclusive, revocable", "usage": "deliver it through our API integrations"}}
{"text": "You retain ownership of your policy updates. By submitting it, you grant Canvas Collective a non-exclusive, perpetual license to produce platform-wide marketing previews. You may export a complete copy of your content before closing your account.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your policy updates", "company": "Canvas Collective", "license": "non-exclusive, perpetual", "usage": "produce platform-wide marketing previews"}}
{"text": "You retain ownership of the beta feedback you report. By submitting it, you grant Signal Stack a transferable, sublicensable license to generate automated captions and translations. We obtain no ownership in derivative works you build outside the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the beta feedback you report", "company": "Signal Stack", "license": "transferable, sublicensable", "usage": "generate automated captions and translations"}}
{"text": "You retain ownership of your sustainability disclosures. By submitting it, you grant Harbor Cloud a limited, non-transferable license to test security and reliability of our services. You control whether your content is discoverable by third-party search engines.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your sustainability disclosures", "company": "Harbor Cloud", "license": "limited, non-transferable", "usage": "test security and reliability of our services"}}
{"text": "You retain ownership of the compliance checklists you complete. By submitting it, you grant Vector Foundry a non-exclusive, sublicensable license to back up the service and prevent data loss. We will request additional consent before using your content in paid advertising.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the compliance checklists you complete", "company": "Vector Foundry", "license": "non-exclusive, sublicensable", "usage": "back up the service and prevent data loss"}}
{"text": "You retain ownership of your accessibility statements. By submitting it, you grant Beacon Media a limited, revocable license to provide accessibility adjustments. Any sublicenses we grant are solely for operating and improving the service.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your accessibility statements", "company": "Beacon Media", "license": "limited, revocable", "usage": "provide accessibility adjustments"}}
{"text": "You retain ownership of the incident retros you file. By submitting it, you grant Launchpad Networks a limited, worldwide, royalty-free license to run community safety investigations. We will notify you of material license changes at least 30 days in advance.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the incident retros you file", "company": "Launchpad Networks", "license": "limited, worldwide, royalty-free", "usage": "run community safety investigations"}}
{"text": "You retain ownership of your localization glossaries. By submitting it, you grant the Platform a non-exclusive, revocable license to host and display it to your selected audience. We will never sell your content outright or claim exclusive ownership.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your localization glossaries", "company": "the Platform", "license": "non-exclusive, revocable", "usage": "host and display it to your selected audience"}}
{"text": "You retain ownership of the testimonials you record. By submitting it, you grant Nimbus Labs a non-exclusive, perpetual license to process it for content moderation and analytics. You can revoke the license at any time by removing the item from the platform.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "the testimonials you record", "company": "Nimbus Labs", "license": "non-exclusive, perpetual", "usage": "process it for content moderation and analytics"}}
{"text": "You retain ownership of your brand style guides. By submitting it, you grant Atlas Studio a transferable, sublicensable license to feature it in personalized recommendations. This license ends automatically when you delete the content unless legal retention rules apply.", "label": "IP_RETAINED", "meta": {"source": "synthetic:v2025.10.07a", "asset": "your brand style guides", "company": "Atlas Studio", "license": "transferable, sublicensable", "usage": "feature it in personalized recommendations"}}
