{"text": "I have been living in my unit for about a year and a half. Our current lease is up at the end of August. Our first year was fairly uneventful, although the apartment is not in great condition. When we have needed repairs, the landlord does the absolute bare minimum to satisfy the request. We rent from a management company and it is obvious that they work to have everything just within code, and no...", "source_dataset": "hf_legal_reddit", "source_record_id": "2woqpo", "full_text_length": 6699, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Breaking lease due to failure to have repairs made - MA", "link": "https://www.reddit.com/r/legaladvice/comments/2woqpo/breaking_lease_due_to_failure_to_have_repairs/"}}
{"text": "TLDR: I moved into a “luxury” apartment and had our storage unit (inside the building) broken into. The complex has known serious crime issues (years’ worth). I no longer feel safe and want an option to leave if I want to sooner/before our lease ends. \n\n——————————————-\n\nAside from the normal loud neighbors, bad pet owners, shit and pee in places they shouldn’t be... My boyfriend and I gave our new...", "source_dataset": "hf_legal_reddit", "source_record_id": "eahrgo", "full_text_length": 4701, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[CA] I moved to a “luxury” apartment complex (barely 3 weeks ago) that has several years’ worth of burglaries, along with other security issues. My storage unit got broken into two weeks after moving in. I no longer feel safe here and want the option to leave. Anyway I can legally break my lease?", "link": "https://www.reddit.com/r/legaladvice/comments/eahrgo/ca_i_moved_to_a_luxury_apartment_complex_barely_3/"}}
{"text": "When I lived in Missouri, I had a brief fling which resulted in an unplanned pregnancy. By the time I found out, the \"relationship\" was already over. I texted him to tell him I was pregnant, he said it's impossible because he's sterile. *eyeroll* He was a turd anyway, so I dropped it. I applied for and received assistance from the state, including health insurance, food stamps, and WIC. I had my s...", "source_dataset": "hf_legal_reddit", "source_record_id": "7w4y17", "full_text_length": 3082, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Paternal rights | Missouri/Florida", "link": "https://www.reddit.com/r/legaladvice/comments/7w4y17/paternal_rights_missouriflorida/"}}
{"text": "Hey there, /r/legaladvice. This is kind of a silly question, but I'm paranoid, so I thought I'd ask for tips.\n\nAbout 2 months ago, I was driving in my mom's neighborhood when I \"ran a red light.\" (I did, but the light changed while I was in the intersection, so I continued through.) I was immediately pulled over. I tried to explain my reasoning to the cop, but he wasn't having it and issued me a t...", "source_dataset": "hf_legal_reddit", "source_record_id": "55i8l4", "full_text_length": 1282, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[CA] My traffic ticket disappeared?", "link": "https://www.reddit.com/r/legaladvice/comments/55i8l4/ca_my_traffic_ticket_disappeared/"}}
{"text": "I am really confused as to how the new law will affect me. I am working as a Sole IT guy at my job, I am paid 35k salary. I also work a ton of overtime. I am In IL. \n\nI went on the DOL and found this https://www.dol.gov/whd/overtime/fs17a_overview.htm\nbut it did not help me much.\n\nTo qualify for the computer employee exemption, the following tests must be met:\nThe employee must be compensated eith...", "source_dataset": "hf_legal_reddit", "source_record_id": "560ybz", "full_text_length": 1455, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can someone explain the new Overtime laws that go into effect Dec 1st?", "link": "https://www.reddit.com/r/legaladvice/comments/560ybz/can_someone_explain_the_new_overtime_laws_that_go/"}}
{"text": "Hi all,\n\nSorry in advance for the super long post, I am just so stressed right now I don’t know what to do. \n\nTL;DR subleaser won’t own up to their mistakes in paying for damages made by their pet. I have to pay out of my own pocket. What can I do to get the money back?\n\nSo I’m currently leasing an apartment (student housing) with 2 other people. I subleased the apartment to another person for 4 m...", "source_dataset": "hf_legal_reddit", "source_record_id": "e6rh04", "full_text_length": 4494, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Ontario, Canada: sublet damaged furniture and won’t pay", "link": "https://www.reddit.com/r/legaladvice/comments/e6rh04/ontario_canada_sublet_damaged_furniture_and_wont/"}}
{"text": "I [40F] was married for 10 years, together for a total of  15 years with no dependents to my now ex-husband [42M]. I recently have become privy to evidence of infidelity (that runs longer than I ever imagined), a criminal case I knew nothing of while we were together, and the hiding of assets upon being served my divorce complaint. \n\nIn our 10 years of marriage I helped him while he built up two b...", "source_dataset": "hf_legal_reddit", "source_record_id": "gdx8q5", "full_text_length": 1942, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can My Divorce Be Amended?? I Have Proof Of Years Of Infidelity And The Hiding Of Marital Assets During The Divorce. Please Help- Any Advice Is Appreciated", "link": "https://www.reddit.com/r/legaladvice/comments/gdx8q5/can_my_divorce_be_amended_i_have_proof_of_years/"}}
{"text": "Good Day All:\n\nI hope the following makes some degree of logical sense, please forgive any spelling, grammatical, etc. errors in the following.  Please also forgive if this is the wrong sub for this as I\"m new to reddit platform entirely.\n\nThis all begins with a YouTube channel I'm a huge fan of called FatheringAutism created by the father of a nonverbalal autistic girl with severe autism.  I find...", "source_dataset": "hf_legal_reddit", "source_record_id": "gq5qb1", "full_text_length": 3329, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Am I in the wrong for screen capturing an image of a child from a Youtube video and saving fully clothed pictures of children on my iPhone", "link": "https://www.reddit.com/r/legaladvice/comments/gq5qb1/am_i_in_the_wrong_for_screen_capturing_an_image/"}}
{"text": "Kind of clickbait. Tldr: They want to use my legal name. I do not use my legal name and it does not accurately identify me. \n\nEdit::: Takeaways from discussion. I'd like to copy a piece of [this comment of mine](https://www.reddit.com/r/legaladvice/comments/7s1wct/my_university_will_not_issue_my_diploma_with_my/dt1m8ik/):\n&gt; Look, I realize now that I came to the wrong place with this issue, bec...", "source_dataset": "hf_legal_reddit", "source_record_id": "7s1wct", "full_text_length": 4512, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My university will not issue my diploma with my name on it.", "link": "https://www.reddit.com/r/legaladvice/comments/7s1wct/my_university_will_not_issue_my_diploma_with_my/"}}
{"text": "The following is an email to a property manager that manages my apartment building. The owner of the building picked a new property manager, these new guys came in and ruined everything, and claim they are now in charge of everyone's lease. I told them I am leaving, and now they are trying to take my security deposit. Names have been changed, few spelling errors intact, edits [ARE IN BRACKETS]. My...", "source_dataset": "hf_legal_reddit", "source_record_id": "2rq2gh", "full_text_length": 8469, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Did I go to far? and do I have a legal leg to stand on?", "link": "https://www.reddit.com/r/legaladvice/comments/2rq2gh/did_i_go_to_far_and_do_i_have_a_legal_leg_to/"}}
{"text": "I go to a gym in Astoria, NY. I have been a member since July 2014.\n\nWhen I arrived at the gym today, I saw a sign that the gym was closed because of inclement weather and that members could use the alternate location instead. It also said that tomorrow (3/6) would be the gym's last day of operation at that location. The thing is, my gym (let's call it TUV) does not have an alternate location. I s...", "source_dataset": "hf_legal_reddit", "source_record_id": "2y3mre", "full_text_length": 2392, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My gym went out of business without notice and handed over our contracts and credit card info to another gym", "link": "https://www.reddit.com/r/legaladvice/comments/2y3mre/my_gym_went_out_of_business_without_notice_and/"}}
{"text": "[Here'a a CORRECTED screenshot of what I found online](http://imgur.com/elPTyEa). I used the \"search cases\" link on the self help page of the county website. All the \"minutes\" options are a pop up saying they aren't released publicly. \n\nOk, let me try to keep this as short and concise as possible. A little harder with the FML freak out I'm trying not to have. \n\nWe've been separated 2 years but div...", "source_dataset": "hf_legal_reddit", "source_record_id": "589ybq", "full_text_length": 2644, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[CA] Looked up my year old divorce online for specific dates &amp; I'm freaking out! FFS, is our divorce invalid? Are we still married?! (Good gawd, pls say no!). What about his new marriage!! HELP!!", "link": "https://www.reddit.com/r/legaladvice/comments/589ybq/ca_looked_up_my_year_old_divorce_online_for/"}}
{"text": "Location: California, USA\n\nFirst of all, I am not entirely sure if this is the best subreddit to post this in. So if there is a better place I'm completely open to suggestions. \n\nAfter noticing a weird reconnection fee charged on my October bill ($35), I started a chat looking for answers. The rep, Maria, stated that service can be interrupted automatically by the system if the balance carries ove...", "source_dataset": "hf_legal_reddit", "source_record_id": "7wnwue", "full_text_length": 2850, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "ATT disrupted service after threatening FCC complaint and attempted to sign in to my google account.", "link": "https://www.reddit.com/r/legaladvice/comments/7wnwue/att_disrupted_service_after_threatening_fcc/"}}
{"text": "I am trying to gather some information regarding a minority partner who \"sold\" his shares in a business partnership. I recently put together a board of advisors for my business and we are seeking some clarity on the situation in order to make some better judgments. \n\nIn October of this past year, after several months of some taxing negotiations, we agreed on a price for 'financial remuneration\" (t...", "source_dataset": "hf_legal_reddit", "source_record_id": "elcsks", "full_text_length": 2491, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Business Partner May Have Sold Shares Illegally (KY)", "link": "https://www.reddit.com/r/legaladvice/comments/elcsks/business_partner_may_have_sold_shares_illegally_ky/"}}
{"text": "Just as a precursor this is in the state of Missouri, and the position I am being considered for is a government job that requires a security clearance.  From what I can tell this info was obtained from my employer by an investigator with the Office of Personnel Management. (Just in case there's a different set of laws for disclosing info to prospective employers when it's federal or requires a se...", "source_dataset": "hf_legal_reddit", "source_record_id": "55wyw3", "full_text_length": 5328, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My current employer \"disclosed\" incorrect info to a prospective employer that could potentially result in me losing an amazing career opportunity. What steps should I take from here?", "link": "https://www.reddit.com/r/legaladvice/comments/55wyw3/my_current_employer_disclosed_incorrect_info_to_a/"}}
{"text": "  Hi everyone, I’m posting this here to advise a friend who has found himself in some pit of trouble. \n\nA few day ago, he was driving with his car when he hit a pedestrian at night (Australia). The man, whose condition was severe, was taken to the hospital and when police came, there was a witness to the accident who was able to provide details of what happened. \n\nAccording to my friend’s account,...", "source_dataset": "hf_legal_reddit", "source_record_id": "elbqwk", "full_text_length": 2530, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Friend hit a pedestrian with his car which resulted in the death of said pedestrian, possible suicide, does he have to protect himself with a lawyer?", "link": "https://www.reddit.com/r/legaladvice/comments/elbqwk/friend_hit_a_pedestrian_with_his_car_which/"}}
{"text": "Hello everyone;\n\nI've recieved a notice for a hearing taking place four days from now and just need to wrap my head around some concepts/have some questions answered. I greatly appreciate it in advance.\n\nDuring the Covid layoffs, I was working as a substitute teacher for two districts, and as a server, all of which I was unable to return to and which kickstarted me on filing for unemployment. \n\nAs...", "source_dataset": "hf_legal_reddit", "source_record_id": "gpf4pk", "full_text_length": 2136, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Appeal Launched Against My Unemployment-Should I Be Worried?", "link": "https://www.reddit.com/r/legaladvice/comments/gpf4pk/appeal_launched_against_my_unemploymentshould_i/"}}
{"text": "So around 6 months ago my father passed away and ever since both my mother and have been fighting with the insurance provider. My mother and father have been divorced for nearly 18 years and throughout this time my mother has remained the policy beneficiary. Despite this the insurance company (Pr*dential) has refused to pay out the claim to her due to the fact that nothing in the divorce decree st...", "source_dataset": "hf_legal_reddit", "source_record_id": "gw3iiu", "full_text_length": 884, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Life insurance provider will not pay claim to designated beneficiary", "link": "https://www.reddit.com/r/legaladvice/comments/gw3iiu/life_insurance_provider_will_not_pay_claim_to/"}}
{"text": "My ex husband and I divorced in 2016.  We were living together in York County, PA.  Since our two children were born and had lived their lives there, and due to their ages (5, 9), I fought for but was not granted primary custody.  I had moved to Maryland, closer to my workplace, and in one of the US’s top 25 places to live.  I had been commuting 90 minutes to work one-way and trying to be a good M...", "source_dataset": "hf_legal_reddit", "source_record_id": "gubhh3", "full_text_length": 6495, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "He Can’t Because I’m Not Interested", "link": "https://www.reddit.com/r/legaladvice/comments/gubhh3/he_cant_because_im_not_interested/"}}
{"text": "I live in New Rochelle NY, westchester county. \n\nI don't actually know if theres anything i am able to do that's why i am asking. We've been living in the apartment for over 2 and a half years. Our intercom system was non-functioning when we moved in; we would hear it in the apartment but we had to run downstairs to let people in/receive packages. i didn't make any complaints because the executive...", "source_dataset": "hf_legal_reddit", "source_record_id": "53j0fd", "full_text_length": 3103, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Small question, having problems with my housing authority.", "link": "https://www.reddit.com/r/legaladvice/comments/53j0fd/small_question_having_problems_with_my_housing/"}}
{"text": "Hey all, I am 19 and recently (this month) received a speeding ticket for 83 in a 50. It was a Toll Bridge that people drive around 70 on constantly, and I wasn’t paying attention and got caught in a speed trap.\n\nIn Texas, you are not allowed to do driver safety, or a ton of other options if the ticket was 25+ miles per hour over the speed limit. This is my first ticket, and since I drive a Red Ca...", "source_dataset": "hf_legal_reddit", "source_record_id": "edhogq", "full_text_length": 1358, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(TX) Speeding Ticket and Awful Attorney. NEED ADVICE", "link": "https://www.reddit.com/r/legaladvice/comments/edhogq/tx_speeding_ticket_and_awful_attorney_need_advice/"}}
{"text": "EDIT: Thanks for the replies, I think I got my answer. Appreciate it muchly. \n\n\n------------------------------------------------------------\n\n\n\nI'm 28f (Natalie) married to 35m (Oscar). Oscar's ex wife is Joan. \n\nI'm going to try and keep this **extremely** complicated history as brief and as factually objective as I can humanly make it. All names used are fake and just to keep things straight. Bo...", "source_dataset": "hf_legal_reddit", "source_record_id": "2peysh", "full_text_length": 6548, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Severing maternal rights in Texas", "link": "https://www.reddit.com/r/legaladvice/comments/2peysh/severing_maternal_rights_in_texas/"}}
{"text": "Now. I'm not saying I want to hack north Korea, or that I would, but I've been thinking about them a lot this year and a thought crossed my mind.\nHigh ranking north Korean officials have access to the general internet through China and they manually sort through content to decide what is suitable for North Korean internet, meaning that the general internet is indirectly connected to North Korean i...", "source_dataset": "hf_legal_reddit", "source_record_id": "gbm3us", "full_text_length": 1064, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Hacking north Korea", "link": "https://www.reddit.com/r/legaladvice/comments/gbm3us/hacking_north_korea/"}}
{"text": "I just wanted to run this by you all! I was working for an employer for a total of 6 months. First starting as Bar Staff and then once my 3 months was over and I was made official I was then promoted to Bar Supervisor which I was as you would think over the moon! I found a job that I actually loved and it was walking distance from my home so In all its a win win right?!? I was even using my wages ...", "source_dataset": "hf_legal_reddit", "source_record_id": "ef4dly", "full_text_length": 1740, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "This has been bugging me", "link": "https://www.reddit.com/r/legaladvice/comments/ef4dly/this_has_been_bugging_me/"}}
{"text": "A few months ago my and my friend were walking through town on a night out, we wasn't heavily intoxicated maybe 3 or 4 pints. Out of nowhere my friend was attacked by a man he had something in his hand I couldn't see what it was. I instantly reacted and pushed the man away to defend my mate. The man fell to the floor, I helped him up and apologized. The weapon flew out of his hand and my friend pi...", "source_dataset": "hf_legal_reddit", "source_record_id": "2tlxa2", "full_text_length": 2861, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "UK (england) pushed a man over to defend my friend.", "link": "https://www.reddit.com/r/legaladvice/comments/2tlxa2/uk_england_pushed_a_man_over_to_defend_my_friend/"}}
{"text": "I live in a rent controlled apartment in Los Angeles. During a city inspection last year the city informed her that there is not a certificate of occupancy for my unit. She has been fighting this since then and is currently working on getting a variance from the city.  \n\n&amp;nbsp;\n\nI am moving out of state in the middle of the month and informed her the other day that I am moving and would only b...", "source_dataset": "hf_legal_reddit", "source_record_id": "2uot2d", "full_text_length": 937, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Landlord is trying to collect rent for invalid unit.", "link": "https://www.reddit.com/r/legaladvice/comments/2uot2d/landlord_is_trying_to_collect_rent_for_invalid/"}}
{"text": "My wife and I were asked to be the legal guardian of our nephew. It was posed to us for the purposes of a will, basically if the parents were to die, we'd be the kids legal guardian. We both live in New England, but in different states.\n\nSo usually I would say yes in a heart beat. It's sort of \"what are the odds\" meets \"I would want to help if something awful happened.\"\n\nThe problem is my sister i...", "source_dataset": "hf_legal_reddit", "source_record_id": "2or8rb", "full_text_length": 1880, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Question about legal guardianship", "link": "https://www.reddit.com/r/legaladvice/comments/2or8rb/question_about_legal_guardianship/"}}
{"text": "On my final month of my lease that ended mid-month, my landlord's automatic payment system tried withdrawing a full month of rent from my bank account, instead of the prorated amount. I immediately called the office to see what to do, they told me to put a stop-payment order on the charge, and pay the correct amount by check. All was fine until I received a final bill stating I was charged a $75 N...", "source_dataset": "hf_legal_reddit", "source_record_id": "2lvwyz", "full_text_length": 1143, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[TX] Landlord falsely charged $75 insufficient funds fee on last month of rent. Won't return calls or e-mails.", "link": "https://www.reddit.com/r/legaladvice/comments/2lvwyz/tx_landlord_falsely_charged_75_insufficient_funds/"}}
{"text": "\nI am a first year apprentice in the NYC carpenters union. I Live on Long Island, Back in January I went on disability due to a neck injury. I submitted all required paperwork that was needed in order for me to receive disability payments and miss work as well as class. \n\nI received a letter in March saying that I was terminated from the program because I missed my class and didn’t have the correc...", "source_dataset": "hf_legal_reddit", "source_record_id": "gs84ew", "full_text_length": 1821, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "NYC Carpenters Union terminated me from the apprentice program, despite me being on medical leave.", "link": "https://www.reddit.com/r/legaladvice/comments/gs84ew/nyc_carpenters_union_terminated_me_from_the/"}}
{"text": "I'm in Florida, and for the past month, we have had a leak under our stairs, and the problems keep mounting up with it. \n\nWe informed our landlord of the leak at the beginning of August. It was in the utility closet where the water heater is, but the pan that the water heater sits in is dry. He had a plumber come out, the plumber determined it was not our unit leaking, but rather an adjacent unit....", "source_dataset": "hf_legal_reddit", "source_record_id": "523k9p", "full_text_length": 3040, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can I use rent withholding to expedite my landlord to fix a leak?", "link": "https://www.reddit.com/r/legaladvice/comments/523k9p/can_i_use_rent_withholding_to_expedite_my/"}}
{"text": "Hi /r/legaladvice. Cross-posting from /r/Minneapolis to try and get a full picture.\n\nI'll keep this as concise as possible. Apartment was below 60 from late November until yesterday when it warmed up outside. Landlord (well, the management company) was notified December 7, again on December 26, again within the last week. They keep sending people out to 'bleed the radiator', despite my insistence ...", "source_dataset": "hf_legal_reddit", "source_record_id": "7p9cst", "full_text_length": 2603, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[MN]Sub-60 degree apartment in Minneapolis. Have a few questions about legal options. x-posted from /r/Minneapolis.", "link": "https://www.reddit.com/r/legaladvice/comments/7p9cst/mnsub60_degree_apartment_in_minneapolis_have_a/"}}
{"text": "Hello all. This past weekend I purchased a 3-hour rental of a Polaris Razor UTV, in East Tennessee. At one point, I went to turn around in a parking lot and took the turn a little too sharply. The vehicle rolled over and sustained very minor cosmetic damage. With the help of a bystander, I was able to flip the vehicle back over, and drive back to the place I rented it from. Immediately the owner b...", "source_dataset": "hf_legal_reddit", "source_record_id": "51ha9f", "full_text_length": 2042, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Minor Accident in Rented ATV. Claims Process Started. Insurance company has indicated they may not cover me. Should I panic?", "link": "https://www.reddit.com/r/legaladvice/comments/51ha9f/minor_accident_in_rented_atv_claims_process/"}}
{"text": "A friend, her cat, and I moved into a freshly renovated apartment with brand new carpet, paint, and floor boards in Phoenix, Arizona. We were tenants for 18 months. \n\nAbout 6 months into our first lease we noticed mold growing on the floor boards in a corner of one of the bedrooms along with soaked carpet. We submitted a service request to have it looked at. The maintenance crew came in and spray ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gmyzv9", "full_text_length": 3744, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Apartment had a leak, notified property manager, moved out, they are trying to charge us for the carpet. (AZ)", "link": "https://www.reddit.com/r/legaladvice/comments/gmyzv9/apartment_had_a_leak_notified_property_manager/"}}
{"text": "Using a throwaway because it would be too easy to figure out where I work if I posted on my main.\n\nSo I was hired on at a major company to work in the shipping department. I was asked at orientation if I had any problem with heights and I said sometimes so they placed me in shipping because they never have to deal with heights.  After a few years I cross trained to a picking position to help out s...", "source_dataset": "hf_legal_reddit", "source_record_id": "506d2y", "full_text_length": 5882, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Employer refused to acknowledge harassment claim then first suspends me and then transfers me.", "link": "https://www.reddit.com/r/legaladvice/comments/506d2y/employer_refused_to_acknowledge_harassment_claim/"}}
{"text": "Hi everyone. Long time lurker in this sub and in BOLA, but this is my first time posting. I’ve tried to include as much information as I can to explain the situation without writing a whole novel, but if any other information is needed please let me know. Also let me say right off the bat that I know both of my parents have made some less-than-stellar (and in one case possibly veering into fraud o...", "source_dataset": "hf_legal_reddit", "source_record_id": "e9qao7", "full_text_length": 4846, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Dad died unexpectedly, finances are a disaster, can't find the will - just looking for some guidance on how to get started.", "link": "https://www.reddit.com/r/legaladvice/comments/e9qao7/dad_died_unexpectedly_finances_are_a_disaster/"}}
{"text": "Location: Texas\n\nIn 2013-03, just after my insurance was renewed, a police officer wrote me a ticket for having no insurance during an encounter for an unrelated not-at-fault accident. As the ticket cost was less than $200, I paid it online, entering a plea of no contest in the process, and have thought nothing about it for 23 months now.\n\nYesterday, I learned that while I had paid the nominal tic...", "source_dataset": "hf_legal_reddit", "source_record_id": "2vhz88", "full_text_length": 2816, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Vacating A Ticket Plea", "link": "https://www.reddit.com/r/legaladvice/comments/2vhz88/vacating_a_ticket_plea/"}}
{"text": "Hey all, thanks in advance for your help. \n\nMy wife has been with her current, medium-sized employer for a few years now, with regularly documented great reviews, regular raises (just got one earlier this week) and a promotion. For around half of that has been on FMLA for a chronic condition. This hasn't been an issue, but there is a policy that any accrued sick leave is used for this time, and wh...", "source_dataset": "hf_legal_reddit", "source_record_id": "7rmcg6", "full_text_length": 1608, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[WA] Is my wife's employer trying to evade FMLA Protections and fire her?", "link": "https://www.reddit.com/r/legaladvice/comments/7rmcg6/wa_is_my_wifes_employer_trying_to_evade_fmla/"}}
{"text": "Sorry for how long this is going to be, I'll try to keep this as short as possible.  I was driving through a county in Virginia on Christmas Eve night at around 9PM with my girlfriend and I was pulled over by an unmarked car for speeding.  A male in his 50's approached my window after about 4 minutes of being pulled over and asked if I knew how fast I was going.  I already had my license out and I...", "source_dataset": "hf_legal_reddit", "source_record_id": "2qqo0g", "full_text_length": 5954, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Sheriff in plain clothes / unmarked car pulled me over for speeding wouldn't show badge so I drove off and called 911", "link": "https://www.reddit.com/r/legaladvice/comments/2qqo0g/sheriff_in_plain_clothes_unmarked_car_pulled_me/"}}
{"text": "Before you tell me how idiotic I am, I wouldn’t have done it if I wasn’t duped. Geico quoted $228 per payment with collision(I’m a new driver but have great credit score and have never been in an accident or any legal trouble) but didn’t exactly tell me up front that it would be $228 every 2 weeks. For context $228 is already high in my state even with collision. Who even in their right mind would...", "source_dataset": "hf_legal_reddit", "source_record_id": "enguq9", "full_text_length": 878, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I’ve been paying almost $500 a month on car insurance and didn’t know it.", "link": "https://www.reddit.com/r/legaladvice/comments/enguq9/ive_been_paying_almost_500_a_month_on_car/"}}
{"text": "I got a speeding ticket in OR and dont want to pay the whole thing/have it on my record. Already plead not guilty (today,) waiting on trial notice.\n\nWas going 35~38 mph (officer says 38...)  in a 25 and ticket is for $160. Otherwise clean driving record.\n\nI've been reading that I might be able to somehow appeal to the prosecuter/officer and get them to agree to a deal. My questions are:\n\nWhat shou...", "source_dataset": "hf_legal_reddit", "source_record_id": "7plpgz", "full_text_length": 662, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[OR] Plead Not Guilty For Speeding Ticket, Am Guilty. How To Get A Better Deal?", "link": "https://www.reddit.com/r/legaladvice/comments/7plpgz/or_plead_not_guilty_for_speeding_ticket_am_guilty/"}}
{"text": "Sorry if this has been covered but I'm at my wits end and can't find the info I'm looking for anywhere. I'll try to be as specific as possible while also being somewhat vague since my partner reads reddit and it concerns her and she wouldn't want me getting involved. This takes place at a state college in NY.\n\nA while back my partner was being verbally abused by a doctor in her office. She suffers...", "source_dataset": "hf_legal_reddit", "source_record_id": "e9ppsl", "full_text_length": 7301, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Fallout from workplace bullying in NY state.", "link": "https://www.reddit.com/r/legaladvice/comments/e9ppsl/fallout_from_workplace_bullying_in_ny_state/"}}
{"text": "I got hired on early February at my current job, let's call it \"A\", and started officially working there early March. About two weeks after I started, I was notified that, as Covid-19 hit, my employer could not afford to pay me a full-time salary. I would have to be moved to part-time, and file for unemployment benefits under the status \"Partial Employment,\" which is an option available to people ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gdqhgs", "full_text_length": 2069, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Washington state unemployment is disqualifying me for benefits because I got fired from my last job.", "link": "https://www.reddit.com/r/legaladvice/comments/gdqhgs/washington_state_unemployment_is_disqualifying_me/"}}
{"text": "I am a recently employed usher at a movie theater in Corona, California and it seems that the management likes to push people around. I hear complaints everyday from coworkers on how poorly they are treated and the very poor management that slows them down. It seems as if some of the management here is sexist and ageist and believe that because we are younger, we are afraid to speak up. That thoug...", "source_dataset": "hf_legal_reddit", "source_record_id": "egyacf", "full_text_length": 5688, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I need help, it feels like younger males are discriminated at my job and the management here is horrible", "link": "https://www.reddit.com/r/legaladvice/comments/egyacf/i_need_help_it_feels_like_younger_males_are/"}}
{"text": "This creep is easily 10 years my wife’s senior and already has a violent criminal background. A few months after my wife started at her job, a retail gig with an electronics and technology giant, the scumbag started making passes at her. She was unsure of his motives and is always open to making new friends at any age; I encourage this behavior, but unfortunately this is not the first time I’ve se...", "source_dataset": "hf_legal_reddit", "source_record_id": "ee9vdp", "full_text_length": 7788, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Wife’s Sexual Harasser Was Promoted After Written Complaint.", "link": "https://www.reddit.com/r/legaladvice/comments/ee9vdp/wifes_sexual_harasser_was_promoted_after_written/"}}
{"text": "Bit of a back story: \n\nI’ve worked at my company in Indiana for a year. This is my first job out of university. When I was hired, my department was located at the branch in Indiana. There have been some changes, and now my new boss is located at company headquarters in Detroit, Michigan. \n\nA week ago, I had an extremely positive performance review at work. After it was over, my new boss and HR sur...", "source_dataset": "hf_legal_reddit", "source_record_id": "gl8yrr", "full_text_length": 1396, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Company is forcing me to relocate during this pandemic, also trying to get out of paying unemployment if I refuse to move. [Indiana, USA]", "link": "https://www.reddit.com/r/legaladvice/comments/gl8yrr/company_is_forcing_me_to_relocate_during_this/"}}
{"text": "Location: New Jersey, USA &amp; a different home country\n\nHi Reddit, I'd like to preface this post by saying that I never thought I would find myself in a situation where I would be reaching out for legal assistance but here I am. Please bear with me as I explain my situation below. Throwaway for obvious reasons.  \n\n**Background:**  \nDuring my time working in the US, I purchased a condo in NJ arou...", "source_dataset": "hf_legal_reddit", "source_record_id": "gkkj6v", "full_text_length": 6407, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Wife(?) living with her boyfriend(?) in a home she and I co-own but I pay the mortgage for", "link": "https://www.reddit.com/r/legaladvice/comments/gkkj6v/wife_living_with_her_boyfriend_in_a_home_she_and/"}}
{"text": "I rear ended someone. I know this was my fault, I felt really bad about it. The damage was really minor and honesty I didn’t want to tell my parents about what happened, and we have the same insurance policy. So I told the woman I’d prefer not to go through insurance (though I did give her my insurance info) and that I’d pay for the damage. No police, no insurance. \n\nI paid for the bill with my cr...", "source_dataset": "hf_legal_reddit", "source_record_id": "gkflfr", "full_text_length": 1187, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(CT) I think I messed up. I rear ended someone and I didn’t report it to my insurance company.", "link": "https://www.reddit.com/r/legaladvice/comments/gkflfr/ct_i_think_i_messed_up_i_rear_ended_someone_and_i/"}}
{"text": "I worked for an EMS system in Florida as an EMT.  I recently came in for a shift like normal, and was taken to a director's office. He explained I had a complaint. I was glad to learn that it was nothing involving my work. He proceeded to ask me about my past legal history, and was writing things down periodically while I was speaking. I didn't realize that I was going to be fired no matter what I...", "source_dataset": "hf_legal_reddit", "source_record_id": "efpmdk", "full_text_length": 1220, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Forced to resign. Involves facial recognition software", "link": "https://www.reddit.com/r/legaladvice/comments/efpmdk/forced_to_resign_involves_facial_recognition/"}}
{"text": "Hi all,\nI got a speeding ticket and I was going to initially contest it because I wasn't speeding but I have no evidence to back up my claims and I can't win against the cops obviously so im just going to try and explain to the prosecution what's happening and try and cut a deal.\nHeres the thing though, I have never been to court before and have no idea what to expect or even what I need to say, C...", "source_dataset": "hf_legal_reddit", "source_record_id": "2u6611", "full_text_length": 481, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Court next week. Traffic offence.", "link": "https://www.reddit.com/r/legaladvice/comments/2u6611/court_next_week_traffic_offence/"}}
{"text": "I have been living in my elderly adopted mother's home since 2012, when she became unable to live alone any longer and moved to be with my sister who could provide daily care and help her as she began to need assistance with bathroom activities and bathing. I moved back here and intended to leave once she was taken care of, but she asked me to continue living here until she passes, as she feared t...", "source_dataset": "hf_legal_reddit", "source_record_id": "gnprf4", "full_text_length": 4712, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Is there anything I can do to save the home my mother intended to leave me?", "link": "https://www.reddit.com/r/legaladvice/comments/gnprf4/is_there_anything_i_can_do_to_save_the_home_my/"}}
{"text": "I referred someone to Hired.com a few months ago and they ended up accepting a job through them. Hired offers a referral bonus of $1337 per referral and I was notified through their automated system that I am entitled to this bonus (I am not a Hired.com employee btw, just a user). I was supposed to get this bonus on March 25 but they have been continually uncommunicative and lead me along. I fille...", "source_dataset": "hf_legal_reddit", "source_record_id": "gt2iho", "full_text_length": 1058, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "KY, USA - Hired.com won’t give me my referral bonus", "link": "https://www.reddit.com/r/legaladvice/comments/gt2iho/ky_usa_hiredcom_wont_give_me_my_referral_bonus/"}}
{"text": "At Ohio State University, students are automatically subscribed to the Athletics Ticket Office email subscription. Most of these emails are promotions for basketball games or other various sports. There is a link at the bottom of the email that states \"Manage preferences or Unsubscribe\" and I clicked on this to try and remove myself from receiving these emails (it's getting annoying the amount of ...", "source_dataset": "hf_legal_reddit", "source_record_id": "7wcjxc", "full_text_length": 1686, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Should university students be forced to receive commercial promotion emails?", "link": "https://www.reddit.com/r/legaladvice/comments/7wcjxc/should_university_students_be_forced_to_receive/"}}
{"text": "Hey Everyone,\n\nI have a few questions regarding the end of our lease, nothing here is major but I just want to make sure I fully understand our rights, especially in these current times. We live in MN, USA.\n\nso our lease is coming to an end where we have to renew or move out end of June. Our lease does specify that if we do not renew we automatically go to Month to Month with either side able to e...", "source_dataset": "hf_legal_reddit", "source_record_id": "gbak5y", "full_text_length": 2216, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Rent higher to renew than for new tenants, showings with WFH", "link": "https://www.reddit.com/r/legaladvice/comments/gbak5y/rent_higher_to_renew_than_for_new_tenants/"}}
{"text": "Hi fellow Redditors\n\nMy auto insurance Autopay failed due to credit card issues.  My insurance company cancelled my policy and notified me by email  a few months ago and got buried under to a lot of junk mails .\n\nI received a mail from CA DMV to submit proof of insurance.\n\nI called my insurer and they told me that the cancelled policy can’t be reinstated and I need to get a new policy.\n\nI immediat...", "source_dataset": "hf_legal_reddit", "source_record_id": "gdlhwm", "full_text_length": 962, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Gap in Auto insurance, CA", "link": "https://www.reddit.com/r/legaladvice/comments/gdlhwm/gap_in_auto_insurance_ca/"}}
{"text": "Hello I’m in California and I’m a manager for a store. \n\nMy direct supervisor called a meeting for me to schedule with my entire staff after closing to hold an “Assimilation”. The basic tenets of the assimilation is for me to leave the room, my team gives my boss feedback, then my boss gives me the feedback to understand what I can do to improve, then I have an opportunity to speak with my team ar...", "source_dataset": "hf_legal_reddit", "source_record_id": "eevfi6", "full_text_length": 2616, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Emotional distress (mental anguish)", "link": "https://www.reddit.com/r/legaladvice/comments/eevfi6/emotional_distress_mental_anguish/"}}
{"text": "This is a little long because it has been a six month headache. I should mention, both parties have been completely cordial with each other the entire time. It just needs to be resolved. \n\nMy wife and I live in an apartment in Nashville, TN and have been living in this same complex for about a year and a half. We were able to pay our rent during the first year like normal, no problem. We do so fro...", "source_dataset": "hf_legal_reddit", "source_record_id": "ghlx2v", "full_text_length": 11326, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Rent", "link": "https://www.reddit.com/r/legaladvice/comments/ghlx2v/rent/"}}
{"text": "Background:\n\nOur company is a large multinational food service company. Due to our status as “essential” we have remained open during Covid, and struggled to adjust. Initially, employees were banned from wearing face coverings or gloves. Recently the policy has changed however to always require a face mask and only require gloves if interacting with customers. \n\nAs of this week, employees have bee...", "source_dataset": "hf_legal_reddit", "source_record_id": "gjryph", "full_text_length": 1534, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I have photographic proof of a superior not following our companies Covid-19 policies. He is firing employees for similar infractions. Can this photo be used to prevent said employees from being fired, or is that considered blackmail?", "link": "https://www.reddit.com/r/legaladvice/comments/gjryph/i_have_photographic_proof_of_a_superior_not/"}}
{"text": "Hello everyone, I created this account to look for help with an issue that has been ongoing for me.\n\nSome background - I am in the military and this all started after I had been in for 3 years and was in an officer training program.\n\nMy ex wife took our son at 1 year and moved back to Ohio from Florida with her parents, and filed for divorce and custody of our son. She stopped paying bills and wou...", "source_dataset": "hf_legal_reddit", "source_record_id": "egetsg", "full_text_length": 1994, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Divorce and custody help in Ohio/military", "link": "https://www.reddit.com/r/legaladvice/comments/egetsg/divorce_and_custody_help_in_ohiomilitary/"}}
{"text": "(Seattle, Washington, USA) Selling artistically-modified superhero toy earrings of a well-known brand product that were most likely flagged by an automated system for copyright infringement. Other companies sell similar items and have been around for years. Etsy says to get in touch with their legal team, but unsure if that will invite further legal scrutiny. What to do in this type of situation? ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gjadjp", "full_text_length": 568, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "How to Handle Copyright Infringement Strikes on Etsy?", "link": "https://www.reddit.com/r/legaladvice/comments/gjadjp/how_to_handle_copyright_infringement_strikes_on/"}}
{"text": "Boss shoved me (on camera &amp; unprovoked) as they screamed at me, I left and called police. Police conducted witness interviews and determined nothing happened but refused to look at the tapes. The witness were among friends and romantic partners of the boss.  I asked police to review cameras and they said no, that the case was closed and wouldn’t be reviewed. What?!?", "source_dataset": "hf_legal_reddit", "source_record_id": "eahr47", "full_text_length": 372, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My boss hit me a few times and police did nothing", "link": "https://www.reddit.com/r/legaladvice/comments/eahr47/my_boss_hit_me_a_few_times_and_police_did_nothing/"}}
{"text": "So this requires a lot of context, in which I'm going to explain. I'm actually a dual citizen, Hong Kong and USA. \n\nI'm a solo game developer creating my first game that I want to sell on Steam or other platforms, and currently I'm temporarily living in Hong Kong for 1-2 years. Ideally I wanted to create an LLC in the US, but circumstances prevent me from returning to the US any time soon.  I want...", "source_dataset": "hf_legal_reddit", "source_record_id": "ejg1uu", "full_text_length": 1766, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Hong Kong and USA] Game developer questions. How do I associate the game I'm developing to my family member's company?", "link": "https://www.reddit.com/r/legaladvice/comments/ejg1uu/hong_kong_and_usa_game_developer_questions_how_do/"}}
{"text": "Here's a link to an older post with details on what happened in the accident:\nhttp://www.reddit.com/r/Insurance/comments/2msj68/i_got_sideswiped_in_my_car_other_partys_insurance/\n\nMy insurance company found me not at fault while the other driver's insurance company is saying I am 35% at fault because I did not move out of the way. I found out that the other driver gave a much different statement t...", "source_dataset": "hf_legal_reddit", "source_record_id": "2rlbaq", "full_text_length": 1679, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I got side-swiped in my car; other party's insurance adjuster is saying I am 35% at fault; I want to contest this and am considering small claims court [California]", "link": "https://www.reddit.com/r/legaladvice/comments/2rlbaq/i_got_sideswiped_in_my_car_other_partys_insurance/"}}
{"text": "Hello everyone;\n\nI am from DFW, Texas. I've recieved a notice for a hearing taking place four days from now and just need to wrap my head around some concepts/have some questions answered. I greatly appreciate it in advance.\n\nDuring the Covid layoffs, I was working as a substitute teacher for two districts, and as a server, all of which I was unable to return to and which kickstarted me on filing ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gpf8eh", "full_text_length": 2158, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "DFW, Texas. Appeal Launched Against my Unemployment Status. How to Prepare and Whether to be Worried?", "link": "https://www.reddit.com/r/legaladvice/comments/gpf8eh/dfw_texas_appeal_launched_against_my_unemployment/"}}
{"text": "We have co-parented for 11 years. We were already divorcing when she was pregnant and after the divorce we came out with shared and equal custody. Neither of us has to pay support to the other. We have our daughter an equal amount of time (usually alternating weeks). We had to agree on stuff like medical and school and if we didn't we would have to go to arbitration. We had never once not agreed i...", "source_dataset": "hf_legal_reddit", "source_record_id": "55ruuc", "full_text_length": 1573, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(Florida) After 11 years of equal parenting my wife went to court to get things modified", "link": "https://www.reddit.com/r/legaladvice/comments/55ruuc/florida_after_11_years_of_equal_parenting_my_wife/"}}
{"text": "I need some help. How does an executor of a will get off the will without hurting someone’s feelings. What should I say and what steps should I take.\n\nHere’s the story. One day my mom got a call from Sally, a crazy relative. News was that I was to be on Sally’s will as her dog’s care taker if she was to pass. Sally never spoke to me personally about being given this responsibility, and my mother w...", "source_dataset": "hf_legal_reddit", "source_record_id": "govn7k", "full_text_length": 1013, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Serious] Seattle, WA or USA lawyers, what should one do to properly remove themselves from being someone’s executor of their will?", "link": "https://www.reddit.com/r/legaladvice/comments/govn7k/serious_seattle_wa_or_usa_lawyers_what_should_one/"}}
{"text": "In October of this year, I had a business partner who bought a minority percentage of membership in a company I started and ran for the past several years. I was a 60% owner in the company at its inception with a 40% minority ownership to another individual who...well...let's simply say that after doing everything that I possibly could to rectify the situation it was a messy end to the partnership...", "source_dataset": "hf_legal_reddit", "source_record_id": "eb56p8", "full_text_length": 2822, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[KY] Transfer of Minority Ownership", "link": "https://www.reddit.com/r/legaladvice/comments/eb56p8/ky_transfer_of_minority_ownership/"}}
{"text": " I applied for California unemployment insurance benefits, but soon after, I realized I may have filled out the application incorrectly. I have never filed for unemployment before, and I was having a hard time trying to figure it all out. I wanted to cancel the claim a.s.a.p, but I have not been able to get through to anyone at any of the EDD phone numbers (they're extremelyy busy), and all the of...", "source_dataset": "hf_legal_reddit", "source_record_id": "gfivx7", "full_text_length": 1094, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Will I be indicted for fraud if I submitted an unemployment insurance claim, and it got approved before I could cancel?", "link": "https://www.reddit.com/r/legaladvice/comments/gfivx7/will_i_be_indicted_for_fraud_if_i_submitted_an/"}}
{"text": "Hello, throwaway account. Located in PA, not Philadelphia.\n\nTrying to remain as anonymous as possible. I won’t use ages however, my wife and I are both under thirty. Some details may be vague.\n\nI decided to post here instead of relationship advice because well, she’s not interested in being together.\n\nI don’t have social media, except Reddit. I’m without everything else except Snapchat.\n\nMy wife n...", "source_dataset": "hf_legal_reddit", "source_record_id": "ej0i93", "full_text_length": 2840, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I believe my wife (separated) is engaging in prostitution and I’m concerned about the safety of our children.", "link": "https://www.reddit.com/r/legaladvice/comments/ej0i93/i_believe_my_wife_separated_is_engaging_in/"}}
{"text": "TL;DR: My roommate assaulted me in my room after I told him to get out of my personal room. School found me \"responsible\" of threats of violence and disruptive conduct for defending myself with a knife, requiring me to pay around $4000 for my housing contract which they cancelled. What are my legal options? \n\nLast month my roommate at USF, Tampa, Florida, confronted me in the apartment we share, w...", "source_dataset": "hf_legal_reddit", "source_record_id": "2m358i", "full_text_length": 4797, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "School punishing me for defending myself against an attacker, Florida", "link": "https://www.reddit.com/r/legaladvice/comments/2m358i/school_punishing_me_for_defending_myself_against/"}}
{"text": "Hello guys, \n\nI was a total idiot and got two speeding tickets within a week of each other, October 26th and November 4th. The october ticket was for doing 85 in a 55 on a deserted backroad stretch of the 15. I picked up speed to pass a car and that's when the cop clocked me. Violation was recorded as VC22349(B)- Exceed Speed 2 lane undivided highway.\n\nThe second ticket was 97 in a 70 on the freew...", "source_dataset": "hf_legal_reddit", "source_record_id": "7qyos7", "full_text_length": 1316, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(California) Got two speeding tickets within a week of each other. Could lose new job over them. What are my options?", "link": "https://www.reddit.com/r/legaladvice/comments/7qyos7/california_got_two_speeding_tickets_within_a_week/"}}
{"text": " \n\nI live and work in Illinois and I've filed for unemployment and I'm trying to get a better sense of whether or not I'll be denied or not.\n\nNow obviously it'd be nearly impossible for any 3rd party to fully understand the variables at play but I'll give a brief description as honestly as possible about the specific reason I was fired.\n\nI worked in a warehouse for a mid-scale international packag...", "source_dataset": "hf_legal_reddit", "source_record_id": "gtxlii", "full_text_length": 4361, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Fired from my job for \"unprofessional behavior in the workplace\" and applied for UI. Likely will be contested and considered misconduct.", "link": "https://www.reddit.com/r/legaladvice/comments/gtxlii/fired_from_my_job_for_unprofessional_behavior_in/"}}
{"text": "Hi everyone! This takes place in Nevada, US.\n\nMy boyfriend and I rented out an apartment for a year and moved out January 17, 2020. When we asked the office staff multiple times if we were paying a prorated amount or a full month amount, we were told a prorated amount. They then told us that they would keep in contact with us and let us know how much the prorated amount will be. We signed our vaca...", "source_dataset": "hf_legal_reddit", "source_record_id": "gmc9vj", "full_text_length": 1844, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Apartments Demanding Rent", "link": "https://www.reddit.com/r/legaladvice/comments/gmc9vj/apartments_demanding_rent/"}}
{"text": "So the parking lot of our apartment has an automated, chain-driven sliding gate. Our car was parked in the spot parallel to and just behind the gate, along where the sliding gate backs up while being opened. We were getting in the car as another car was exiting the lot and triggered the automatic sensor to open the gate. Just as the gate was sliding next to our car, the breeze blew open our driver...", "source_dataset": "hf_legal_reddit", "source_record_id": "53lci4", "full_text_length": 1197, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(Los Angeles) Not your typical automatic gate damage", "link": "https://www.reddit.com/r/legaladvice/comments/53lci4/los_angeles_not_your_typical_automatic_gate_damage/"}}
{"text": "Fair warning this content may be triggering. So when I was ten I started being sexually assaulted/raped by my step dad. (I'm not sure what the proper term is here but there was actual penetration) It lasted for four years culminating in my siblings along with myself being removed from our mother and placed into foster care. He was caught with damning evidence(pictures he had taken of me while perf...", "source_dataset": "hf_legal_reddit", "source_record_id": "gefvcz", "full_text_length": 1840, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can I contest a parole boards decision? (CA)", "link": "https://www.reddit.com/r/legaladvice/comments/gefvcz/can_i_contest_a_parole_boards_decision_ca/"}}
{"text": "My mother died in October. She left no will. My brother and I have been trying our best to sort things out.\n\nMy mother married her boyfriend about a year ago so she could get better insurance coverage. Their prenuptial agreement essentially said they have no claim to each other’s property or responsibility for each other’s debts, but he still supported her a lot financially. Immediately after my m...", "source_dataset": "hf_legal_reddit", "source_record_id": "e73kjg", "full_text_length": 3642, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Mother deceased. No will. What should I be worried about?? (long story, tldr at the end)", "link": "https://www.reddit.com/r/legaladvice/comments/e73kjg/mother_deceased_no_will_what_should_i_be_worried/"}}
{"text": "I'm from NJ and use the turnpike occasionally to get to work. Since I just started my job, I haven't gotten around to getting an EZ pass yet (If you're from Jersey: Ya ya ya, I know, I know, I don't want to hear about why I don't already have one). For those of you who don't know, an EZ pass is essentially a scannable device that automatically withdraws the toll from an account as you pass through...", "source_dataset": "hf_legal_reddit", "source_record_id": "e92b04", "full_text_length": 2291, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Ticket for not paying the toll...but I did, and completed the transaction with a toll booth employee... however, I fucked up and did not ask for a receipt. Do I have any options? [NJ]", "link": "https://www.reddit.com/r/legaladvice/comments/e92b04/ticket_for_not_paying_the_tollbut_i_did_and/"}}
{"text": "My brother was arrested and released on ROR yesterday. He left his girlfriend last week because she would not go after the father of her kids for support and he is unable to support them all and his own daughter. They filed income tax last month and she is now claiming that he forced her to file an inaccurate return. She filed a false 1099 so that she could claim her children. They filed completel...", "source_dataset": "hf_legal_reddit", "source_record_id": "7vi1ci", "full_text_length": 2050, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[PA] Looking for advice to help my brother.", "link": "https://www.reddit.com/r/legaladvice/comments/7vi1ci/pa_looking_for_advice_to_help_my_brother/"}}
{"text": "Apologizes if this is not well written, TL;DR at the end.\n\nLocation: Ontario, Canada\n\nDue to COVID-19, my family is temporarily living in an address that is different from our mailing address. Our uncle lives in our mailing address and because of COVID, we haven’t visited him often (nor collected mail from the mailbox).\n\nOur insurance account was closed officially on May 14 (to my knowledge) by ou...", "source_dataset": "hf_legal_reddit", "source_record_id": "go28ui", "full_text_length": 3282, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Our insurance company closed our account due to non-payment and because of it, there is a record of non-payment on us.", "link": "https://www.reddit.com/r/legaladvice/comments/go28ui/our_insurance_company_closed_our_account_due_to/"}}
{"text": "My college professor for human anatomy is extremely unfair. I am an extremely dedicated &amp; hard working student, and she absolutely refuses to give anybody in class higher than a 70 on any assignment/exam/project.  When she is asked to explain the low grade, she acts rude and dismissive, and gives vague, unclear responses. Students have been withdrawing from the class in tears almost every day....", "source_dataset": "hf_legal_reddit", "source_record_id": "2hwzck", "full_text_length": 3120, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Dealing with an unreasonable, unfair college professor. Is what she is doing also illegal in any way? (Massachusetts)", "link": "https://www.reddit.com/r/legaladvice/comments/2hwzck/dealing_with_an_unreasonable_unfair_college/"}}
{"text": "Hey all!\n\nI work in the IS department of an insurance company in **Idaho**. Yesterday after a chain of events, we found out that a coworker, also in the IS department, grabbed passwords of privileged users in the company by using his elevated access in the department, signed in as them in our billing and policy systems, and proceeded to create his own user. He was then able to access the system as...", "source_dataset": "hf_legal_reddit", "source_record_id": "2xspiy", "full_text_length": 1027, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Coworker grabbing people's passwords to give self access to private information", "link": "https://www.reddit.com/r/legaladvice/comments/2xspiy/coworker_grabbing_peoples_passwords_to_give_self/"}}
{"text": "For context, I work in a large international consulting company and have been with them for quite some years. \n\nA few weeks ago I was on a conference call and for some reason I turned on my video. I was the only one out of 6 people with video on. The call was boring and I was not planning to say anything. So I decided to get one thing that I had in mind all day out of my system and started masturb...", "source_dataset": "hf_legal_reddit", "source_record_id": "ggaq7p", "full_text_length": 1567, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Germany] Masturbated during a conference call and accidentally had my video on", "link": "https://www.reddit.com/r/legaladvice/comments/ggaq7p/germany_masturbated_during_a_conference_call_and/"}}
{"text": "Edit update:\nThe answer is not entirely clear per an actual lawyer:\nhttp://my.justanswer.com/question/guest/2cf25724fe774009a0617b36fb674c09\n\n\nThis question is for California specifically.\n\nLast spring I took up an offer to work internationally through my California employer for a few months overseas.  I’m still overseas now, at the tail end of this international work and heading home in a few wee...", "source_dataset": "hf_legal_reddit", "source_record_id": "58epsi", "full_text_length": 4995, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Signed a “Retention Agreement” with employer, but is it actually enforceable in CA, USA?", "link": "https://www.reddit.com/r/legaladvice/comments/58epsi/signed_a_retention_agreement_with_employer_but_is/"}}
{"text": "**I posted this in [/r/AskAcademia](https://np.reddit.com/r/AskAcademia/comments/51grtn/my_school_is_threatening_to_revoke_my_degree/) and it was recommended that I cross-post it here for legal advise on the matter as well.**  \n\n**Edited to add:  Since there apparently seems to be some ambiguity I didn't realize in my original post, I want to make it perfectly clear.  I used test banks and homewor...", "source_dataset": "hf_legal_reddit", "source_record_id": "51hj98", "full_text_length": 6512, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[X-Post from /r/AskAcademia/] My school is threatening to revoke my degree. Please advise!", "link": "https://www.reddit.com/r/legaladvice/comments/51hj98/xpost_from_raskacademia_my_school_is_threatening/"}}
{"text": "My school implemented a pass/fail rule where if you had a 60 percent or above as of March 13 you automatically pass the semester. I had a 98 percent in my class at the time, however, I am dual enrolled in Spanish in a community college and the community college stated that if you have above a 70 percent by May 10, you can either submit a pass/fail form or else your percent grade gets entered. \n\nMy...", "source_dataset": "hf_legal_reddit", "source_record_id": "ggogsj", "full_text_length": 936, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Teacher fails everyone in the class", "link": "https://www.reddit.com/r/legaladvice/comments/ggogsj/teacher_fails_everyone_in_the_class/"}}
{"text": "I have been stalking reddit since my teen/pre-teen kids discovered it years ago, but never made an account until this year when I unexpectedly found myself laid up. As this is my first post ever, I hope I don't find out I made some big reddit faux pas and end up with a new butt hole instead of great advice that will help me out of this hopeless, dreary hole I find myself in.\n\nI will try to make th...", "source_dataset": "hf_legal_reddit", "source_record_id": "e76hkx", "full_text_length": 38797, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Please help me to help myself!", "link": "https://www.reddit.com/r/legaladvice/comments/e76hkx/please_help_me_to_help_myself/"}}
{"text": "I am in Massachusetts. My understanding is that I was terminated due to a NSFW video of me being sent around the company this past weekend, but I did not send it. I am trying to determine if this was wrongful termination, if I'll qualify for unemployment, and what I can do moving forward, if anything. Sorry this is so long, it's a ridiculous story and I'm not sure how it all fits together to equal...", "source_dataset": "hf_legal_reddit", "source_record_id": "e9dvs5", "full_text_length": 11161, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Fired because my (F27) nudes were shared around the company", "link": "https://www.reddit.com/r/legaladvice/comments/e9dvs5/fired_because_my_f27_nudes_were_shared_around_the/"}}
{"text": "(This is obviously about US law)\n\nWatching the season finale of The Blacklist, season 4, there was something new to me:\n\nAram, one of the protagonists, is subpoenaed and granted immunity, after which the court tells him he is therefore not allowed to refuse testimony as per fifth amendment.\n\nThat had me wondering: Is it possible in the US legal system to not accept such a grant of immunity, so tha...", "source_dataset": "hf_legal_reddit", "source_record_id": "gp4t8o", "full_text_length": 1981, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(Curiosity) TV show The Blacklist: Can you reject granted immunity so that you can \"plead the fifth\"?", "link": "https://www.reddit.com/r/legaladvice/comments/gp4t8o/curiosity_tv_show_the_blacklist_can_you_reject/"}}
{"text": "Broward County, Florida.\n\nMy (M) mother works as a cafeteria worker for the School Board of Broward County.  Just under a month ago, M called me about problems she was having with her new manager (NM) and supervisor (S).  Being over 4 hours away at college and inexperienced in this sort of thing, I told M to write down everything she possibly could as the situation progressed.  Yesterday, S verbal...", "source_dataset": "hf_legal_reddit", "source_record_id": "54s8j4", "full_text_length": 3823, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can My Mother's Employer Do This?", "link": "https://www.reddit.com/r/legaladvice/comments/54s8j4/can_my_mothers_employer_do_this/"}}
{"text": "I currently live in NSW, Australia and go to a private school. They give us laptops to use and during quarantine (so, at home) I was using discord. I was on it for two months just talking to friends and engaging in servers every now and then. During the second term they went through my conversations. Basically, I have mental health issues that the school know of, so when they looked through my con...", "source_dataset": "hf_legal_reddit", "source_record_id": "grgk2x", "full_text_length": 1322, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "School looking through discord messages in Australia", "link": "https://www.reddit.com/r/legaladvice/comments/grgk2x/school_looking_through_discord_messages_in/"}}
{"text": "First, a legend to describe the characters at play: Tenant (Me), Property Management Company (PM), Property Owner (PO), Leasing Agent (LA (who works for PM)), Secretary (PM), The Boss (PM), Maintenance Guy (MG), Key Store Employee (KSE). \n\nOne fateful Friday evening, I lost the key to my apartment. I spent the entire weekend without the ability to lock my door because there was no remedy outside o...", "source_dataset": "hf_legal_reddit", "source_record_id": "gvk3kq", "full_text_length": 6669, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Has my landlord committed fraud? MT", "link": "https://www.reddit.com/r/legaladvice/comments/gvk3kq/has_my_landlord_committed_fraud_mt/"}}
{"text": "Hello everyone, \r\nRecently my wife was let go from her job on 12/22/17. Her boss told her she was letting her go based on “negative attitude”. They had a disagreement on how the shop should be arranged and her boss said she had enough of her negative attitude and let her go. We filed a claim with Colorado unemployment. Today we received the following letter from the unemployment office:\r\n\r\n\r\nPleas...", "source_dataset": "hf_legal_reddit", "source_record_id": "7tw563", "full_text_length": 2596, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My wife is being denied unemployment for a wrongful reason", "link": "https://www.reddit.com/r/legaladvice/comments/7tw563/my_wife_is_being_denied_unemployment_for_a/"}}
{"text": "I recently left a job in daycare to pursue a nanny position. After many interviews with many families, I feel that I have found the best fit with a family with a very young child who has special needs. Without revealing too much information- the child has a life threatening condition that among other things gave her an underdeveloped respiratory system. Her outlook seems good for the time being, b...", "source_dataset": "hf_legal_reddit", "source_record_id": "ek1z6l", "full_text_length": 1420, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I am considering accepting a job as a nanny for a child with a life threatening condition. What do I need to do to protect myself?", "link": "https://www.reddit.com/r/legaladvice/comments/ek1z6l/i_am_considering_accepting_a_job_as_a_nanny_for_a/"}}
{"text": "Sorry for the long and ranty  post in advance. I am crying freaking out right now at damn near 3am on a 5am morning. I need a lot of support and comfort and some advice right now. \n\nI received a little pamphlet from my apartment offering various options at our end of lease, which is February 2. We missed the 60 day move out deadline. I'll get back to this, but I want to provide a bit more context ...", "source_dataset": "hf_legal_reddit", "source_record_id": "e7s8ui", "full_text_length": 7852, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Will my landlords show mercy on their 60 day move out notice policy?", "link": "https://www.reddit.com/r/legaladvice/comments/e7s8ui/will_my_landlords_show_mercy_on_their_60_day_move/"}}
{"text": "Hi /legaladvice. My question is: Is being conviced that something is morally good (or morally not wrong) a valid defense ?. As you may know law sometimes may contradict moral (like smoking weed is not something morally wrong but it is banned its banned in a lot of states). So I'll give you 3 examples:\n\n#1 A member of PETA (People for Ethical Treatment of Animals) breaks into a lab and \"steals\" the...", "source_dataset": "hf_legal_reddit", "source_record_id": "2tsvov", "full_text_length": 2022, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(USA) Is this a valid defense ?", "link": "https://www.reddit.com/r/legaladvice/comments/2tsvov/usa_is_this_a_valid_defense/"}}
{"text": "Hi,\nLet me start with some background, I suffer from a rare medical condition that leaves me prone to internal bleeding in my joints and already have one of my ankles fused as a result of this condition. I went on and am still on an approved FMLA from work prior to surgery as the pain in my ankle was worsening and affecting my ability to work. I am currently in a significant amount of pain and am ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gj3zq6", "full_text_length": 2192, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(Maryland) Health insurance company is denying my claim for surgery saying that it is experimental. Do I have grounds to file a suit and where do I find an attorney specializing in this?", "link": "https://www.reddit.com/r/legaladvice/comments/gj3zq6/maryland_health_insurance_company_is_denying_my/"}}
{"text": "I hope I have the right flair for this. I am sorry if I do not.\n\nSo I went to this school for 3 years, I made straight A’s and had the same professor for all of my core classes. At the end of one semester they got rid of him, because he did not have a high enough degree to be teaching college courses.\n\nThey have since dissolved my degree program and made a new one with a lot of the same courses. T...", "source_dataset": "hf_legal_reddit", "source_record_id": "7yquc5", "full_text_length": 1003, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "College had me taking courses for someone who wasn’t actually qualified to teach, now I have to start over and none of my classes count.", "link": "https://www.reddit.com/r/legaladvice/comments/7yquc5/college_had_me_taking_courses_for_someone_who/"}}
{"text": "Many years ago before we were married, my wife purchased a car in Texas with the help of her grandmother.  Her grandmother paid for the car in full and my wife has been making monthly payments to her since the car was purchased.  My wife tells me she remembers signing the car title indicating that her grandmother was the lien-holder of the car.  The title was still in grandma's possession as the c...", "source_dataset": "hf_legal_reddit", "source_record_id": "81f9kh", "full_text_length": 2881, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Lien-holder on car is grandmother who passed away. We have no documentation of anything related to purchase or financing and don't know who technically holds the lien now [TX]", "link": "https://www.reddit.com/r/legaladvice/comments/81f9kh/lienholder_on_car_is_grandmother_who_passed_away/"}}
{"text": "I was recently doing an internship for practicum at grad school. Very suddenly a week ago, my supervisor called me in and said very cryptically that they wouldn't be able to work with me any further, that I had crossed too many boundaries, and that it was too much of a risk having me at the agency. I was shocked, and I wanted to know what in the world she thought I had said or done. She never gave...", "source_dataset": "hf_legal_reddit", "source_record_id": "56doyi", "full_text_length": 1270, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[KY] I'm getting booted out of grad school and I don't know why. Can FERPA help?", "link": "https://www.reddit.com/r/legaladvice/comments/56doyi/ky_im_getting_booted_out_of_grad_school_and_i/"}}
{"text": "I am a 19 year old college student working to put myself through school. I enjoy smoking weed to relieve stress and anxiety. I truely believe I function better with weed in my system. I work a good job that is primarily m-f, 8-5. Needless to say, my first priority when this happened was making sure I could make it to work this morning (this happened last night).\n\nI was smoking some weed with my ne...", "source_dataset": "hf_legal_reddit", "source_record_id": "2refog", "full_text_length": 2264, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Kansas (Overland Park)- Police \"smell\" marijuana in hallway, let them in or face a search warrant", "link": "https://www.reddit.com/r/legaladvice/comments/2refog/kansas_overland_park_police_smell_marijuana_in/"}}
{"text": "Greetings Reddit,\n\nLong time reader, first time poster here. I am going through a fight with my insurance company over the total loss of my 2003 BMW 540i M-Sport after it was stolen. I had the car less than a month and paid $14,000 for it (12.9k + tax/fees). The insurance company is offering $8,900, which is essentially robbing me 5 grand!\n\nI recently sent this email pleading my case:\n\n\"I am reque...", "source_dataset": "hf_legal_reddit", "source_record_id": "4z8w7m", "full_text_length": 6446, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Insurance Nightmare ~ Need Advice! (2003 540i M-Sport Stolen in Houston, Texas) [Repost from 'Personal Finance']", "link": "https://www.reddit.com/r/legaladvice/comments/4z8w7m/insurance_nightmare_need_advice_2003_540i_msport/"}}
{"text": "Hello, and thank you in advance for your input. I have been working on the review of my previous company to post on Glassdoor for a while now, and after sitting on it for two months I am ready to post. I am, however, concerned about being sued for liable as it is not a pretty review, and would appreciate some additional eyes on it before I post. I am in the United States, and have seen my company ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gt11zv", "full_text_length": 3705, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Will this Glassdoor company review get me sued?", "link": "https://www.reddit.com/r/legaladvice/comments/gt11zv/will_this_glassdoor_company_review_get_me_sued/"}}
{"text": "This is a long story filled with a lot of family drama that I will try to avoid. in NY, I’m 19F, my uncle is 60M and my mom and my grandparents are deceased- Grandpa December 28,2018, Grandma February 9 2020, Mom November 7 2018. Also grandparents are from Italy, and illiterate in English and possibly Italian. Spoke broken English. \n\nIn February 2018, my mom fell and hit her head. Prior to this, s...", "source_dataset": "hf_legal_reddit", "source_record_id": "gneoaa", "full_text_length": 4578, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My uncle lied manipulated and tricked my grandparents and stole my inheritance", "link": "https://www.reddit.com/r/legaladvice/comments/gneoaa/my_uncle_lied_manipulated_and_tricked_my/"}}
{"text": "Some backstory: I gave birth to my almost 5 year old child in Ohio. He was 24, I was 26 at the time. The father and I were already separated when I found out I was pregnant (drug use, him lying to me about why he was really on probation, and his friends planning to drug my food led to me ending things between us). When I found out I was pregnant I was instantly accused of lying to him that I was o...", "source_dataset": "hf_legal_reddit", "source_record_id": "ggr6q1", "full_text_length": 4959, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Unmarried Visitation Rights (OH/AK)", "link": "https://www.reddit.com/r/legaladvice/comments/ggr6q1/unmarried_visitation_rights_ohak/"}}
{"text": "Hi everyone,\n\nI've never posted here before, so my apologies if this isn't the correct sub. We live in Maine, which is an at-will employment state.\n\nMy wife had worked for a small business for about a year. Her boss was the COO of the company. For the past year, they've butted heads off and on. COO will give my wife project, my wife completed it, and then COO decides they don't want it and calls f...", "source_dataset": "hf_legal_reddit", "source_record_id": "e9ov71", "full_text_length": 1452, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Unsure if wife was terminated unlawfully", "link": "https://www.reddit.com/r/legaladvice/comments/e9ov71/unsure_if_wife_was_terminated_unlawfully/"}}
{"text": "My Father passed away recently and my uncle (his brother) is the executor of his estate. my dad had a life insurance policy taken out while my parents were still married and my mother tells me it should be worth around $400,000. She is not interested in the money and knows my dad wanted it for me and my 3 brothers. \nmy uncle says the will leaves everything to his 4 sons, but we think he may have c...", "source_dataset": "hf_legal_reddit", "source_record_id": "2y5hr8", "full_text_length": 1398, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Life insurance question, need help", "link": "https://www.reddit.com/r/legaladvice/comments/2y5hr8/life_insurance_question_need_help/"}}
{"text": "[Michigan]\n\nNext Thursday I'm being sentenced for 3 counts of Delivery of a controlled substance and 3 counts of Posession in a school zone. The actual offenses were made during January and February of last year, while I was receiving aid.\n\nAccording to https://studentaid.ed.gov/sa/eligibility/criminal-convictions, I may be able to regain eligibility by completing an approved drug rehabilitation p...", "source_dataset": "hf_legal_reddit", "source_record_id": "7vq3qk", "full_text_length": 1048, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Receiving Federal Student Aid after Felony Drug Conviction [x-post /r/financialaid]", "link": "https://www.reddit.com/r/legaladvice/comments/7vq3qk/receiving_federal_student_aid_after_felony_drug/"}}
{"text": "Some facts about the incident:\n\n1)I'm from California, so is the other driver.\n\n2)At the time I wasn't insured, but the other person was.\n\n3)Both of us were over 18.\n\n4)No one was injured.\n\n5)Law enforcement wasn't contacted when it happened.\n\nSo the incident happened last May. What had happened was that I was backing out of a storefront, began turning so as to drive onto the main road, when I fel...", "source_dataset": "hf_legal_reddit", "source_record_id": "7rgvq6", "full_text_length": 3132, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I got into a car accident last year and the other person's insurance is coming after me for reimbursement, even though I don't think I was at fault. What do I do? Can I contest it, at would it even be worth it?", "link": "https://www.reddit.com/r/legaladvice/comments/7rgvq6/i_got_into_a_car_accident_last_year_and_the_other/"}}
{"text": "My mother has died. Her will stated she wanted to be interred in a specific plot in NYC. She lived and died in AZ. Since the local mortuary would need to transfer her to another mortuary in NY, I'm serious concerned of her getting lost in the overwhelming situation there and reports of bodies being mistreated.\n\nThe second issue is she wanted to be buried with her mother, however other family membe...", "source_dataset": "hf_legal_reddit", "source_record_id": "gfv6eq", "full_text_length": 730, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Question on Last Will Burial Wishes", "link": "https://www.reddit.com/r/legaladvice/comments/gfv6eq/question_on_last_will_burial_wishes/"}}
{"text": "My mom passed away last week at 45. It was unexpected and we're all still in shock. \n\nShe left behind 4 kids, including myself. I am 25 and I'm the oldest. We are all older than 18. I'm the next of kin. She did not have a will. She has no other immediate family members. It's just us. So I'm now responsible for dealing with everything and I have no idea what to do.\n\nShe had a basic 25k life insuran...", "source_dataset": "hf_legal_reddit", "source_record_id": "7s8kur", "full_text_length": 4188, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Illinois] Mom passed away, leaving behind only 4 kids - no will. How to handle estate?", "link": "https://www.reddit.com/r/legaladvice/comments/7s8kur/illinois_mom_passed_away_leaving_behind_only_4/"}}
{"text": "Me, my friend, and his cousin were walking home from a  bar in our neighborhood.  We decided to go walk around the neighborhood, simply just because. We walked towards a park where I wanted to get a drink of water from the water fountain. We were then approached by a lone police officer in a  cruiser.  He turned his lights on and got our attention. We stopped to acknowledge him and ask what the ma...", "source_dataset": "hf_legal_reddit", "source_record_id": "2s9krh", "full_text_length": 1835, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I was stopped by the police tonight.", "link": "https://www.reddit.com/r/legaladvice/comments/2s9krh/i_was_stopped_by_the_police_tonight/"}}
{"text": "My nephew's wife decides she wants a divorce.  She just basically fell out-of-love with him (no infidelity, no fighting).  They are both 26 and have been married for 7 year.   One day, she said she was going to visit her dad (still in Indiana, but up north), and she comes back home and said she found a place to stay and then over the two weeks following, she started moving all of their home furnis...", "source_dataset": "hf_legal_reddit", "source_record_id": "2y4p2n", "full_text_length": 2869, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[IN] Nephew's wife is filing for divorce and leaving him with expenses under their name. Will likely get sued by landlord for try to cut lease short. He's not sure how he should address this situation.", "link": "https://www.reddit.com/r/legaladvice/comments/2y4p2n/in_nephews_wife_is_filing_for_divorce_and_leaving/"}}
{"text": "Hello all. \n\nI sold a vehicle sometime around 2016 via personal sale. I was in a bad spot mentally at the time and never cancelled the registration, nor did I renew the insurance policy, I just let both of them lapse. I went through a big breakup that left me in debt, and ended up having to move (after being stuck with a lease that we used to split, blah blah sob story poor me.)\n\nIt appears that t...", "source_dataset": "hf_legal_reddit", "source_record_id": "gkjmda", "full_text_length": 1697, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I let my auto-insurance lapse when I sold my vehicle, but they renewed it without my knowledge and without sending a bill (e-statements only). I just found out it was going to collections [MA]", "link": "https://www.reddit.com/r/legaladvice/comments/gkjmda/i_let_my_autoinsurance_lapse_when_i_sold_my/"}}
{"text": "Some back story. This is a big complicated mess and while I may not find all the answers I need I'm hoping to find out the right questions to ask of the right people. Most of this is regarding divorce and probate law. \n\nTwo weeks ago my dad died in Butler county Pennsylvania. He did not have a will, life insurance, retirement or investments. He had only maybe 2k in a bank account and partial owner...", "source_dataset": "hf_legal_reddit", "source_record_id": "e7f6nb", "full_text_length": 3823, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Death, divorce, greed and spite.", "link": "https://www.reddit.com/r/legaladvice/comments/e7f6nb/death_divorce_greed_and_spite/"}}
{"text": "See title.  My wife was 9 months pregnant, and we have another daughter who is about 18 months old.  My daycare shut down to non-essential families (us being non-essential).  So I left work a week early to help my wife care for our other child until it was time for us to give birth because she physically couldn't.  \n\nWe were told by the doctors that this was best, as she wasn't supposed to be lift...", "source_dataset": "hf_legal_reddit", "source_record_id": "gmcldw", "full_text_length": 926, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "EDD denied a week of parental bonding leave (California) because it was the week leading up to birth.", "link": "https://www.reddit.com/r/legaladvice/comments/gmcldw/edd_denied_a_week_of_parental_bonding_leave/"}}
{"text": "I was recently charged with a class C misdemeanor in Texas and thanks to what’s happening right now I don’t have a set date but I know that my maximum punishment is $500 and no jail time. I am guilty of what I am charged with and plan to either plead guilty or no contest (it’d be nice if someone could explain the difference to me) but I was wondering how much I would likely be ordered to pay? Than...", "source_dataset": "hf_legal_reddit", "source_record_id": "gdbee2", "full_text_length": 433, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(TX) How likely am I to have to pay a full fine on a Class C misdemeanor?", "link": "https://www.reddit.com/r/legaladvice/comments/gdbee2/tx_how_likely_am_i_to_have_to_pay_a_full_fine_on/"}}
{"text": "I am a teacher who has recently graduated from college and has a contract with a school district to work for them for several years post-graduation. I have been interviewing at multiple positions within the district for the last two weeks and had several opportunities I could pursue. \n\nOne school I interviewed with in particular (refered to as OS for original school) extended an offer for a positi...", "source_dataset": "hf_legal_reddit", "source_record_id": "bcynxo", "full_text_length": 2815, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I, a teacher, interviewed at a school who later interrupted my job search, confused my potential employers, and might have cost me a job in that district entirely. [MO]", "link": "https://www.reddit.com/r/legaladvice/comments/bcynxo/i_a_teacher_interviewed_at_a_school_who_later/"}}
{"text": "I am in Kansas and I am needing some advice for a friend of mine.\n\nLet me give a little background.  She is a good person, with poor judgement in guys.  Long story short, she married and had 5 kids with a \"minister\".  She discovered he was actually doing all of the things you would not expect a preacher to do (sex, drugs, gambling).  When the congregation found out he did these things, he unsucces...", "source_dataset": "hf_legal_reddit", "source_record_id": "2kif4s", "full_text_length": 3589, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Needing legal suggestion for Kansas Small Claims appeal against former landlord.", "link": "https://www.reddit.com/r/legaladvice/comments/2kif4s/needing_legal_suggestion_for_kansas_small_claims/"}}
{"text": "In 1989 before adopting us, our stepfather was deemed a child sex predator by a court ordered psychological evaluation in St. Tammany Parish. He was barred from unsupervised visitation with his biological children he was accused of abusing from his previous marriage. Further evidence of his sexual predatory behaviors are found in charges of voyeurism filed against him in the early 90s.\n\n&amp;nbsp;...", "source_dataset": "hf_legal_reddit", "source_record_id": "7sqodv", "full_text_length": 8113, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Louisiana] State allowed a sex predator to adopt us, we were abused, he plead guilty and sentenced to 10y, he is getting out 6 years early for good behavior", "link": "https://www.reddit.com/r/legaladvice/comments/7sqodv/louisiana_state_allowed_a_sex_predator_to_adopt/"}}
{"text": "Quick backstory. A friend and I were out at a bar last week. He drove us there in his car. At the end of the night he got his car from the parking lot next to bar and was in the process of driving to the front of the bar to pick me up when a cop attempted to pull him over for not having his lights on. According to my friend, he panicked and made the terrible decision to drive off. He went through ...", "source_dataset": "hf_legal_reddit", "source_record_id": "7upgt1", "full_text_length": 1270, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Friend fled from cops after getting pulled over and continues to dig himself deeper into trouble.", "link": "https://www.reddit.com/r/legaladvice/comments/7upgt1/friend_fled_from_cops_after_getting_pulled_over/"}}
{"text": "Monday night I was in a car accident that involved 3 vehicles. An SUV in front of me suddenly came to a complete stop but my auto break system kicked in and stopped my car before I collided. However a large truck behind me couldn't stop in time and crushed my car between the 2 and pushed me into the SUV.\n\n\nJust finished talking with my insurance today and they said his insurance (USAA) and he acce...", "source_dataset": "hf_legal_reddit", "source_record_id": "eluhx9", "full_text_length": 1133, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(US, MD) First accident involving other people. Guy who hit me from behind accepted fault. His insurance can't cover my new car.", "link": "https://www.reddit.com/r/legaladvice/comments/eluhx9/us_md_first_accident_involving_other_people_guy/"}}
{"text": "If it helps, I'm in Queensland, Australia.\n\nOn a few occasions I've sent screenshots of a conversation between myself and a guy we'll call Sam to some friends of mine. I'm not too great at awkward social situations, Sam was a guy I'd just met and he was saying some things that I found to be somewhat arrogant and a bit unsettling, so I sent some screenshots of our conversations to my closest friend...", "source_dataset": "hf_legal_reddit", "source_record_id": "gtfmwo", "full_text_length": 1476, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can I be sued for sending a screenshot of a conversation to a friend?", "link": "https://www.reddit.com/r/legaladvice/comments/gtfmwo/can_i_be_sued_for_sending_a_screenshot_of_a/"}}
{"text": "I am located in Ohio.\nI attended a nursing school in which I failed out of the same clinical portion twice.  The school has a policy in which you are kicked out for failing any two clinical sections.  I had passed all portions of the course, but was failed over not meeting the requirements listed in a signed agreement between myself and the instructor (basically a ten minute bs paper needed to be ...", "source_dataset": "hf_legal_reddit", "source_record_id": "7q320o", "full_text_length": 1779, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Kicked out of nursing school. Dean not getting back to me about result of appeal.", "link": "https://www.reddit.com/r/legaladvice/comments/7q320o/kicked_out_of_nursing_school_dean_not_getting/"}}
{"text": "Hi,\nI posted this in another forum where I was told this would be the best place to ask this question. In late February I ended up getting a ticket for Failure to Yield. My lawyer ended up attending the court hearing for me since I was recovering from my injuries. Both myself and the other driver were taken by ambulance to the hospital. \n\nMy lawyer asked me last week to provide him with an email f...", "source_dataset": "hf_legal_reddit", "source_record_id": "gjwbpa", "full_text_length": 1340, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Need help with traffic violation", "link": "https://www.reddit.com/r/legaladvice/comments/gjwbpa/need_help_with_traffic_violation/"}}
{"text": "A little background: I was born and raised in western massachusetts until my parents passed in a car accident in 2011. My brother moved down to TN to go to school at my aunt and uncle's house, and I followed him down here to go to school. I signed an apartment lease in January of 2014 and also renewed for 2015. In September of 2014 I renewed the lease for 2016 because the rates were the lowest the...", "source_dataset": "hf_legal_reddit", "source_record_id": "2r9pvg", "full_text_length": 3076, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Tennessee resident looking to get out of a very restrictive lease following my brother's tragic passing. Will a medical note get me out of it?", "link": "https://www.reddit.com/r/legaladvice/comments/2r9pvg/tennessee_resident_looking_to_get_out_of_a_very/"}}
{"text": "I have a question my parents live in a apartment complex last year the complex was bought by a new company which had my parents sign new lease agreement. My parent had sign the new lease agreement that state on 10/2019 the rent will be 835.00 monthly with a 50.00 fee for the water. I had review the statement for the rent for this month and it show the monthly rent is now 950.00 I had asked my pare...", "source_dataset": "hf_legal_reddit", "source_record_id": "gkmkxe", "full_text_length": 1418, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Lease agreement on rent payment - Austin TX", "link": "https://www.reddit.com/r/legaladvice/comments/gkmkxe/lease_agreement_on_rent_payment_austin_tx/"}}
{"text": "Sorry that this is going to be a little confusing; I'm doing this on my phone at work. I work for a small, Mom-and-Pop computer service/sales store, and I manage the sales department. To start, I would describe the place as a very hostile work environment.  The owner and his wife will yell at the top of their lungs at us, and will verbally abuse us.  Monday, the owner/my boss tells me that we're g...", "source_dataset": "hf_legal_reddit", "source_record_id": "5542el", "full_text_length": 3915, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My employer is trying to bully me into doing something I believe is illegal. (NM)", "link": "https://www.reddit.com/r/legaladvice/comments/5542el/my_employer_is_trying_to_bully_me_into_doing/"}}
{"text": "Hi there, \n\nI am making a quick post because I am a bit upset and let this carry on for a little bit since the beginning of December.  My main account is r/Morasumi.  I just had to make a new account because I forgot my password on it and forgot which email I attached onto it.  So, forgive me if this is a problem.\n\nAnyway, I sold a Wacom Cintiq Companion 2 on a selling app for $1k.  It is a sellin...", "source_dataset": "hf_legal_reddit", "source_record_id": "ec828d", "full_text_length": 5782, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I sold a Wacom tablet for $1K and buyer requested a return after telling me that he caused the error. Customer care allowed the return after I tried showing them a video on how I sent the package. I have a damaged tablet and some accessories now. What are my options? [USA, MI]", "link": "https://www.reddit.com/r/legaladvice/comments/ec828d/i_sold_a_wacom_tablet_for_1k_and_buyer_requested/"}}
{"text": "If I make a website or app for fun, do I need terms of service or a privacy policy or an end user license agreement?", "source_dataset": "hf_legal_reddit", "source_record_id": "gt2zws", "full_text_length": 116, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "If I make a website or app for fun, do I need terms of service or a privacy policy or an end user license agreement?", "link": "https://www.reddit.com/r/legaladvice/comments/gt2zws/if_i_make_a_website_or_app_for_fun_do_i_need/"}}
{"text": "**Context**: I worked in Illinois (At-Will Employment State) for a homeless shelter, and it is a high-stress environment. On an average evening shift, there would be only two case managers operating the shelter with up to 65 residents.\n\n**Incident &amp; Termination:** On February 27th, 2019 I received a call from my work telling me that my services had been terminated without being given reasons. ...", "source_dataset": "hf_legal_reddit", "source_record_id": "bbt31d", "full_text_length": 6320, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[US, IL] My employer fired me, stopped me from getting unemployment, and isn't following their own policies. Plus some other messed up stuff. What can I do?", "link": "https://www.reddit.com/r/legaladvice/comments/bbt31d/us_il_my_employer_fired_me_stopped_me_from/"}}
{"text": "Context is complicated so I will try to summarise:\n\n* A lives in house with B (friend) and C (B's fiancée), along with several others\n* After a long series of minor incidents, everyone including A decide to find a new home, without B and C\n* They (4+ housemates) tell this to B and C in a break-up style scenario, listing problems they had with living with B and C (about 2 weeks ago)\n* After this B ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2xanqy", "full_text_length": 2858, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[England] Friend A's housemate falsely accused them of crime, had them arrested. A is released without charges. What are their opportunities in terms of damages and retribution?", "link": "https://www.reddit.com/r/legaladvice/comments/2xanqy/england_friend_as_housemate_falsely_accused_them/"}}
{"text": "Illinois. Loan was opened in Michigan, bank is in Ohio. Thank you location bot.\n\nFor now, I'll leave the name of the bank out of this, but I plan on providing updates on how this goes.\n\nI have USAA Auto insurance, after switching from GEICO since they jacked my rates, but that's neither here nor there. During the purchase, USAA asked for my bank's name and I supplied it, and they said they would s...", "source_dataset": "hf_legal_reddit", "source_record_id": "7sx36v", "full_text_length": 2147, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Initial] Bank applied CPI after I sent proof of insurance", "link": "https://www.reddit.com/r/legaladvice/comments/7sx36v/initial_bank_applied_cpi_after_i_sent_proof_of/"}}
{"text": "My underemployed 20 year old son makes poor decisions. None criminal, one minor fender bender. He lives with us and is driving one of our cars. I want to know what steps I can take to reduce our liability if he makes a majorly poor decision while driving. Umbrella policy, changing ownership of car to him?", "source_dataset": "hf_legal_reddit", "source_record_id": "egkn8s", "full_text_length": 306, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Liable for adult son", "link": "https://www.reddit.com/r/legaladvice/comments/egkn8s/liable_for_adult_son/"}}
{"text": "Hi guys, first post (and only one hopefully) so forgive me if I forgot to add some info but here is some context:\n\nTLDR: Was notified of my position being terminated, shortly after left to pursue another job, didnt get it, filed for unemployment, issue with my separation from previous company, unemployment benefits frozen until issue is solved, it's been over 2 months and cannot reach anybody on t...", "source_dataset": "hf_legal_reddit", "source_record_id": "grohjz", "full_text_length": 2264, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Unemployment Benefits", "link": "https://www.reddit.com/r/legaladvice/comments/grohjz/unemployment_benefits/"}}
{"text": "An owner of the company had a “fling” with a particular employee (will call her E1) before E1 was an employee of the company. The ex employee (will call her E2) was made aware of the previous fling during E2’s employment (gossip) and caused some very significant issues by spreading the gossip and complaining about the working relationship. \n\nLegal was involved and long-story-short, we were advised...", "source_dataset": "hf_legal_reddit", "source_record_id": "ea6mfs", "full_text_length": 1005, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Heard through the grapevine that an ex employee may be leaving a bad, public review for our small business with some very personal information on it [MO]", "link": "https://www.reddit.com/r/legaladvice/comments/ea6mfs/heard_through_the_grapevine_that_an_ex_employee/"}}
{"text": "Website in English and Italian, company registered in Spain. What language should my Privacy Policy, Terms and Cookie Policy be?", "source_dataset": "hf_legal_reddit", "source_record_id": "gk4sbt", "full_text_length": 128, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Website in English and Italian, company registered in Spain. What language should my Privacy Policy, Terms and Cookie Policy be?", "link": "https://www.reddit.com/r/legaladvice/comments/gk4sbt/website_in_english_and_italian_company_registered/"}}
{"text": "Website is in English and Italian, the is company registered in Spain. \n\nWhat language should my Privacy Policy, Terms, and Cookie Policy be?  Can I publish just an English version?\n\nI sell to clients all around the world, whether they speak English, Italian or Spanish.\n\nThanks in advance.", "source_dataset": "hf_legal_reddit", "source_record_id": "gk4sbt", "full_text_length": 290, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Website in English and Italian, company registered in Spain. What language should my Privacy Policy, Terms and Cookie Policy be?", "link": "https://www.reddit.com/r/legaladvice/comments/gk4sbt/website_in_english_and_italian_company_registered/"}}
{"text": "I’m very new to reddit. So excuse me if I’ve posted in the wrong thread or broke the rules. (Kindly point me in the right direction if I broke the rules)\n\nI received a traffic ticket in November, just had my court date, and am curious to hear what you fellow redditor’s have to say about it. \n\nI live in Edmonton Alberta Canada and on November 7, the roads were absolutely treacherous and icy from a ...", "source_dataset": "hf_legal_reddit", "source_record_id": "em64dd", "full_text_length": 2083, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I got a red light ticket, what are my chances of winning this fight?", "link": "https://www.reddit.com/r/legaladvice/comments/em64dd/i_got_a_red_light_ticket_what_are_my_chances_of/"}}
{"text": "So I am trying to help a friend, but here is the jist of the situation. \n\nMichigan, (US)\nGrandmother has dementia, but she still have congnitive ability, knows that she is sick and she wants to go to the hospital. Is suffering from a High Fever, as well as her usual Demetia. She is mobile, goes to the bathroom by herself.  Etc. \n\nShe was bombarded by an Aunt few years prior, to sign a Power of Att...", "source_dataset": "hf_legal_reddit", "source_record_id": "510sqv", "full_text_length": 1186, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Grandmother Put in Hospice against, will forced to not receive medical treatment.", "link": "https://www.reddit.com/r/legaladvice/comments/510sqv/grandmother_put_in_hospice_against_will_forced_to/"}}
{"text": "I'm hoping for some advice/guidance on employment law in NJ. \n\nI'm a police dispatcher/911 operator but I work for a private company (not a municipality/not a union or state position). Due to being EXTREMELY understaffed for the past six months, we are currently working insane hours. We have 5 people covering 8-10 positions. \n\nOur normal shifts are 12 hours, 5 days one week and two the next. This ...", "source_dataset": "hf_legal_reddit", "source_record_id": "eez92x", "full_text_length": 2313, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "911 operator currently working crazy hours in New Jersey", "link": "https://www.reddit.com/r/legaladvice/comments/eez92x/911_operator_currently_working_crazy_hours_in_new/"}}
{"text": "(x-post from /r/gamedev) [UK] How to write a facebook privacy policy for a mobile game which accesses facebook?", "source_dataset": "hf_legal_reddit", "source_record_id": "2w7ezk", "full_text_length": 111, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(x-post from /r/gamedev) [UK] How to write a facebook privacy policy for a mobile game which accesses facebook?", "link": "https://www.reddit.com/r/legaladvice/comments/2w7ezk/xpost_from_rgamedev_uk_how_to_write_a_facebook/"}}
{"text": "I've made a mobile game for android and I have facebook integrated. So the player can log into facebook on the title page and it'll show their name and profile picture once they are logged in. Then when they finish a round, if they're logged in, it shows a leader board with their friends' scores with their names and profile images.\nFor the submission process on facebook it says I require a privacy...", "source_dataset": "hf_legal_reddit", "source_record_id": "2w7ezk", "full_text_length": 933, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(x-post from /r/gamedev) [UK] How to write a facebook privacy policy for a mobile game which accesses facebook?", "link": "https://www.reddit.com/r/legaladvice/comments/2w7ezk/xpost_from_rgamedev_uk_how_to_write_a_facebook/"}}
{"text": "Recently had my ATM card reissued due to it being lost. While waiting for my new card(which would have a new number), an automatic monthly payment did not go through (gym membership). A week later while still awaiting my new card, I received a bill for a missed payment that includes a \"late fee\" plus an additional \"$50\" \"service charge\". Obviously I find a service charge for that amount unacceptab...", "source_dataset": "hf_legal_reddit", "source_record_id": "2vfdkn", "full_text_length": 612, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[MA] If asked, is a billing company required to explain what a \"Service Charge\" is/explain its cost?", "link": "https://www.reddit.com/r/legaladvice/comments/2vfdkn/ma_if_asked_is_a_billing_company_required_to/"}}
{"text": "My GF is a US citizen, and a US resident. - Currently in Europe studying. She has an account with a Roth IRA. She had asked them to transfer her money to her bankaccount. They advised her to have her address changed in their system to my address in the Netherlands so they could send me a check. I complied. The check arrived and 30% was withheld and paid to the IRS, as a non res- alien tax. In maki...", "source_dataset": "hf_legal_reddit", "source_record_id": "2tys0n", "full_text_length": 810, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[US] [SC] IRA Roth paid IRS without my knowledge and/or consent after giving me advice that left that piece of information out.", "link": "https://www.reddit.com/r/legaladvice/comments/2tys0n/us_sc_ira_roth_paid_irs_without_my_knowledge/"}}
{"text": "I'm gonna be honest, I'm pretty scared right now. I met a girl on a dating app a while ago. I was hoping to set up plans for a date when she said something along the line of \"I want to show you something, but I am afraid you'll judge me for it.\" I asked what it was and she sent me nudes. I didn't ask for them, they were sent to me out of the blue.\n\nA day or two later I receive a text from what I a...", "source_dataset": "hf_legal_reddit", "source_record_id": "en47bp", "full_text_length": 1020, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[California] Person I met on a dating app claiming to be 20 on their profile sent me nudes out of the blue. Parents of the person take their phone and text me a day later, telling me they are a minor and are threatening to press charges.", "link": "https://www.reddit.com/r/legaladvice/comments/en47bp/california_person_i_met_on_a_dating_app_claiming/"}}
{"text": "Hi there-\n\nA friend approached my husband and me a little while ago asking if he could stay with us until he got back on his feet.  We agreed, and set some ground rules for him.  We never drew up an official contract because we were waiting until he had a job and could actually pay us rent.  Before that time came, he broke every single one of our ground rules.  After some discussion about the repe...", "source_dataset": "hf_legal_reddit", "source_record_id": "55diia", "full_text_length": 1624, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Virginia] Let a friend stay, had to kick him out, he left his stuff and went MIA. When is it abandoned?", "link": "https://www.reddit.com/r/legaladvice/comments/55diia/virginia_let_a_friend_stay_had_to_kick_him_out_he/"}}
{"text": "Hi everyone, I am originally from California so I know all about the tickets for having modified engines and exhaust systems, however I got stationed in Texas where I have a Mustang with intake mods and exhaust system (legal in Texas, illegal in California)\n\nI plan to visit my family and friends once this whole COVID is over, and since I’ll try and be there for 20+ days it’s cheaper to drive my ca...", "source_dataset": "hf_legal_reddit", "source_record_id": "gpzbvb", "full_text_length": 812, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Question about CA “modified” tickets when bringing a car for to visit", "link": "https://www.reddit.com/r/legaladvice/comments/gpzbvb/question_about_ca_modified_tickets_when_bringing/"}}
{"text": "I was recently cited for \"55 MPH in a 25 MPH zone\" in a small town in NJ. The citation carried a mandatory court appearance. I received no other citations when I was pulled over, but this case seems complicated to me. I will explain. \n\nThe incident: I had just purchased a new car less than one hour earlier, returned to an apartment that my wife and I rent in a small NJ town to show my wife and tak...", "source_dataset": "hf_legal_reddit", "source_record_id": "2udhyc", "full_text_length": 4386, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[NJ] Speeding ticket: 55 in 25 - need advice leading up to court/in court", "link": "https://www.reddit.com/r/legaladvice/comments/2udhyc/nj_speeding_ticket_55_in_25_need_advice_leading/"}}
{"text": "So, I’ve been looking for a job lately, and I received this email.  I have not had any interviews, and I get this offer.  Is this legit?\n\nPosition Overview:\n\nThis is a part/full-time professional position. You could start with part-time employment and continue into full-time, if you need the flexibility. This work-at-home position is responsible for generation of purchase orders using Company's mo...", "source_dataset": "hf_legal_reddit", "source_record_id": "7wapd4", "full_text_length": 6292, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Is this a scam? If so, who can I report to?", "link": "https://www.reddit.com/r/legaladvice/comments/7wapd4/is_this_a_scam_if_so_who_can_i_report_to/"}}
{"text": "Hey guys,  \n\nI'm part of a small start-up company in California. We purchased some equipment as a bundle that cost about $30k from another company located in California. It took us about a month to start using it because of switching offices and construction.  \nWhen we finally got it setup, we spent a week trying to get it to work. Then we called them up, they gave us the wrong software on our sys...", "source_dataset": "hf_legal_reddit", "source_record_id": "7xw40z", "full_text_length": 1257, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Failed expensive hardware, won't give a refund", "link": "https://www.reddit.com/r/legaladvice/comments/7xw40z/failed_expensive_hardware_wont_give_a_refund/"}}
{"text": "In December, 'Trisha' moved into my apartment. But Trisha's rabbit shat everywhere, and she refused to adequately clean up after it. We fought over this constantly, so exactly two weeks later she moved out. I want to emphasize that she moved out voluntarily, and I have text messages from her proving this, asking for prorated rent as an incentive to leave early. \n\nWhen she moved out, she stole almo...", "source_dataset": "hf_legal_reddit", "source_record_id": "7xz8x2", "full_text_length": 2692, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[VA] Libel/harrassment--exroommate trying to get me evicted", "link": "https://www.reddit.com/r/legaladvice/comments/7xz8x2/va_libelharrassmentexroommate_trying_to_get_me/"}}
{"text": "We are talking state of Michigan here. My friend caught her husband cheating and after a failed attempt at reconciliation they are now ending the marriage. He has cheated in the past too. He has had drug issues that have had him in court several times through the years and resulted in him losing his driving license. He also lives with his parents. He keeps threatening to take the kids and the hous...", "source_dataset": "hf_legal_reddit", "source_record_id": "2tzp9l", "full_text_length": 848, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Any advantage to being the first to file divorce papers?", "link": "https://www.reddit.com/r/legaladvice/comments/2tzp9l/any_advantage_to_being_the_first_to_file_divorce/"}}
{"text": "Hi everyone, \n\nI was wondering how far a company's privacy policy can protect you. If you perhaps break their TOS (terms of service), would that privacy policy also be voided due to you not abiding by the \"contract\" originally agreed to?", "source_dataset": "hf_legal_reddit", "source_record_id": "gd4u8c", "full_text_length": 237, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Relation between website TOS and Privacy Policy", "link": "https://www.reddit.com/r/legaladvice/comments/gd4u8c/relation_between_website_tos_and_privacy_policy/"}}
{"text": "I have been searching this sub off and on for months but have yet to read about a situation similar to the one my husband and I are currently in. We could really use some help. The simplest way to explain it is that his parents are horrible people. They are manipulative, selfish, and very emotionally abusive. My husband is still dealing with trauma from his childhood and he is now in his late thir...", "source_dataset": "hf_legal_reddit", "source_record_id": "gi3jkg", "full_text_length": 2391, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Trying to protect our children from their grandparents", "link": "https://www.reddit.com/r/legaladvice/comments/gi3jkg/trying_to_protect_our_children_from_their/"}}
{"text": "This is in Vermont, USA. \n\nTL;DR: Brother and a friend were cited for unlawful trespass, court date was set. Officer contacts them personally to say that the court date is no longer when it was originally scheduled for, and that he'd need to meet them in person to re-cite them and set a new court date. Is this allowed/normal/does this give them an option to challenge something about it? For furthe...", "source_dataset": "hf_legal_reddit", "source_record_id": "ebkg3j", "full_text_length": 4124, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Brother and a friend were cited for unlawful trespass and a court date was set. The citing officer then later contacted them before the court date to say it had moved, but that he would need to meet and re-cite them. Why would this be and what should he do?", "link": "https://www.reddit.com/r/legaladvice/comments/ebkg3j/brother_and_a_friend_were_cited_for_unlawful/"}}
{"text": "Regardless of the validity of our negative review, is it even possible for a seller to sue a buyer over a negative review?  This seems completely ridiculous to me, but they've threatened to send us a \"Legal Action Letter\".  It seems like an empty bully tactic to me - Etsy won't get involved because it is \"outside their system\" even though the seller got our address via the etsy system.  (We're in ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2vjeuz", "full_text_length": 548, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Threatened Legal Action over negative review on Etsy", "link": "https://www.reddit.com/r/legaladvice/comments/2vjeuz/threatened_legal_action_over_negative_review_on/"}}
{"text": "My husband forgot his ballot at home on election day so he asked me to drop it off when I took mine in. He hadn't signed the outer envelope so I did it for him. He received a letter from the District Attorney asking whether he had voted in the last election and if yes, why his signature didn't match the one they had on file. The options on the form are (check all that apply): 1) I personally signe...", "source_dataset": "hf_legal_reddit", "source_record_id": "gb7rve", "full_text_length": 1158, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can I be charged with forgery for signing my husband's ballot in the presidential primary election?", "link": "https://www.reddit.com/r/legaladvice/comments/gb7rve/can_i_be_charged_with_forgery_for_signing_my/"}}
{"text": "I (French) have scraped a long list of games from this [US] website: http://www.gamerankings.com/\n\nI needed this list to produce statistics about video-games (nothing related to the website). I've only kept the title of the games, nothing else (especially, NOT the review score in % ).\n\nThe final statistics won't even name a single game, but I need to be transparent about where and how I've gathere...", "source_dataset": "hf_legal_reddit", "source_record_id": "2xoyb4", "full_text_length": 665, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Scraping a website's database to produce statistics for research purpose: fair use? [USA/FRANCE]", "link": "https://www.reddit.com/r/legaladvice/comments/2xoyb4/scraping_a_websites_database_to_produce/"}}
{"text": "Let me start by saying that I'm very surprised by my employer's reaction and I like to believe that we still have good relations but it seems like it’s a good idea to get some advice because this morning, I've been hit with the Big Guns (shooting blanks for now).\n\nI needed a wee hobby project to get my head occupied with something I enjoyed. I've setup a decent website, sort of a social portal act...", "source_dataset": "hf_legal_reddit", "source_record_id": "2u4sxe", "full_text_length": 3824, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[UK - England/Scotland] I'm building a website somehow related to the business I'm employed by. I notified the employer and got threatened with legal action against my website and termination of employment.", "link": "https://www.reddit.com/r/legaladvice/comments/2u4sxe/uk_englandscotland_im_building_a_website_somehow/"}}
{"text": "Help! I’ll try to make this short and easy.\n\n(didn’t happen sorry)\n\nSo, my friend and I have been living at this apartment in Texas and we were aware of the 60 day notice if we plan on moving out. \n\nSo as once as we applied and got accepted for our new place we notified our current apartment manager via email saying: “Hello we found a new apartment and we are not renewing our lease here blah blah ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gv1z4h", "full_text_length": 2735, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "URGENT! Apartment management switch", "link": "https://www.reddit.com/r/legaladvice/comments/gv1z4h/urgent_apartment_management_switch/"}}
{"text": "Dick enters a contract with Jane, a famed portrait artist, to paint his portrait for a price of $2000, of which Dick has paid $500 in advance. The cost of Jane's materials and painting time is $1800 and Dick values the proposed portrait at $3000. Dick also takes two days off work for his sitting and, as a result, loses $400 ($200 per day) in wages. Jane completes the painting on a Friday and calls...", "source_dataset": "hf_legal_reddit", "source_record_id": "2whuys", "full_text_length": 1766, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Contract] Am I calculating this correctly? Yes, this is a homework question.", "link": "https://www.reddit.com/r/legaladvice/comments/2whuys/contract_am_i_calculating_this_correctly_yes_this/"}}
{"text": "I ordered an item at a discount from a large online and bricks &amp; mortar retailer. The retailer processed the order, then canceled it a few days later. They said the item was “out of stock” so they had to cancel.  I asked if they would honor that sale price once the item was back in stock and the customer service rep said they would, and he confirmed as much in an email, somewhat oddly worded a...", "source_dataset": "hf_legal_reddit", "source_record_id": "gthjfa", "full_text_length": 1629, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Does a company legally have to deliver an item to you at the price they actually sell the item for, and after canceling that order, confirm in writing they will honor as a raincheck price?", "link": "https://www.reddit.com/r/legaladvice/comments/gthjfa/does_a_company_legally_have_to_deliver_an_item_to/"}}
{"text": "I apologize for the wall of text but there's some details to this one. We rent a single bathroom unit in Virginia and our only toilet is stopped. Water drains slowly and it won't fully flush, and we can't unclog it with a plunger, despite trying for upwards of 20 minutes. The last thing we had flushed was some toilet paper. Thin stuff, none of that ultra plush super quilted stuff. We sent our prop...", "source_dataset": "hf_legal_reddit", "source_record_id": "eg12fq", "full_text_length": 1486, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Who is responsible for a stopped toilet in a single bathroom unit? (VA)", "link": "https://www.reddit.com/r/legaladvice/comments/eg12fq/who_is_responsible_for_a_stopped_toilet_in_a/"}}
{"text": "Hello! I am an activist in Florida and am thinking of various campaigns I could do on my college campus and one such issues I could think of is how campus police are called automatically for suspicion of drug possession or underage drinking. I don’t think police should be introduced to a student space in such a cavalier fashion, especially not residence areas. But I understand that the school may ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gusv6y", "full_text_length": 729, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Are universities (specifically Florida) obligated by law somehow to get the police involved in minor drug possession on campus?", "link": "https://www.reddit.com/r/legaladvice/comments/gusv6y/are_universities_specifically_florida_obligated/"}}
{"text": "I'm basically the gatekeeper for a small business where I read novels and either push them ahead for development or pass on them.  I just read one and wanted to know some more information regarding how the legal system actually works to contrast with the story before I make my decision.  For the record (the bot told me too) I live in New York City, but the story in question never identifies the lo...", "source_dataset": "hf_legal_reddit", "source_record_id": "2ikeq8", "full_text_length": 1155, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Background for a story (I'm the editor, not the writer) regarding child abuse and the legal system", "link": "https://www.reddit.com/r/legaladvice/comments/2ikeq8/background_for_a_story_im_the_editor_not_the/"}}
{"text": "Okay, I'm going to try to explain everything and not be a mess. I'll try to answer questions quickly. \n\nMy father is still mentally sound. He is however, beginning to forget things (some whole days) and getting lost. In his household, there is him, his girlfriend (who is disabled and very sick herself), her adult kids and her 2 nieces (it was their house or foster care, so they took them in).\n\nHe ...", "source_dataset": "hf_legal_reddit", "source_record_id": "52bqjc", "full_text_length": 1214, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(NC) How to handle an aging parent (early dementia) legally.", "link": "https://www.reddit.com/r/legaladvice/comments/52bqjc/nc_how_to_handle_an_aging_parent_early_dementia/"}}
{"text": "Hi all.\n\nThis is a throwaway account and a long post. Please bear with me, I really need help. I am in Australia / NZ. I (M) initiated the separation from my wife.\n\nGoing through care arrangement and property settlement post-divorce (it was finalised this year). I have a new partner and we live together. \n\nA little background...  \nWe had 50/50 shared care of the boys (that was progressed to from a...", "source_dataset": "hf_legal_reddit", "source_record_id": "e92w6r", "full_text_length": 7113, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I am being kept from seeing my kids", "link": "https://www.reddit.com/r/legaladvice/comments/e92w6r/i_am_being_kept_from_seeing_my_kids/"}}
{"text": "My wife and I own a business with a business partner and we are based in Adelaide, Australia. Its a partnership and I am aware that this means that we have 100% liability for all debts that the business incurs.\nWe made the decision at the start of this month that we would wind the business down due to the toxic working relationship. It looks like we may have to break the lease agreement on our ren...", "source_dataset": "hf_legal_reddit", "source_record_id": "507zd3", "full_text_length": 1048, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My business partner has disappeared, am I 100% liable?", "link": "https://www.reddit.com/r/legaladvice/comments/507zd3/my_business_partner_has_disappeared_am_i_100/"}}
{"text": "Apologies in advance if this isn't the right subreddit. Throwaway for obvious reasons. I'm in the U.S.\n\nI manage, among other things, the web filter at our organization. We've never had any legal issues until the instance in question, past issues were purely HR related.\n\nIn August of 2014, I found a mid level manager, at an out of state location, to have accessed child porn and research on cities ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2xtuz1", "full_text_length": 2164, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Caught an employee with childporn, not sure if employer reported to police. What to do?", "link": "https://www.reddit.com/r/legaladvice/comments/2xtuz1/caught_an_employee_with_childporn_not_sure_if/"}}
{"text": "(IL) My bf/fiance was killed by a hit-and-run driver. The whole system seems determined to let his killer walk. Is there anything I can do?", "source_dataset": "hf_legal_reddit", "source_record_id": "2u9kjr", "full_text_length": 139, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(IL) My bf/fiance was killed by a hit-and-run driver. The whole system seems determined to let his killer walk. Is there anything I can do?", "link": "https://www.reddit.com/r/legaladvice/comments/2u9kjr/il_my_bffiance_was_killed_by_a_hitandrun_driver/"}}
{"text": "State: North Carolina\n\nI (23) am in a “student housing” off campus facility. The reason I say “student housing” is because they lease primarily to students but because of the poor reputation and distance to the university they rent to non-students as well (my roommates and I are all non-students).  All of these rooms have individual leases.\n\nIn early October M (35+?) as I’m going to call her, move...", "source_dataset": "hf_legal_reddit", "source_record_id": "eedo03", "full_text_length": 3807, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Why won’t my apartment complex evict a roommate who has violated the lease multiple times despite me and my other roommate reporting it repeatedly? Can I terminate my lease without penalty?", "link": "https://www.reddit.com/r/legaladvice/comments/eedo03/why_wont_my_apartment_complex_evict_a_roommate/"}}
{"text": "I am currently renting an apartment, I had a lease for the first year and went month to month afterwards. I paid first month, last month, and security deposit when I first signed the lease. The rent is due on the first of the month and I have always paid early through automatic bill pay setup with my bank so that the check gets there by the 25th of the month.\n\nI gave my landlord verbal notice on t...", "source_dataset": "hf_legal_reddit", "source_record_id": "2jpa2u", "full_text_length": 1389, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "NYS - Notice for ending ocupancy on a month to month lease", "link": "https://www.reddit.com/r/legaladvice/comments/2jpa2u/nys_notice_for_ending_ocupancy_on_a_month_to/"}}
{"text": "I recently had to take a polygraph test for pre-employment. Understandably, I was nervous.  I do not have a criminal record, I have never taken  taken a polygraph before. I did not google information about manipulating the test nor do I know or converse with polygraph examiners. I knew they would ask typical questions, I did not have an issue answering any of them. \n\nI aced the examination. My int...", "source_dataset": "hf_legal_reddit", "source_record_id": "bc7ahn", "full_text_length": 1069, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Not hired after an inconclusive polygraph.", "link": "https://www.reddit.com/r/legaladvice/comments/bc7ahn/not_hired_after_an_inconclusive_polygraph/"}}
{"text": "Ok, so this might be a little long. \n\nAbout a year ago my best friend and I shared an apartment. In the past this friend had drug issues but profused to me he was clean. Well, fast forward a few months later, I meet the love of my life. She moved in with us as well. I was so excited for my best friend and now wife to get to know each other. I wanted her to know why this person was my best friend o...", "source_dataset": "hf_legal_reddit", "source_record_id": "giyfft", "full_text_length": 4199, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Best friend dies of a heroin overdose and I am left in debt over rent they did not pay. Anything I can do? (MD)", "link": "https://www.reddit.com/r/legaladvice/comments/giyfft/best_friend_dies_of_a_heroin_overdose_and_i_am/"}}
{"text": "Hi Everyone,\n\n&amp;#x200B;\n\nAfter several years, the DoE has finally contacted me with a resolution to my borrow defense application. They denied my application and the results are below. I attended Heald College between 2007-2008. They are apart of the Corinthian Colleges lawsuit that bankrupted them a few years ago. Lots of students had their loans forgiven if they attended after 2010, but not b...", "source_dataset": "hf_legal_reddit", "source_record_id": "gma4lv", "full_text_length": 6864, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "U.S. Department of Education denied my borrower defense application (student loan forgiveness)", "link": "https://www.reddit.com/r/legaladvice/comments/gma4lv/us_department_of_education_denied_my_borrower/"}}
{"text": "I feel like I shouldn't have to ask this but my lawyer seems to never really give me the low down on things. \n\n22 months ago I was in a car accident that was no good. Never once has my lawyer told me how long things will take or how much to expect although he is constantly telling me that I can get loans etc  that he can set me up with which I honestly don't need nor have asked about. \n\nHe says th...", "source_dataset": "hf_legal_reddit", "source_record_id": "gopu6r", "full_text_length": 874, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "What is my lawyer doing?", "link": "https://www.reddit.com/r/legaladvice/comments/gopu6r/what_is_my_lawyer_doing/"}}
{"text": "Background: my sister has been homeschooling her 9-year-old son for the past 3 years. A few months ago, her ex filed for custody because he thought the kid should be in school, or maybe just to torture my sister, who knows. At first, my family treated it as an annoyance, thinking there's no way the court would take my nephew out of a good home just because he was homeschooled; and especially becau...", "source_dataset": "hf_legal_reddit", "source_record_id": "2l9o8z", "full_text_length": 2578, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Perplexing happenings in my sister's custody fight (Ontario)", "link": "https://www.reddit.com/r/legaladvice/comments/2l9o8z/perplexing_happenings_in_my_sisters_custody_fight/"}}
{"text": " Recently for Black Friday I ordered a custom-pc from CyberPowerPC and was supposed to have it delivered to apartment on Dec. 23rd. The UPS driver that was brought instead of coming up to the apartments to deliver/get my signature (which was required by the sender and if they did not receive they would have to continue trying to redeliver it 2 more times) decided to take the package to our package...", "source_dataset": "hf_legal_reddit", "source_record_id": "ejziv9", "full_text_length": 2954, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Stolen Custom-Build PC from our apartment", "link": "https://www.reddit.com/r/legaladvice/comments/ejziv9/stolen_custombuild_pc_from_our_apartment/"}}
{"text": "We’ve had plenty of fights before but he is hitting me with everything he can to destroy me financially and take the kids away. Losing my children is not an option. I have only a few days until the temporary custody hearing, no way to pay for an attorney, and am currently trying to unfuck my life. \n\nSome quick basic info of my situation: \nI haven’t worked for 9 years, but managed to get a part tim...", "source_dataset": "hf_legal_reddit", "source_record_id": "e6u0qc", "full_text_length": 3191, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[NC] My abusive husband filed ex parte after I took our children out of state on open-ended visit with family.", "link": "https://www.reddit.com/r/legaladvice/comments/e6u0qc/nc_my_abusive_husband_filed_ex_parte_after_i_took/"}}
{"text": "So, Lets see if i can explain this. I am currently dating a girl who has a child. we've been together for 3 years now. Her child is 4. Her \"baby daddy\" left the state when the child was born. Prior to his birth he was involved in an accident. He was working for his own father, when he injured himself. He almost died, and was in a coma. Fast forward to today. He (baby daddy) lives in California wit...", "source_dataset": "hf_legal_reddit", "source_record_id": "2gp4z7", "full_text_length": 2165, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Baby Daddy Wha?", "link": "https://www.reddit.com/r/legaladvice/comments/2gp4z7/baby_daddy_wha/"}}
{"text": "Throwaway account, sorry I’m on mobile, tl;dr at the end.\n\nMy husband (fake name Joe) and I have been together for nine years, married for two. We have three kids together and he has a son (fake  name Greg) from a previous marriage who’s 11. My husband’s ex (fake name Janice) had always had mental health issues but after she gave birth to Greg, she suffered terrible PPD and it triggered a psychoti...", "source_dataset": "hf_legal_reddit", "source_record_id": "en1dzv", "full_text_length": 6168, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Tired of being taken to court for custody from a severely mentally-ill mom who isn’t a fit parent.", "link": "https://www.reddit.com/r/legaladvice/comments/en1dzv/tired_of_being_taken_to_court_for_custody_from_a/"}}
{"text": "Hello,\n\nInquiry about whether or not I should seek legal counsel following events that occurred at an high school teaching internship placement while studying for a Masters in Education. TLDR at end. \n\nOver 2019-2020 school year, I interned at a reputable high school with a mentor teacher. During the internship, I conducted lesson planning, instruction, assessments, and reflections, etc. On multip...", "source_dataset": "hf_legal_reddit", "source_record_id": "gsdczt", "full_text_length": 11078, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "College internship", "link": "https://www.reddit.com/r/legaladvice/comments/gsdczt/college_internship/"}}
{"text": "(I live in Texas, outside of Houston, if that information is necessary)\n\nAt first I thought maybe it was a mistake but the more I talk to the owner of the restaurant I work at and my coworkers the more fishy this seems. I can provide screenshots if needed.\n\nOkay, so this past week my employer changed our payment schedule to where instead of getting paid that week for the week we had just worked we...", "source_dataset": "hf_legal_reddit", "source_record_id": "gkbvc8", "full_text_length": 3453, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I think my employer is stealing from everyone?? Should I contact a lawyer? (PLEASE HELP ME)", "link": "https://www.reddit.com/r/legaladvice/comments/gkbvc8/i_think_my_employer_is_stealing_from_everyone/"}}
{"text": "I had a very tough spot where I fell terribly behind on my rent last year while I waited to my disability decision. Things went in my favor, got a bunch of backpay, rent got caught up.\n\nHowever, I keep getting notices every other month from my landlord saying she is missing X payment from X month. I send her the receipt to show that month was payed. She still insist that I am missing a payment but...", "source_dataset": "hf_legal_reddit", "source_record_id": "2tvyzd", "full_text_length": 1530, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Hawaii] Landlord keeps saying I owe her back rent. Wants to see my bank statements to prove payments was processed.", "link": "https://www.reddit.com/r/legaladvice/comments/2tvyzd/hawaii_landlord_keeps_saying_i_owe_her_back_rent/"}}
{"text": "hey r/legaladvice, I posted last night about how I received a parking ticket while parked in a handicap spot even though I had a handicap permit. The ticket was issued by the University I attend, who was given authorization via state code to enforce parking regulation on their behalf to cut down on time that could have been spent elsewhere. \n\nA little update that is going on and what I am attempti...", "source_dataset": "hf_legal_reddit", "source_record_id": "2td85v", "full_text_length": 5889, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Help understanding State Code and Administrative Code", "link": "https://www.reddit.com/r/legaladvice/comments/2td85v/help_understanding_state_code_and_administrative/"}}
{"text": "This is my first time posting on this sub reddit so if I am breaking any rules or am not posting in the right place I am sorry.\n\nAnyway so I decided to book a house in Myrtle Beach for a vacation in June. All was well till the Corona Virus hit this year as we all know. Not sure how bad things were going to be I decided to cancel my reservation in April all things considered I knew I wouldn't recei...", "source_dataset": "hf_legal_reddit", "source_record_id": "gjuoze", "full_text_length": 2208, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Airbnb Refund &amp; Corona Virus", "link": "https://www.reddit.com/r/legaladvice/comments/gjuoze/airbnb_refund_corona_virus/"}}
{"text": "Looking for any insight. Started a new job, with a growing company.  I interviewed and recieved my job offer at their original offices and started training at their new site. The new site was still under construction and procedures not yet solidified.  At the original location if an employee forgets thier badge they are issued a temporary badge for the day. Due to the new site being setup there wa...", "source_dataset": "hf_legal_reddit", "source_record_id": "7wa03s", "full_text_length": 1141, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Payroll Deduction.", "link": "https://www.reddit.com/r/legaladvice/comments/7wa03s/payroll_deduction/"}}
{"text": "A friend of mine tried taking her life a few months ago at our college. It’s a college in New York. Realizing she didn’t want to go through with it, she contacted a friend who took her to the hospital where she stayed inpatient for about a week or two. After being released she returned to school and saw a counselor on campus who cleared her and told her that she was well enough to return to classe...", "source_dataset": "hf_legal_reddit", "source_record_id": "gnmi7i", "full_text_length": 1506, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Dismissed from College after suicide attempt", "link": "https://www.reddit.com/r/legaladvice/comments/gnmi7i/dismissed_from_college_after_suicide_attempt/"}}
{"text": "So this might somewhat of a lawyer question but I am going over my will. I’m trying to decide on stuff such as how I want my body handled when I pass and where my ashes should be scattered, along with just having a support system for any loved ones that show up to my funeral. My question to anyone who has done their wills (and especially lawyers who have expertise in this area): What are some very...", "source_dataset": "hf_legal_reddit", "source_record_id": "ehiw5w", "full_text_length": 545, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Editing my Living Will", "link": "https://www.reddit.com/r/legaladvice/comments/ehiw5w/editing_my_living_will/"}}
{"text": "All names have been changed so that this is consistent but parties involved can't be identified.\n\nMy sister, Lisa, may have been wrongfully terminated in California, an at-will state. We can't afford a lawyer just to check if we may or may not have a case so this seemed like the best place to get advice. She'll be applying for unemployment, of course, and contacting the labor board. She's been wit...", "source_dataset": "hf_legal_reddit", "source_record_id": "bdkcqb", "full_text_length": 7682, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Could my sister have been wrongfully terminated in an at-will state?", "link": "https://www.reddit.com/r/legaladvice/comments/bdkcqb/could_my_sister_have_been_wrongfully_terminated/"}}
{"text": "Short of the long: came home one night in October to find that somehow my kitchen sink was turned on (it was absolutely 100% off when I left earlier in the evening) and it flooded my apartment and the two units below mine. I have two dogs. A neighbor on my floor was able to get into my apartment saying it was unlocked so she could turn the sink off. Maintenance people ripped up all the flooring an...", "source_dataset": "hf_legal_reddit", "source_record_id": "gl9jd3", "full_text_length": 1761, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Property company reopened flood claim from six months ago (MA)", "link": "https://www.reddit.com/r/legaladvice/comments/gl9jd3/property_company_reopened_flood_claim_from_six/"}}
{"text": "tldr: I was terminated from a job about a month ago but just received notice that I was only laid off, and that they want me to return a signed document saying as much without any promise of scheduled hours and waiving my ability to collect UI benefits. I'm concerned they won't actually give me any hours; would I have had to sign anything before being terminated, and/or can I request some document...", "source_dataset": "hf_legal_reddit", "source_record_id": "gbsuk8", "full_text_length": 2239, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(CA) Am I able to request documentation of my being terminated from a former employer?", "link": "https://www.reddit.com/r/legaladvice/comments/gbsuk8/ca_am_i_able_to_request_documentation_of_my_being/"}}
{"text": "Hello! My name is not Miruna (this is a friends throwaway account so I begged her to give it to me to make this post lol). I'm a teenage girl going through a rough time, so I decided to spill my feelings on Reddit because why not? I saw some compilation on YouTube with this subreddit and I decided to make my own post since my mother and I need some advice. I never thought I'll be posting here but ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gic4js", "full_text_length": 9960, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My dad admits to have a program where he can spy on us, then he pretends to be somebody else and talk to my mom and then managed to told us that he didn't have any program and managed to lie saying that my mother admitted everything.", "link": "https://www.reddit.com/r/legaladvice/comments/gic4js/my_dad_admits_to_have_a_program_where_he_can_spy/"}}
{"text": "Friend downloaded a big pack of hentai with mostly non questionable hentai of videogame characters and stuff but there was some questionable stuff in there. Friend left auto upload on and it uploaded friend knows google has a policy against that stuff  and deleted it but wonders if Google's algorithm already detected it and report him to aurhorities. Sat in photos for a month or so before he notic...", "source_dataset": "hf_legal_reddit", "source_record_id": "e92zlr", "full_text_length": 417, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Friend accidentally uploaded loli hentai", "link": "https://www.reddit.com/r/legaladvice/comments/e92zlr/friend_accidentally_uploaded_loli_hentai/"}}
{"text": "About a month ago, I was driving through a crowded park in Oregon, keeping up with traffic when I was suddenly pulled over by a truck with flashing lights. The deputy claimed his reasons for pulling me over were that I was speeding and that I was looking down at my cell phone, a violation of ORS 807.511. \n\nAs far as speeding goes, it's important to understand that he never got me on radar. He had ...", "source_dataset": "hf_legal_reddit", "source_record_id": "53l239", "full_text_length": 3341, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(OR) Wondering if I can take an obnoxious small-town cop to court over an illegitimate traffic stop.", "link": "https://www.reddit.com/r/legaladvice/comments/53l239/or_wondering_if_i_can_take_an_obnoxious_smalltown/"}}
{"text": "[Here's the gist of it, showing the official rules and the responses I got after I won.](https://i.imgur.com/OIsmym4.jpg) \n \nSince I'm sure you guys aren't players of the Pokemon Trading Card Game, I will explain. \n \nIn this contest, some of the instant win prizes were related to the newly released card set, titled Primal Clash. It isn't directly referred to as \"Team Magma vs. Team Aqua\", but that...", "source_dataset": "hf_legal_reddit", "source_record_id": "2xs7c0", "full_text_length": 3083, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Florida] I won a contest, and the official rules state prizes in plural, but apparently I only won one of the prize. There's also a lot of weird wording in general that I'd like for someone to look at.", "link": "https://www.reddit.com/r/legaladvice/comments/2xs7c0/florida_i_won_a_contest_and_the_official_rules/"}}
{"text": "My farther served a full life and retired out of the Marine Corps. He was never there personally, financially, emotionally, or otherwise for my siblings or our mother.  The last few years my father fell ill.  He remarried.  He passed.  Now it looks like any veterans honors, decisions, and pensions go to this Joannie-come-lately; along with all power of choice on how and where to honor his remains....", "source_dataset": "hf_legal_reddit", "source_record_id": "gcy6bn", "full_text_length": 500, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My hero died and I still don’t know him", "link": "https://www.reddit.com/r/legaladvice/comments/gcy6bn/my_hero_died_and_i_still_dont_know_him/"}}
{"text": "I'm sorry for the long post, it's a long situation.\n\nI'm not the owner of our company but I'm HR/Billing/Office Manager (small business of less than 10 employees) so I've come to ask some advice for this situation.\n\nI left for another job two years ago, after being the secretary for 4 years. I trained my replacement and departed. She did well for about 1.5 of those two years. Roughly 6-8 months ag...", "source_dataset": "hf_legal_reddit", "source_record_id": "gl1j2t", "full_text_length": 5682, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Employee \"quit\" but wants to come back. (Texas, USA)", "link": "https://www.reddit.com/r/legaladvice/comments/gl1j2t/employee_quit_but_wants_to_come_back_texas_usa/"}}
{"text": "So my school, in NY, recently told us we cant use classdojo, an online behavior management system, in our classes because we do not own the student's data.  I found a new online system I would like to try out called Class Charts.  \n  \nI'll start off by saying that I DO NOT have permission from any parents to use this with their child's information.  However, I did not register under my schools nam...", "source_dataset": "hf_legal_reddit", "source_record_id": "2sd029", "full_text_length": 922, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I'm a teacher and want to use an online resource, but I'm not sure if I'm allowed based on the terms of service.", "link": "https://www.reddit.com/r/legaladvice/comments/2sd029/im_a_teacher_and_want_to_use_an_online_resource/"}}
{"text": "Alright, so I have a problem. I am a beneficiary of a trust fund in which I am due to receive funds at age 21 (if still in school) or 35 (if not in school). I attended college for a year just out of high school, and during that time funds from the trust were given to me for college and other expenses. Also during this time, the trustee of the fund purchased a car for me with money from the trust. ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2rdsdf", "full_text_length": 2194, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Seeking advice about something purchased with trust fund money (CA)", "link": "https://www.reddit.com/r/legaladvice/comments/2rdsdf/seeking_advice_about_something_purchased_with/"}}
{"text": "This is a public university in Michigan. \n\nA class for the upcoming summer semester is requiring that I install the Respondus Lockdown Browser to take exams. I researched the data that the browser collects and it is horribly invasive. The entire privacy policy can be viewed [HERE](https://web.respondus.com/privacy/privacy-additional-monitor/), but these points caught my eye the most:\n\n* The browse...", "source_dataset": "hf_legal_reddit", "source_record_id": "gba0ct", "full_text_length": 2580, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Public university is requiring invasive computer software to be installed.", "link": "https://www.reddit.com/r/legaladvice/comments/gba0ct/public_university_is_requiring_invasive_computer/"}}
{"text": "I'm try to get some orthognathic (jaw) surgery, and have been working with the orthodontist and surgeon getting ready. The surgery department made my initial insurance request. It came back negative, but the surgeons said that usually how it goes, and that they'll appeal it for me.\n\nI just got a call from the surgery department saying that they can't appeal it because, in the appeal paperwork, the...", "source_dataset": "hf_legal_reddit", "source_record_id": "2w7fnh", "full_text_length": 900, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(Ann Arbor, MI) Odd phrasing in health insurance appeal", "link": "https://www.reddit.com/r/legaladvice/comments/2w7fnh/ann_arbor_mi_odd_phrasing_in_health_insurance/"}}
{"text": "Need advice (26f). Car dealership is ruining my life.\n\nPlease help me or tell me if wrong and lead me right direction before you read further. I am not the type of person who ever wants to make things up about an experience to get anything for benefit. I’m not someone who even would leave a bad review or ask a manager unless experience inexcusable. Please keep in mind. Before you read. Whether in ...", "source_dataset": "hf_legal_reddit", "source_record_id": "ggw4w7", "full_text_length": 6362, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Need advice. Car dealership has made bad situation worse", "link": "https://www.reddit.com/r/legaladvice/comments/ggw4w7/need_advice_car_dealership_has_made_bad_situation/"}}
{"text": "So my wife is a nurse in a hospital system. They recently implemented a policy that states in order for her to take PTO on a weekend (they're required to work every other weekend) she needs to find a coworker to cover for her. This is REGUARDLESS of how far in advance she schedules that PTO (even if it's before the official shift schedule is released). Is this allowed? I feel like PTO should be at...", "source_dataset": "hf_legal_reddit", "source_record_id": "egifzj", "full_text_length": 614, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Nursing PTO", "link": "https://www.reddit.com/r/legaladvice/comments/egifzj/nursing_pto/"}}
{"text": "My 90 days is next month. My work insists that they pay their premium 1 month in advance. And so i had to have benefits selected prior to the end of the second pay period this month. And that they needed to collect my deductibles now. I have been locked out of the benefits election website since before the deadline. And have tried to use the automated system several times. I received a letter that...", "source_dataset": "hf_legal_reddit", "source_record_id": "7pw45l", "full_text_length": 1197, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "MI Work refusing my insurance coverage", "link": "https://www.reddit.com/r/legaladvice/comments/7pw45l/mi_work_refusing_my_insurance_coverage/"}}
{"text": "So I made a dumb decisions and bought some shorts that were on sale for 0 dollars. I bought a pair of shorts and added two others to the sale and the sale finalized without giving me a review of the order and charged me 15 dollars for shipping on each pair of shorts. It’s been over two months and only received one pair. I have been trying to contact them and only get responses directing me elsewhe...", "source_dataset": "hf_legal_reddit", "source_record_id": "gsaumi", "full_text_length": 704, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "What can I do if I bought shorts that cost 0 dollars with expensive shipping and I never received the shorts.", "link": "https://www.reddit.com/r/legaladvice/comments/gsaumi/what_can_i_do_if_i_bought_shorts_that_cost_0/"}}
{"text": "I received a ticket for expired registration. On the last day the ticket was due I brought proof of registration to the court house and paid the ticket. A week later I received a notice that there was a clerical error and that I had been undercharged for the ticket. The notice said I would need to call and pay the remainder. I called the number on the notice and my only option was to schedule a co...", "source_dataset": "hf_legal_reddit", "source_record_id": "2so38n", "full_text_length": 733, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "LA County Court undercharged me for fix-it ticket. Forced to pay $250 in court. Can I appeal?", "link": "https://www.reddit.com/r/legaladvice/comments/2so38n/la_county_court_undercharged_me_for_fixit_ticket/"}}
{"text": "I attended a gym that had a construction company remodel the locker rooms / bathrooms, but did so improperly with no ventilation systems, dust containment, etc. The showers and toilets were dug up into huge piles of dirt inside. It smelled like sewage, and I freaked out because I am a leukemia survivor with no functional immune system. I am extremely cautious as it is a gym to begin with but joine...", "source_dataset": "hf_legal_reddit", "source_record_id": "826zgn", "full_text_length": 1396, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "How long does Insurance Company have to fulfill claim - NY", "link": "https://www.reddit.com/r/legaladvice/comments/826zgn/how_long_does_insurance_company_have_to_fulfill/"}}
{"text": "This is my first time in this community and posting so I apologize if I make any errors in formatting or anything. I am simply seeking advice on what first steps I should take in order to protect me and my kids. As the title says, my husband has been cheating on me. I have text messages to prove it that I saved on my phone. I have a son who will be 3 in March and another baby due early April. I ha...", "source_dataset": "hf_legal_reddit", "source_record_id": "eb7uuw", "full_text_length": 2221, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Just found out my husband has been cheating on me for a while. I have a 2 year old and am pregnant. What should my first steps be? I live in Nevada.", "link": "https://www.reddit.com/r/legaladvice/comments/eb7uuw/just_found_out_my_husband_has_been_cheating_on_me/"}}
{"text": "I received a ticket for running a red light on 3/29 that had a due date of 4/10. On 4/10, I tried to pay the ticket on the state’s online ticket portal, but the site told me that my ticket could not be found. I tried calling that day, but due to the fact that it was Good Friday and COVID-19, the office was closed, and has been closed since. I sent an e-mail since the automated voicemail said quest...", "source_dataset": "hf_legal_reddit", "source_record_id": "gm288g", "full_text_length": 896, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Past Due Traffic Ticket", "link": "https://www.reddit.com/r/legaladvice/comments/gm288g/past_due_traffic_ticket/"}}
{"text": "Hello Legal Advice, I understand that this does not establish any lawyer / client privilege and should be taken as a guide to talk to a local lawyer / attorney. \n\nA few days ago I was in a doctors office and was told by a lady who ran into the office that someone had hit a car matching my cars description and fled. Upon going outside his car was gone from the parking lot and I called 911 with an a...", "source_dataset": "hf_legal_reddit", "source_record_id": "7xkwd9", "full_text_length": 1673, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[USA-TX] Driver hits my parked car and attempted to flee.", "link": "https://www.reddit.com/r/legaladvice/comments/7xkwd9/usatx_driver_hits_my_parked_car_and_attempted_to/"}}
{"text": "So get this\nLast week I quit my job and accidentally leave with my key because it was the heat of the moment. I wait a few days with no word from my old employer , I text them and say “ I’m coming in with the key and everything to retrieve my final check “\nEverything’s fine, I get my check, hand back the key, my boss who’s refuses to pay overtime hours but still had me work overtime scolds me but ...", "source_dataset": "hf_legal_reddit", "source_record_id": "egvk5m", "full_text_length": 1379, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Should I report my former boss", "link": "https://www.reddit.com/r/legaladvice/comments/egvk5m/should_i_report_my_former_boss/"}}
{"text": "State: Vermont.  Players: Me, Live-in GF, Ex, 3 Kids (14,12,8)\n\nFacts of Divorce: Separated in Jan 2016, divorce finalized in Feb 2017.  Divorce done without lawyers, wrote own divorce agreement approved by court -  50/50 custody in all things, no alimony / child support.  We alternate weeks with the kids.  Lived in own apartment until Oct 2017, when moved in with GF because was laid off from job ...", "source_dataset": "hf_legal_reddit", "source_record_id": "e9ic93", "full_text_length": 4553, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Ex Wants to Change Physical Custody Agreement", "link": "https://www.reddit.com/r/legaladvice/comments/e9ic93/ex_wants_to_change_physical_custody_agreement/"}}
{"text": "Edit:\nFirst page of contract showing we agreed to all 3 ballrooms\nhttp://m.imgur.com/CmJjTDm\n\nEdit 2: We are going to meet with the woman tomorrow after I get off and I have spoken to her 2x on the phone and recorded (Texas = 1 party state) her stating that \"fees change\" and we either take it or leave it. Along with her saying not be to be \"dumb because we are a business and this is a business dea...", "source_dataset": "hf_legal_reddit", "source_record_id": "52gq9d", "full_text_length": 3215, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[TX] Wedding venue is tripling hourly cost on us almost 1 month before the wedding.", "link": "https://www.reddit.com/r/legaladvice/comments/52gq9d/tx_wedding_venue_is_tripling_hourly_cost_on_us/"}}
{"text": "I have a situation that I don't know how to handle regarding my current (retail) employer. (Also my apologies in advance for mobile formatting)\n\nTL,DR: I got my manager fired and then got thrown under the bus by his temporary replacement, my district manager knew and punished me anyways. I was made to do work I wasn't trained to do and my pleas for training for them were denied. While doing this w...", "source_dataset": "hf_legal_reddit", "source_record_id": "7vyex0", "full_text_length": 10365, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[OK] Retaliation resulting in a 6 week+ unpaid suspension?", "link": "https://www.reddit.com/r/legaladvice/comments/7vyex0/ok_retaliation_resulting_in_a_6_week_unpaid/"}}
{"text": "My grandfather passed away in 2008 leaving me ~$200K to be distributed in $20K parcels over years--I was his only relation.  The executor of his estate is a retired accountant friend of his last few years, who will be the trustee.  I'm noticing for the first time on this 1041 form that the box \"If the decedent's estate has been open for more than 2 years\" is checked, however no explanation has bee...", "source_dataset": "hf_legal_reddit", "source_record_id": "2tt4db", "full_text_length": 1077, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "TX: sole beneficiary of estate/trust here, asking why executor/trustee has left estate open?", "link": "https://www.reddit.com/r/legaladvice/comments/2tt4db/tx_sole_beneficiary_of_estatetrust_here_asking/"}}
{"text": "Is this something that a lawyer could actually help with? Please help! This post is concerning events that have happened with my local State Farm Insurance Agency from the months of April 2017- to Present. This has put so much stress on me, as a single mother, and an honest, hardworking, bill paying American. \nIn April of 2017, my husband and I separated. I called state farm and spoke with an empl...", "source_dataset": "hf_legal_reddit", "source_record_id": "7sfmeb", "full_text_length": 4556, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "STATE FARM SCREW-OVER Is this worth my time, to pursue a lawyer?", "link": "https://www.reddit.com/r/legaladvice/comments/7sfmeb/state_farm_screwover_is_this_worth_my_time_to/"}}
{"text": "An employee working in the accounting dept was recently considered for a payroll position at a company I work for. Part of the reason he was not ultimately chosen was due to him owning a company on the side that does income and corporate tax preparation. Some of his clients are also working for the same company that he does. I've had a hard time explaining why this is a big deal. I am hoping that ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2sl0fg", "full_text_length": 654, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Conflict of interest at work and possible consequences (Ontario)", "link": "https://www.reddit.com/r/legaladvice/comments/2sl0fg/conflict_of_interest_at_work_and_possible/"}}
{"text": "Context: My boyfriend has a 2 year old son (no paternity test done) with an ex-girlfriend. They weren't dating at the time he was conceived, but they agreed she would have physical custody (50/50 automatic custody remains though), but he would get visitation. The court order was made final in October of 2013, and they agreed on one 4hr visit per week at the mother's residence. In the temporary ord...", "source_dataset": "hf_legal_reddit", "source_record_id": "2u11xq", "full_text_length": 3320, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Ontario] Filing a motion to change child visitation/access. Question about the affidavit.", "link": "https://www.reddit.com/r/legaladvice/comments/2u11xq/ontario_filing_a_motion_to_change_child/"}}
{"text": "Located in Ontario, Canada. \nI was let go by my employer on May 15th. I have this in writing. I am still under the benefit policy during the lay-off. \n\nI have a feeling that the company isn’t doing to well for obvious reasons, and that they will keep me temporarily laid off until I inform them that I have found another job, basically forcing me to quit meaning they won’t owe severance. \n\nI was won...", "source_dataset": "hf_legal_reddit", "source_record_id": "gruuow", "full_text_length": 557, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Am I entitled to severance?", "link": "https://www.reddit.com/r/legaladvice/comments/gruuow/am_i_entitled_to_severance/"}}
{"text": "I got my first traffic violation last night (ORS 806.012- No Proof of Insurance). This is the first time I've ever been pulled over or really had any interaction with a PO. Obviously I was a bit nervous and forgot that our insurance card is kept inside the envelope containing the proof of registration. So, the first thing I handed the officer was the envelope containing the proof of registration a...", "source_dataset": "hf_legal_reddit", "source_record_id": "2x0ekd", "full_text_length": 1950, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Oregon] Traffic violation- should I go to trial?", "link": "https://www.reddit.com/r/legaladvice/comments/2x0ekd/oregon_traffic_violation_should_i_go_to_trial/"}}
{"text": "So I was just wondering if they can do this. I went in for my first day (which was just to be put on the stores system and to verify that I could work there). I brought with me my driver's license and my school ID card as 2 forms of ID. She had no trouble inputting my driver's license but then the manager asked me if I had a social security card or some other documents besides my school ID card, I...", "source_dataset": "hf_legal_reddit", "source_record_id": "gnye45", "full_text_length": 2014, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Grocery store having trouble inputting my Green Card or other valid forms of ID.", "link": "https://www.reddit.com/r/legaladvice/comments/gnye45/grocery_store_having_trouble_inputting_my_green/"}}
{"text": "My son and his wife, both residents of Oregon, have been married for six years, living apart for the last twelve months with the intention to divorce. My daughter in law was diagnosed with a severe case of MS about three years ago. Her illness was largely the reason for the split. I won't bother with the details as they aren't important. There were no other parties involved, the decision to divorc...", "source_dataset": "hf_legal_reddit", "source_record_id": "53y9p8", "full_text_length": 3174, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(US) My son's wife (estranged) passed away on Saturday. Her family did not inform my son. What are his rights/responsibilities? How can I help?", "link": "https://www.reddit.com/r/legaladvice/comments/53y9p8/us_my_sons_wife_estranged_passed_away_on_saturday/"}}
{"text": "I've recently picked up blending pipe tobacco and have featured it to a modicum of interest groups that are interested in buying if I so decide to sell, but before I make such a decision I want to know if it is legal to do so.  I have no permits or licenses to do so, though I'm not certain if it is required to possess any.  As stated in the post, I live in Louisiana, and I found [this](http://www....", "source_dataset": "hf_legal_reddit", "source_record_id": "2rmpyu", "full_text_length": 974, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I'm curious to know the legal ramifications of selling pipe tobacco I've purchased and blended over the internet.(LA, USA)", "link": "https://www.reddit.com/r/legaladvice/comments/2rmpyu/im_curious_to_know_the_legal_ramifications_of/"}}
{"text": "I currently go to university and there is a student run system whereby if a student has broken a \"rule\" one can report them to a website, and at the end of the month a \"fine\" is directed toward the student responsible for the infringement. There are enough small rules where at the end of the month $100s of dollars are being collected, with the majority of students owing 5-10$. \n\nThe students were ...", "source_dataset": "hf_legal_reddit", "source_record_id": "55l3wk", "full_text_length": 972, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[Canada, ON] Students Fined for Breaking Rules", "link": "https://www.reddit.com/r/legaladvice/comments/55l3wk/canada_on_students_fined_for_breaking_rules/"}}
{"text": "So my grandfather passed away and he had a trust where I was a beneficiary. My step grandmother was the trustee I believe until 2015 when a fiduciary was appointed due to her mental capacity. I was told that the irrevocable trust was changed and myself and my siblings were removed from the trust. That my grandmothers daughter and the new fiduciary changed it and removed us.  I was also told if I c...", "source_dataset": "hf_legal_reddit", "source_record_id": "7t1t9s", "full_text_length": 982, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Irrevocable Trust possibly changed.", "link": "https://www.reddit.com/r/legaladvice/comments/7t1t9s/irrevocable_trust_possibly_changed/"}}
{"text": "My father died in 2000 (in AL). I (in NV) was contacted in Dec 2014 by a life insurance company (in GA) that held a policy for my father. I was unaware of the policy.  They stated they were notified by the Social Security Administration in 2012 that my father had passed. They could not explain why it took 2 years after that notification to contact me (my name and address are on the policy) or why ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2x78f4", "full_text_length": 798, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Father died in 2000. Contacted in 2014 by life insurance company about a policy I didn't know existed. Do I have any recourse for extreme delay?", "link": "https://www.reddit.com/r/legaladvice/comments/2x78f4/father_died_in_2000_contacted_in_2014_by_life/"}}
{"text": "I was at college, briefly stopped by my room and noticed my roommate was in bed on his computer. Was going over to a friends house so i put my books  down and left. I find out afterwards an RA walked by my room, knocked on the door and told my roommate the room smelled like weed and he looked high. My roommate doesn’t do drugs (but sort of has the dirty-hippy look)  but some in our hall do smoke i...", "source_dataset": "hf_legal_reddit", "source_record_id": "7pz81c", "full_text_length": 1863, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Room “smelled” like weed, forced to pay a fine", "link": "https://www.reddit.com/r/legaladvice/comments/7pz81c/room_smelled_like_weed_forced_to_pay_a_fine/"}}
{"text": "This isn't a \"My child spend $3000 on coins gimmie back my money!\" case. This is a rather special situation, that is currently still unfolding on the Mobile game [One Piece Treasure Cruise](https://www.bandaigames.channel.or.jp/list/one_main/tc/en/).  Links provided below to the forum of discussion and the terms of service for the game. I'll summarize here in terms that hopefully will make more se...", "source_dataset": "hf_legal_reddit", "source_record_id": "emmawa", "full_text_length": 4557, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Mobile in-game currency I spent money on is revoked after the game company screwed up.", "link": "https://www.reddit.com/r/legaladvice/comments/emmawa/mobile_ingame_currency_i_spent_money_on_is/"}}
{"text": "Ok so bear with me going to try to not leave anything out. \n\nWe have three tandem parking spots that we pay for per month. Our landlord recently installed a gate with a clicker to keep homeless people from squatting inside our parking area. My neighbors were robbed the other day, so they asked for the gate to close automatically. My roommate and I were not informed that the gate would now close au...", "source_dataset": "hf_legal_reddit", "source_record_id": "80tr20", "full_text_length": 1669, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Gate closed on a friends car because of landlord negligence, now she’s trying to make us pay for it - CA", "link": "https://www.reddit.com/r/legaladvice/comments/80tr20/gate_closed_on_a_friends_car_because_of_landlord/"}}
{"text": "I am a computer programmer and lately I have been studying Artificial Intelligence. To practice what I have learned, I wanted to make an automatic bot that plays in the stock market. Although I don't see an obvious reason why this would be illegal, I just want to make sure it is actually legal to use it. Can anyone help?", "source_dataset": "hf_legal_reddit", "source_record_id": "gq7h2h", "full_text_length": 322, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Can computers play in the stock market?", "link": "https://www.reddit.com/r/legaladvice/comments/gq7h2h/can_computers_play_in_the_stock_market/"}}
{"text": "I was fired and filed for unemployment. My employer tried to say it was due to misconduct. But there is no proof of miscoduct only allegations by coworker (Off hours). I sent copy of correspondence from employer saying I was fired due to \"alleged accusation.\" The day after I was fired they sent an email to coworkers saying they do not know what really happened because they were not there but it wa...", "source_dataset": "hf_legal_reddit", "source_record_id": "7yag2r", "full_text_length": 974, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Unemployment", "link": "https://www.reddit.com/r/legaladvice/comments/7yag2r/unemployment/"}}
{"text": "I'm a Freshman studying computer security and have been doing some of my own experiments. I have managed to find a way to identify likely honepots spread across the Internet. These computers are typically setup as information gathering devices, decoys, or sentinels which detect new events spreading across the Internet.\n\nThe honepots could be easy practice in learning how simple intrusions are cond...", "source_dataset": "hf_legal_reddit", "source_record_id": "5372w0", "full_text_length": 721, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(US interstate) Are there any laws or precedents on accessing honeypots (computers designed and deployed on the Internet expecting to be hacked or passively infiltrated)?", "link": "https://www.reddit.com/r/legaladvice/comments/5372w0/us_interstate_are_there_any_laws_or_precedents_on/"}}
{"text": "North Carolina, USA \n\nIn July of 2019 I received a ticket for failure to yield to an emergency vehicle (I contest this but not the point). I retained an attorney to represent me. \n\nIn January of this year I got notification that my license was set to be suspended for a failure to appear. I contacted the law office I was using and they told me there had be an issue with the clerk of court not filin...", "source_dataset": "hf_legal_reddit", "source_record_id": "gstfvq", "full_text_length": 886, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I drive for work and my license is suspended due to no fault of my own", "link": "https://www.reddit.com/r/legaladvice/comments/gstfvq/i_drive_for_work_and_my_license_is_suspended_due/"}}
{"text": "TL;DR My child was injured at school. School did not contact me and my daughter was sent to nurse 7 times for bleeding. I picked her up at dismissal and her face was swollen, bleeding and bruised. Took her to ER - referred to pediatric ENT and now I need some direction before meeting with principle and involved parties later this week. Was the school negligent?\n\nI'll try to keep this short and fil...", "source_dataset": "hf_legal_reddit", "source_record_id": "51b78m", "full_text_length": 3934, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Child injured at school - parents not notified [Kansas]", "link": "https://www.reddit.com/r/legaladvice/comments/51b78m/child_injured_at_school_parents_not_notified/"}}
{"text": "My fiancee came to visit me for two weeks. She works at Amazon in Pennsylvania.  \n\n  \n\nShe told her manager about the trip, he agreed, everyone she works with knew about the trip and how long it would last so she has them as witnesses. By around day 10 or 11 she got an email saying \"you've missed 3 days without letting us know why, you've been let go. If you think this decision is wrong then conta...", "source_dataset": "hf_legal_reddit", "source_record_id": "enro3n", "full_text_length": 1471, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Manager told her she could take two weeks off, she got a \"you're fired\" email on day 10 of our vacation", "link": "https://www.reddit.com/r/legaladvice/comments/enro3n/manager_told_her_she_could_take_two_weeks_off_she/"}}
{"text": "My SO started a new job this summer in Washington State and was told they would be offered insurance by a specific date last fall following a typical probation period. \n\n\n\nFall comes around, and the (out of state  - I believe Montana) HR pushed a company-wide update to the software everyone uses to communicate, which is instantly broken and glitchy to this day. SO's hiring boss also left the compa...", "source_dataset": "hf_legal_reddit", "source_record_id": "7wfwky", "full_text_length": 4874, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "SO's employer did not offer insurance as promised - now claiming they did.", "link": "https://www.reddit.com/r/legaladvice/comments/7wfwky/sos_employer_did_not_offer_insurance_as_promised/"}}
{"text": "I have recently re-entered the job market due to COVID issues at my last job. When I was there for the last decade+ I started releasing music and participating in social media under a DBA because frankly I didn’t need those people knowing my personal business, my artistic aspirations, or my political views. Now that I’m filling out applications and the like I do occasionally see a spot for “have y...", "source_dataset": "hf_legal_reddit", "source_record_id": "gvbyyn", "full_text_length": 1097, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Do I have a legal obligation to disclose a DBA to a potential employer?", "link": "https://www.reddit.com/r/legaladvice/comments/gvbyyn/do_i_have_a_legal_obligation_to_disclose_a_dba_to/"}}
{"text": "Hi all,\n\nI'm the daughter writing on behalf of my both-in-their-50's parents. The Backstory to the legal part is long, but necessary: \n\n&amp;#x200B;\n\n**Background:**\n\nMy Dad has struggled with Psychosis for the last 25 years. His mental health doctor has to carefully balance his medicine since his brain since its often a balance between making sure he's not sedated and can be aware, but also that ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gr6nlt", "full_text_length": 4368, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(MI) Dad had broken foot due to fall injury, Mom's Work Insurance covered surgery. Work Company sent letter claiming Mom may be liable to pay the expenses. Mom is scared. Advice?", "link": "https://www.reddit.com/r/legaladvice/comments/gr6nlt/mi_dad_had_broken_foot_due_to_fall_injury_moms/"}}
{"text": "My father started working for a company roughly 35 years ago in NJ. When he started at that company, he was a salaried employee. Around 20 years ago, his original company got bought out by a competitor, and everyone got switched to the competitor's system. My father continued to work on a salaried payroll. During his time working for both companies, he routinely worked 47-50 hours per week. Recent...", "source_dataset": "hf_legal_reddit", "source_record_id": "55gkp1", "full_text_length": 1220, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Is my father entitled to 20 years of overtime pay?", "link": "https://www.reddit.com/r/legaladvice/comments/55gkp1/is_my_father_entitled_to_20_years_of_overtime_pay/"}}
{"text": "**TL;DR: One DUI in deferral, one DUI convicted, one Driving on Revoked charge dismissed. Do I need to include all three of these things in an Addendum for a Grad school application? I want to be truthful without volunteering any *unnecessary* info.**\n\nI am a WV resident, and all my legal troubles occurred in WV. I am applying for a Master's program in OH. \n\nThe question on the original applicatio...", "source_dataset": "hf_legal_reddit", "source_record_id": "2u0xz8", "full_text_length": 3416, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[WV/OH] Submitting an Addendum for Graduate School Application.", "link": "https://www.reddit.com/r/legaladvice/comments/2u0xz8/wvoh_submitting_an_addendum_for_graduate_school/"}}
{"text": "My job has paid for my master's degree over the past few years and I'm set to graduate in May.  I signed an agreement with them that after I complete school I will work for them for 3 years or pay them back a pro-rated amount based on how long I stayed.  I have really liked my job up until a few months ago - some things have changed and they've brought in some new upper management (with some less ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2ya1fg", "full_text_length": 6442, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Employer paid my tuition, hoping to leave before my commitment is up without having to pay them back", "link": "https://www.reddit.com/r/legaladvice/comments/2ya1fg/employer_paid_my_tuition_hoping_to_leave_before/"}}
{"text": "It’s been a rough few months. As of last October I was looking for a new apartment (expired lease), but as I was in the middle of a breakup I didn’t know what my budget would be, if it would be a studio or one bedroom, etc.\n\nI needed some time to figure out if I was looking for a place as a single guy, or with my girlfriend (who I was living with up until our lease expired and was not up for renew...", "source_dataset": "hf_legal_reddit", "source_record_id": "guckni", "full_text_length": 4491, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My “friend” just gave me a 2 week deadline to get all my stuff out of his basement (NY)", "link": "https://www.reddit.com/r/legaladvice/comments/guckni/my_friend_just_gave_me_a_2_week_deadline_to_get/"}}
{"text": "Here's the story. I'm a freshman at a college in Indiana. I've used utorrent a lot in the past so I didn't think twice about jumping on the schools network and grabbing more than a few songs from around the web. Long story short the University caught on and gave me a slap on the wrist. They took away my internet for a bit, I had to pay a $50 fine and had to attend a seminar about how stealing is  ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2hkedf", "full_text_length": 1775, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Rightscorp Copyright Settlement Notices - To Pay or Not to Pay (Roughly $4000)", "link": "https://www.reddit.com/r/legaladvice/comments/2hkedf/rightscorp_copyright_settlement_notices_to_pay_or/"}}
{"text": "I ride Community Transit (bus) from Lynnwood to Seattle everyday and today I had a bus driver scream at me for smoking at the bus stop (this stop is a pole with schedules and nothing about smoking) and told me he wouldn't pick me up again if he's sees me smoking at the stop. I'm very conscience of others when I'm smoking as well as metro rules, so I was really surprised when the bus driver went on...", "source_dataset": "hf_legal_reddit", "source_record_id": "2qvpxd", "full_text_length": 2636, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Public Transit Smoking Laws at bus stop pole (Snohomish County, WA)", "link": "https://www.reddit.com/r/legaladvice/comments/2qvpxd/public_transit_smoking_laws_at_bus_stop_pole/"}}
{"text": "Wedding. Help Me.\n\nHey All,\n\nJust looking into getting some legal advice on our situation. Before I dive in, we are looking into who to talk to (lawyer wise) for a situation like this. Thank you all! \n\nWe have a wedding booked for Aug 1st 2020. We waited until May 1st to reach out to our venue to see whats going on (this was due a dying family member and the unusual status of COVID19). Here is our...", "source_dataset": "hf_legal_reddit", "source_record_id": "gdnzpw", "full_text_length": 4206, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Wedding Problems With Venue (Ontario Canada)", "link": "https://www.reddit.com/r/legaladvice/comments/gdnzpw/wedding_problems_with_venue_ontario_canada/"}}
{"text": "I'm a teacher at a private school in PA making $30,000 paid as a salary (no hours tracking).  My official work day is 8-4 which is a 40 hour work week (we eat lunch with and while supervising the kids).  The kids are in the classroom between 8-3:30.  I average another 25+ hours a week before/after school and nights and weekend grading and doing planning and prep work.  I don't mind the long hours ...", "source_dataset": "hf_legal_reddit", "source_record_id": "ejn3s1", "full_text_length": 1713, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "With New Federal/PA OT Laws - Boss Expects Me To Work 40+ Hours Teaching, But Said They Won't Pay OT... Please Help!", "link": "https://www.reddit.com/r/legaladvice/comments/ejn3s1/with_new_federalpa_ot_laws_boss_expects_me_to/"}}
{"text": "My ex and I have been separated for almost 6 years now and have never had a formal custody agreement. For a long time, we were able to be amicable. Basically throughout the last couple years, he would get upset about something and stop communicating with me and other childish things. I let it go because, honestly, it wasn’t ever anything that really effected me. I was irritated but that never seem...", "source_dataset": "hf_legal_reddit", "source_record_id": "gg4m0i", "full_text_length": 2694, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Custody During This Pandemic", "link": "https://www.reddit.com/r/legaladvice/comments/gg4m0i/custody_during_this_pandemic/"}}
{"text": "I will try to make this short but detailed so to avoid any confusion. Also if you require clarification please let me know as this is very important and will help me determine which direction to go in.\n\nMy father owns a gas station and our landlord passed away (R.I.P.). Prior to his passing he verbally allowed me father to attain an on premise consumption license from the State of Texas (TABC) to ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2hsw9m", "full_text_length": 2331, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Landlord threatening action against gas station for people drinking on premises", "link": "https://www.reddit.com/r/legaladvice/comments/2hsw9m/landlord_threatening_action_against_gas_station/"}}
{"text": "Mods, I wasn’t sure where to post this, so help me move it around if I need to. Thanks. \n\nA few weeks ago + 1 day, I’m with friend 1 as he trips on psychedelic mushrooms to ensure that he is safe and responsible and doesn’t get anxious or anything like that. It was a very personal moment, and I felt entirely trusted by him. He had a bit of anxiety, but it was overall not too bad for him. \n\nA few w...", "source_dataset": "hf_legal_reddit", "source_record_id": "ggroe1", "full_text_length": 3492, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "“Friend” is saying I drugged him.", "link": "https://www.reddit.com/r/legaladvice/comments/ggroe1/friend_is_saying_i_drugged_him/"}}
{"text": "I'm a student in **Germany** and I'm working on a sideproject, which want to deploy for public access. Its fairly simple: Email+password for login and registration. The project has an editor that generates some data, as well as edits said data. The website uses no thirdparties like google or facebook except for hosting: Heroku and MongoAtlas.\n\nI **cannot** provide guarantee, warranty or any promis...", "source_dataset": "hf_legal_reddit", "source_record_id": "guq29m", "full_text_length": 1116, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Public access (deployment) of a sideproject website", "link": "https://www.reddit.com/r/legaladvice/comments/guq29m/public_access_deployment_of_a_sideproject_website/"}}
{"text": "Hi, I’ve been lurking for a while and have decided to see what others think. Our situation may confusing, so I’ll try my best to explain it, as it goes waaaay back. \n\nParents: F(43) M(47) \nChild: F(4) &amp; Me F(21)\n\nSo basically my parents have been divorced for over 10 years, but have always been in a toxic relationship since I was born (they would separate, my mom would leave and take me and my...", "source_dataset": "hf_legal_reddit", "source_record_id": "gr69wl", "full_text_length": 3589, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Parents eventually going to fight for custody", "link": "https://www.reddit.com/r/legaladvice/comments/gr69wl/parents_eventually_going_to_fight_for_custody/"}}
{"text": "Hi all.  This is my first post here as I've never had any significant problems in my life that would potentially need to be solved through the legal system. And this will probably be a wall of text sorry :/\n\nAnyway, me and 7 other guys are in our senior year of college.  Last year we lived in a house off campus and ran into our fair share of annoying landlord practices but nothing that bothered us...", "source_dataset": "hf_legal_reddit", "source_record_id": "50ja6z", "full_text_length": 7661, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[NY]College students renting out house. Will not have water for at least 7 days, landlord is terrible at communicating with us, among other things. What course of actions should we take, if any?", "link": "https://www.reddit.com/r/legaladvice/comments/50ja6z/nycollege_students_renting_out_house_will_not/"}}
{"text": "I'll do my best to summarize without having to type an entire novel.\n\nGirlfriend and myself have 4 months left in our lease. I just purchased a house and we will take over the house in 2 months. We want to get out of the lease agreement before that, obviously, so we're not paying the rent for the final two months. \n\nFirst, before it is mentioned - Yes, subletting is an option but there's reasons I...", "source_dataset": "hf_legal_reddit", "source_record_id": "2xuhby", "full_text_length": 4337, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[OH] Need some help on apartment lease and hope you all can help!", "link": "https://www.reddit.com/r/legaladvice/comments/2xuhby/oh_need_some_help_on_apartment_lease_and_hope_you/"}}
{"text": "Hello,\n\nI am currently a student at a high school in Florida. This school had no problem with funding, and upwards of 2,700 students currently enrolled. (Funding will become important later.)\n\nAbout two months ago, groups of boys (I assume it was a group. It could have been only one or two, I'm really not sure.) began taking the soap dispensers off the walls, and in at least one case, defecating o...", "source_dataset": "hf_legal_reddit", "source_record_id": "e9euc5", "full_text_length": 10384, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "In what way should I report my school for breaking a state law regarding sanitation standards in educational facilities? [FL]", "link": "https://www.reddit.com/r/legaladvice/comments/e9euc5/in_what_way_should_i_report_my_school_for/"}}
{"text": "I took a job at the beginning of the year that was supposed to be for a management position of a local business with 3 locations. During my interview I am asked why I wanted out of my corporate position, I let the owner know I have a fairly severe case of ADHD and because of this I struggle with corporate views. Mornings are a struggle, I’m often running a few minutes behind, I have kids and somet...", "source_dataset": "hf_legal_reddit", "source_record_id": "gjht9c", "full_text_length": 6667, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "(Ohio) Help me access this employment scenario?", "link": "https://www.reddit.com/r/legaladvice/comments/gjht9c/ohio_help_me_access_this_employment_scenario/"}}
{"text": "We moved in last May. On the second day of living in the house we noticed the toilet wasn’t running or flushing so we called our new landlord to have it fixed. He came by the same day with the handy man and it was up and running but making weird noises. \nThere were a few instances here and there where we’d call him (garage door wasn’t working properly, basement drain was backed up) etc. no big dea...", "source_dataset": "hf_legal_reddit", "source_record_id": "eb70ge", "full_text_length": 2869, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Crazy landlord advice needed please!", "link": "https://www.reddit.com/r/legaladvice/comments/eb70ge/crazy_landlord_advice_needed_please/"}}
{"text": "This virus and quarantine have done a serious number on my living situation, so naturally I’ve been finding myself locked in conversation with the apartment office. The thing is, nobody whose number I’m allowed access to actually makes decisions on the apartment. In other words, I can talk to the managers who *represent* my landlord and their policies, but I cannot talk to the *actual* landlord(s)...", "source_dataset": "hf_legal_reddit", "source_record_id": "grs6zl", "full_text_length": 1359, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Is it legal for my apartment complex to put a barrier between tenants and the actual landowners?", "link": "https://www.reddit.com/r/legaladvice/comments/grs6zl/is_it_legal_for_my_apartment_complex_to_put_a/"}}
{"text": "I have multiple leaks on my gas heater. I have been sick for several weeks, gas poisoning symptoms, but did not really understand the difference between carbon monoxide and natural gas, also, I had not been smelling gas on a regular basis, so it didn't seem like a possibility. I initially thought I had carbon monoxide poisoning, fire department came out and found low level of CO2, not enough to ex...", "source_dataset": "hf_legal_reddit", "source_record_id": "7usres", "full_text_length": 4175, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Gas leak, landlord responsibilities in OK", "link": "https://www.reddit.com/r/legaladvice/comments/7usres/gas_leak_landlord_responsibilities_in_ok/"}}
{"text": "I do not drink often, in fact I have a medium bottle of Gin in the fridge and that will probably last me 6+ months, maybe a year. \n\nMy question though, usually once in awhile when I know I wont be going anywhere for a quite a few hours, usually late at night I like to have a few shots in some 7up while I play games or what not. \n\nWhat are some legal issues that would surface if I had to use a gun ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2uv64f", "full_text_length": 732, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[AZ] Not something that has come up, just a curious question about self defense in your home while you have had a drink.", "link": "https://www.reddit.com/r/legaladvice/comments/2uv64f/az_not_something_that_has_come_up_just_a_curious/"}}
{"text": "Hello Reddit, today has been a tough one to say the least.  So I'll cut to it and start with a little background.  I work as an entry level systems analyst for a company in the state of Hawaii.  Our company is located inside of a multi-floor office building with many other companies. We all share a 6-level parking garage for all of the offices.  A private parking company runs the garage as well as...", "source_dataset": "hf_legal_reddit", "source_record_id": "2q74j0", "full_text_length": 3133, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "I may have been towed wrongfully from a private parking lot. Is there anything I can do?", "link": "https://www.reddit.com/r/legaladvice/comments/2q74j0/i_may_have_been_towed_wrongfully_from_a_private/"}}
{"text": "  \n\nHi everyone. Long time lurker in this sub and in BOLA, but this is my first time posting. I’ve tried to include as much information as I can to explain the situation without writing a whole novel, but if any other information is needed please let me know. Also let me say right off the bat that I know both of my parents have made some less-than-stellar (and in one case possibly veering into fra...", "source_dataset": "hf_legal_reddit", "source_record_id": "e9qg82", "full_text_length": 4715, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[TX] Dad died unexpectedly, finances are a disaster, can't find the will - just looking for some guidance on how to move forward.", "link": "https://www.reddit.com/r/legaladvice/comments/e9qg82/tx_dad_died_unexpectedly_finances_are_a_disaster/"}}
{"text": "I live in an apartment across from a small plaza and a busy road between us. The rent on the apartment is beaucoup dollars.\n\nAround April 20th, there started coming this loud, intrusive squealing noise. I suspect it is a bearing on a fan within the HVAC systems on a specific building across the way. This noise can best be described as the same noise that occurs when that old sedan starts up, with ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gtmicf", "full_text_length": 3546, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "24-hour HVAC noise (bad fan bearing) from neighboring property - what are my remaining options?", "link": "https://www.reddit.com/r/legaladvice/comments/gtmicf/24hour_hvac_noise_bad_fan_bearing_from/"}}
{"text": "Disclaimer: Please excuse my ignorance regarding legal terms.\n\nLet me start at the very beginning of this complicated situation. I will try to include as much detail as I can. In 2008, I was 16 years old when my ex-girlfriend gave birth to our son. Now I must admit, we did not know she was pregnant, and if my ex did know, she certainly kept it from me. She was already overweight, so I just assumed...", "source_dataset": "hf_legal_reddit", "source_record_id": "826xsn", "full_text_length": 5016, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My parents have custody of my son, do I have any legal standing to win custody back?", "link": "https://www.reddit.com/r/legaladvice/comments/826xsn/my_parents_have_custody_of_my_son_do_i_have_any/"}}
{"text": "So, here’s the deal: \n\nLast fall, Sept 2018, I added a second car to my policy. This is important. I then proceeded to have three claims (after ten years of no claims), one in Nov 2018 where I crashed into a guard rail due to snow with Car #1, one in Jan 2019 where I hit a deer with car #1, one in February where my cousin was involved in an accident with car #2 and totaled the car after dropping m...", "source_dataset": "hf_legal_reddit", "source_record_id": "e65ttj", "full_text_length": 1734, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Progressive auto may be violating NYS state ins. Law by non-renewing me (New York)", "link": "https://www.reddit.com/r/legaladvice/comments/e65ttj/progressive_auto_may_be_violating_nys_state_ins/"}}
{"text": "EDIT: Location: Missouri - USA\n\n* I resigned from a company in April.\n* My manager and clerk failed to process my termination papers. A third party from the company entered a wrong termination date two months later.\n* The company's accounting system automatically generated an 8 hour pay check for both May and June despite the fact that I didn't work for the company or submit any time claims.\n* Due...", "source_dataset": "hf_legal_reddit", "source_record_id": "57qefa", "full_text_length": 2568, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "My previous employer created 2 separate instances of over-paid time despite my resignation and sent me to collections in order to collect pay that I never received.", "link": "https://www.reddit.com/r/legaladvice/comments/57qefa/my_previous_employer_created_2_separate_instances/"}}
{"text": "Hello,\n\nI live in Los Angeles, CA where the Mayor has ordered a ban on evictions due to inability to pay rent relating to COVID-19 loss of employment, medical costs, or childcare. \n\nI was laid off and I notified my landlord of my inability to pay rent going forward and they sent me a form to fill out. According to a document put out by the City of Los Angeles, “A tenant is not required to provide ...", "source_dataset": "hf_legal_reddit", "source_record_id": "gkhnci", "full_text_length": 3915, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Los Angeles, CA COVID-19 Renter Protection, Landlord Request", "link": "https://www.reddit.com/r/legaladvice/comments/gkhnci/los_angeles_ca_covid19_renter_protection_landlord/"}}
{"text": "Hello,\n\nSo we are in a situation where my dad's ex-business partner is using his info. We live in BC, Canada. The former business partner (let's call him Joe) owed a lot of people money and almost made the company bankrupt. They parted ways, did all the necessary paperwork and my dad gave the company to him. My dad then went to start his own company which is thriving. We recently found out that Jo...", "source_dataset": "hf_legal_reddit", "source_record_id": "gn6yjk", "full_text_length": 1213, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Ex-Business Partner still using our address and info", "link": "https://www.reddit.com/r/legaladvice/comments/gn6yjk/exbusiness_partner_still_using_our_address_and/"}}
{"text": "Hi, \n\nSo I'm currently a sophomore at a small liberal arts school in Ohio. I became an RA due to the preferred housing process and the free room. I also had a single freshman year, so I decided it'd be easier than trying to find a roomate. \n\nAt first I was excited, but it got progressively worse. First I got placed to work in the most difficult dorm (our biggest with ~268 people) on the 4th floor ...", "source_dataset": "hf_legal_reddit", "source_record_id": "e6sqsp", "full_text_length": 2693, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Quit Job and Job wants me to pay them + extra fees and keep my last paycheck", "link": "https://www.reddit.com/r/legaladvice/comments/e6sqsp/quit_job_and_job_wants_me_to_pay_them_extra_fees/"}}
{"text": " got into an auto accident yesterday with the dealerships test driving car and i hit a jay runner who ran across a street that isn’t an intersection on a busy road. Very freak accident and I couldn’t stop in time. We called 911 and police came too. It wasn’t criminal just civil. The person had cuts and scrapes and they went to the hospital to get checked out. The other party isn’t upset and they a...", "source_dataset": "hf_legal_reddit", "source_record_id": "gcs2qe", "full_text_length": 1109, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Test driving a car and hit a jay runner and in talks with my insurance company", "link": "https://www.reddit.com/r/legaladvice/comments/gcs2qe/test_driving_a_car_and_hit_a_jay_runner_and_in/"}}
{"text": "Over 2 weeks ago I brought my son's device into the repair shop to have the battery swapped out because it was only holding about 25% of the charge it used to. The guys quoted me $65 which was much lower than other repair shops so I went and dropped it off around 11 AM. They called me before they closed shop about 4 PM and when I picked it up an app I used to track the battery showed it was the sa...", "source_dataset": "hf_legal_reddit", "source_record_id": "5023lw", "full_text_length": 6537, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[CA, USA] Repair shop bricked my son's iPad Mini 2 and tried to give it back to me along with initial repair cost as recompense.", "link": "https://www.reddit.com/r/legaladvice/comments/5023lw/ca_usa_repair_shop_bricked_my_sons_ipad_mini_2/"}}
{"text": "On a light rail system in CA.  Two elderly women who don't speak English board their train with all their luggage.  A third woman begins to yell at them in English about needing to be in the luggage car, as their luggage is blocking the aisles, etc.  Yelling woman becomes increasing irate.\n\nAs I am more or less fluent in the language of the first two women I step in and explain to them they can't ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2tzk1j", "full_text_length": 1939, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "[CA]-Assault (Verbal Threats)", "link": "https://www.reddit.com/r/legaladvice/comments/2tzk1j/caassault_verbal_threats/"}}
{"text": "Good afternoon!  I am divorced, have two children, and live in NC.  I currently have a will, but am amending it to reflect my martial situation.  My question is if I predecease my ex-husband, does he automatically get full custody of our children?  Or can I stipulate in my will that my mother be granted joint custody?  Does he automatically get the entirety of my social security death benefits as ...", "source_dataset": "hf_legal_reddit", "source_record_id": "57s8ja", "full_text_length": 819, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Estate Planning - Ex-Husband's Claim to Benefits", "link": "https://www.reddit.com/r/legaladvice/comments/57s8ja/estate_planning_exhusbands_claim_to_benefits/"}}
{"text": "I run a small business and currently do not make enough money from it to go without a full-time job. I have established an LLC for this small business and my employer is aware of it and even congratulated me on its creation. \n\nToday my employer provided me an updated social media policy form for me to read and sign. I walked away and amended it with this letter, signed it, and provided it to my ma...", "source_dataset": "hf_legal_reddit", "source_record_id": "gr8oc4", "full_text_length": 2501, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Today I amended my employers social media policy, can they hurt me or my business?", "link": "https://www.reddit.com/r/legaladvice/comments/gr8oc4/today_i_amended_my_employers_social_media_policy/"}}
{"text": "My good friend was pulled over for going 60 mph in a 45 mph speed zone. However, as he describes it he was in a 55. I don't believe he is lying. \n\n\nI'm trying to help him decide if it is worth going to court or just paying the fine. From what I have read here, it seems likely the ticket will simply be corrected to him going 60 in a 55. If that is the case, do you think it is worth it? \nAny chance ...", "source_dataset": "hf_legal_reddit", "source_record_id": "2p0fzv", "full_text_length": 1575, "category": "algorithmic_decisions", "labels": {"automated_decision": 0.0, "human_review": 0.0, "transparency_statement": 0.0}, "needs_labeling": true, "original_record": {"title": "Speeding Ticket - Worth Fighting/Correcting?", "link": "https://www.reddit.com/r/legaladvice/comments/2p0fzv/speeding_ticket_worth_fightingcorrecting/"}}
