{"text": "and to what extent the personal data are or will be processed. The principle of transparency requires that any information and communication relating to the processing of those personal data be easily accessible and easy to understand, and that clear and plain language be used. That principle concerns, in particular, information to the data subjects on the identity of the controller and the purposes of the processing and further information to ensure fair and transparent processing in respect of the natural persons concerned and their right to obtain confirmation and communication of personal data concerning them which are being processed. Natural persons should be made aware of risks, rules, safeguards and rights in relation to the processing of personal data and how to exercise their rights in relation to such processing. In particular, the specific purposes for which personal data are processed should be explicit and legitimate and determined at the time of the collection of the personal data. The personal data should be adequate, relevant and limited to what is necessary for the purposes for which they are processed. This requires, in particular, ensuring that the period for which the personal data are stored is limited to a strict minimum. Personal data should be processed only if the purpose of the processing could not reasonably be fulfilled by other means. In order to ensure that the personal data are not kept longer than necessary, time limits should be established by the controller for erasure or for a periodic review. Every reasonable step should be taken to ensure that personal data which are inaccurate are rectified or deleted. Personal data should be processed in a manner that ensures appropriate security and confidentiality of the personal data, including for preventing unauthorised access to or use of personal data and the equipment used for the processing. (40) In order for processing to be lawful, personal data should be processed on the basis of the consent of the data subject concerned or some other legitimate basis, laid down by law, either in this Regulation or in other Union or Member State law as referred to in this Regulation, including the necessity for compliance with the legal obligation to which the controller is subject or the necessity for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "processing such personal data to erase any links to, or copies or replications of those personal data. In doing so, that controller should take reasonable steps, taking into account available technology and the means available to the controller, including technical measures, to inform the controllers which are processing the personal data of the data subject's request. (67) Methods by which to restrict the processing of personal data could include, inter alia, temporarily moving the selected data to another processing system, making the selected personal data unavailable to users, or temporarily removing published data from a website. In automated filing systems, the restriction of processing should in principle be ensured by technical means in such a manner that the personal data are not subject to further processing operations and cannot be changed. The fact that the processing of personal data is restricted should be clearly indicated in the system. (68) To further strengthen the control over his or her own data, where the processing of personal data is carried out by automated means, the data subject should also be allowed to receive personal data concerning him or her which he or she has provided to a controller in a structured, commonly used, machine-readable and interoperable format, and to transmit it to another controller. Data controllers should be encouraged to develop interoperable formats that enable data portability. That right should apply where the data subject provided the personal data on the basis of his or her consent or the processing is necessary for the performance of a contract. It should not apply where processing is based on a legal ground other than consent or contract. By its very nature, that right should not be exercised against controllers processing personal data in the exercise of their public duties. It should therefore not apply where the processing of the personal data is necessary for compliance with a legal obligation to which the controller is subject or for the performance of a task carried out in the public interest or in the exercise of an official authority vested in the controller. The data subject's right to transmit or receive personal data concerning him or her should not create an obligation for the controllers to adopt or maintain processing systems which are technically compatible. Where, in a certain set of personal data, more than one data subject is concerned, the right to receive the personal data", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "to transmit or receive personal data concerning him or her should not create an obligation for the controllers to adopt or maintain processing systems which are technically compatible. Where, in a certain set of personal data, more than one data subject is concerned, the right to receive the personal data should be without prejudice to the rights and freedoms of other data subjects in accordance with this Regulation. Furthermore, that right should not prejudice the right of the data subject to obtain the erasure of personal data and the limitations of that right as set out in this Regulation and should, in particular, not imply the erasure of personal data concerning the data subject which have been provided by him or her for the performance of a contract to the extent that and for as long as the personal data are necessary for the performance of that contract. Where technically feasible, the data subject should have the right to have the personal data transmitted directly from one controller to another. (69) Where personal data might lawfully be processed because processing is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller, or on grounds of the legitimate interests of a controller or a third party, a data subject should, nevertheless, be entitled to object to the processing of any personal data relating to his or her particular situation. It should be for the controller to demonstrate that its compelling legitimate interest overrides the interests or the fundamental rights and freedoms of the data subject. (70) Where personal data are processed for the purposes of direct marketing, the data subject should have the right to object to such processing, including profiling to the extent that it is related to such direct marketing, whether with regard to initial or further processing, at any time and free of charge. That right should be explicitly brought to the attention of the data subject and presented clearly and separately from any other information. (71) The data subject should have the right not to be subject to a decision, which may include a measure, evaluating personal aspects relating to him or her which is based solely on automated processing and which produces legal effects concerning him or her or similarly significantly affects him or her, such as automatic refusal of an online", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "complaint, partially or wholly rejects or dismisses a complaint or does not act where such action is necessary to protect the rights of the data subject. The investigation following a complaint should be carried out, subject to judicial review, to the extent that is appropriate in the specific case. The supervisory authority should inform the data subject of the progress and the outcome of the complaint within a reasonable period. If the case requires further investigation or coordination with another supervisory authority, intermediate information should be given to the data subject. In order to facilitate the submission of complaints, each supervisory authority should take measures such as providing a complaint submission form which can also be completed electronically, without excluding other means of communication. (142) Where a data subject considers that his or her rights under this Regulation are infringed, he or she should have the right to mandate a not-for-profit body, organisation or association which is constituted in accordance with the law of a Member State, has statutory objectives which are in the public interest and is active in the field of the protection of personal data to lodge a complaint on his or her behalf with a supervisory authority, exercise the right to a judicial remedy on behalf of data subjects or, if provided for in Member State law, exercise the right to receive compensation on behalf of data subjects. A Member State may provide for such a body, organisation or association to have the right to lodge a complaint in that Member State, independently of a data subject's mandate, and the right to an effective judicial remedy where it has reasons to consider that the rights of a data subject have been infringed as a result of the processing of personal data which infringes this Regulation. That body, organisation or association may not be allowed to claim compensation on a data subject's behalf independently of the data subject's mandate. (143) Any natural or legal person has the right to bring an action for annulment of decisions of the Board before the Court of Justice under the conditions provided for in Article 263 TFEU. As addressees of such decisions, the supervisory authorities concerned which wish to challenge them have to bring action within two months of being notified of them, in accordance with Article 263 TFEU. Where decisions of the Board are of direct and individual concern to", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "pseudonymisation of the data). Member States should provide for appropriate safeguards for the processing of personal data for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes. Member States should be authorised to provide, under specific conditions and subject to appropriate safeguards for data subjects, specifications and derogations with regard to the information requirements and rights to rectification, to erasure, to be forgotten, to restriction of processing, to data portability, and to object when processing personal data for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes. The conditions and safeguards in question may entail specific procedures for data subjects to exercise those rights if this is appropriate in the light of the purposes sought by the specific processing along with technical and organisational measures aimed at minimising the processing of personal data in pursuance of the proportionality and necessity principles. The processing of personal data for scientific purposes should also comply with other relevant legislation such as on clinical trials. (157) By coupling information from registries, researchers can obtain new knowledge of great value with regard to widespread medical conditions such as cardiovascular disease, cancer and depression. On the basis of registries, research results can be enhanced, as they draw on a larger population. Within social science, research on the basis of registries enables researchers to obtain essential knowledge about the long-term correlation of a number of social conditions such as unemployment and education with other life conditions. Research results obtained through registries provide solid, high-quality knowledge which can provide the basis for the formulation and implementation of knowledge-based policy, improve the quality of life for a number of people and improve the efficiency of social services. In order to facilitate scientific research, personal data can be processed for scientific research purposes, subject to appropriate conditions and safeguards set out in Union or Member State law. (158) Where personal data are processed for archiving purposes, this Regulation should also apply to that processing, bearing in mind that this Regulation should not apply to deceased persons. Public authorities or public or private bodies that hold records of public interest should be services which, pursuant to Union or Member State law, have a legal obligation to acquire, preserve, appraise, arrange, describe, communicate, promote, disseminate and provide access to records of enduring value for general public interest. Member States should also be", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "1, the controller shall, at the time when personal data are obtained, provide the data subject with the following further information necessary to ensure fair and transparent processing: (a) the period for which the personal data will be stored, or if that is not possible, the criteria used to determine that period; (b) the existence of the right to request from the controller access to and rectification or erasure of personal data or restriction of processing concerning the data subject or to object to processing as well as the right to data portability; (c) where the processing is based on point (a) of Article 6(1) or point (a) of Article 9(2), the existence of the right to withdraw consent at any time, without affecting the lawfulness of processing based on consent before its withdrawal; (d) the right to lodge a complaint with a supervisory authority; (e) whether the provision of personal data is a statutory or contractual requirement, or a requirement necessary to enter into a contract, as well as whether the data subject is obliged to provide the personal data and of the possible consequences of failure to provide such data; (f) the existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing for the data subject. 3. Where the controller intends to further process the personal data for a purpose other than that for which the personal data were collected, the controller shall provide the data subject prior to that further processing with information on that other purpose and with any relevant further information as referred to in paragraph 2. 4. Paragraphs 1, 2 and 3 shall not apply where and insofar as the data subject already has the information. Article 14 Information to be provided where personal data have not been obtained from the data subject 1. Where personal data have not been obtained from the data subject, the controller shall provide the data subject with the following information: (a) the identity and the contact details of the controller and, where applicable, of the controller's representative; (b) the contact details of the data protection officer, where applicable; (c) the purposes of the processing for which the personal data are intended as well as the legal basis for the processing; (d)", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "the identity and the contact details of the controller and, where applicable, of the controller's representative; (b) the contact details of the data protection officer, where applicable; (c) the purposes of the processing for which the personal data are intended as well as the legal basis for the processing; (d) the categories of personal data concerned; (e) the recipients or categories of recipients of the personal data, if any; (f) where applicable, that the controller intends to transfer personal data to a recipient in a third country or international organisation and the existence or absence of an adequacy decision by the Commission, or in the case of transfers referred to in Article 46 or 47, or the second subparagraph of Article 49(1), reference to the appropriate or suitable safeguards and the means to obtain a copy of them or where they have been made available. 2. In addition to the information referred to in paragraph 1, the controller shall provide the data subject with the following information necessary to ensure fair and transparent processing in respect of the data subject: (a) the period for which the personal data will be stored, or if that is not possible, the criteria used to determine that period; (b) where the processing is based on point (f) of Article 6(1), the legitimate interests pursued by the controller or by a third party; (c) the existence of the right to request from the controller access to and rectification or erasure of personal data or restriction of processing concerning the data subject and to object to processing as well as the right to data portability; (d) where processing is based on point (a) of Article 6(1) or point (a) of Article 9(2), the existence of the right to withdraw consent at any time, without affecting the lawfulness of processing based on consent before its withdrawal; (e) the right to lodge a complaint with a supervisory authority; (f) from which source the personal data originate, and if applicable, whether it came from publicly accessible sources; (g) the existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing for the data subject. 3. The controller shall provide the information referred to in paragraphs 1 and 2: (a) within a reasonable period", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "or Member State law, including a statutory obligation of secrecy. Article 15 Right of access by the data subject 1. The data subject shall have the right to obtain from the controller confirmation as to whether or not personal data concerning him or her are being processed, and, where that is the case, access to the personal data and the following information: (a) the purposes of the processing; (b) the categories of personal data concerned; (c) the recipients or categories of recipient to whom the personal data have been or will be disclosed, in particular recipients in third countries or international organisations; (d) where possible, the envisaged period for which the personal data will be stored, or, if not possible, the criteria used to determine that period; (e) the existence of the right to request from the controller rectification or erasure of personal data or restriction of processing of personal data concerning the data subject or to object to such processing; (f) the right to lodge a complaint with a supervisory authority; (g) where the personal data are not collected from the data subject, any available information as to their source; (h) the existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing for the data subject. 2. Where personal data are transferred to a third country or to an international organisation, the data subject shall have the right to be informed of the appropriate safeguards pursuant to Article 46 relating to the transfer. 3. The controller shall provide a copy of the personal data undergoing processing. For any further copies requested by the data subject, the controller may charge a reasonable fee based on administrative costs. Where the data subject makes the request by electronic means, and unless otherwise requested by the data subject, the information shall be provided in a commonly used electronic form. 4. The right to obtain a copy referred to in paragraph 3 shall not adversely affect the rights and freedoms of others. Section 3 Rectification and erasure Article 16 Right to rectification The data subject shall have the right to obtain from the controller without undue delay the rectification of inaccurate personal data concerning him or her. Taking into account the purposes of the processing, the data", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "rights and freedoms of others. Section 3 Rectification and erasure Article 16 Right to rectification The data subject shall have the right to obtain from the controller without undue delay the rectification of inaccurate personal data concerning him or her. Taking into account the purposes of the processing, the data subject shall have the right to have incomplete personal data completed, including by means of providing a supplementary statement. Article 17 Right to erasure (‘right to be forgotten’) 1. The data subject shall have the right to obtain from the controller the erasure of personal data concerning him or her without undue delay and the controller shall have the obligation to erase personal data without undue delay where one of the following grounds applies: (a) the personal data are no longer necessary in relation to the purposes for which they were collected or otherwise processed; (b) the data subject withdraws consent on which the processing is based according to point (a) of Article 6(1), or point (a) of Article 9(2), and where there is no other legal ground for the processing; (c) the data subject objects to the processing pursuant to Article 21(1) and there are no overriding legitimate grounds for the processing, or the data subject objects to the processing pursuant to Article 21(2); (d) the personal data have been unlawfully processed; (e) the personal data have to be erased for compliance with a legal obligation in Union or Member State law to which the controller is subject; (f) the personal data have been collected in relation to the offer of information society services referred to in Article 8(1). 2. Where the controller has made the personal data public and is obliged pursuant to paragraph 1 to erase the personal data, the controller, taking account of available technology and the cost of implementation, shall take reasonable steps, including technical measures, to inform controllers which are processing the personal data that the data subject has requested the erasure by such controllers of any links to, or copy or replication of, those personal data. 3. Paragraphs 1 and 2 shall not apply to the extent that processing is necessary: (a) for exercising the right of freedom of expression and information; (b) for compliance with a legal obligation which requires processing by Union or Member State law to which the controller is subject or for the performance of a task carried out", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "or of a Member State. 3. A data subject who has obtained restriction of processing pursuant to paragraph 1 shall be informed by the controller before the restriction of processing is lifted. Article 19 Notification obligation regarding rectification or erasure of personal data or restriction of processing The controller shall communicate any rectification or erasure of personal data or restriction of processing carried out in accordance with Article 16, Article 17(1) and Article 18 to each recipient to whom the personal data have been disclosed, unless this proves impossible or involves disproportionate effort. The controller shall inform the data subject about those recipients if the data subject requests it. Article 20 Right to data portability 1. The data subject shall have the right to receive the personal data concerning him or her, which he or she has provided to a controller, in a structured, commonly used and machine-readable format and have the right to transmit those data to another controller without hindrance from the controller to which the personal data have been provided, where: (a) the processing is based on consent pursuant to point (a) of Article 6(1) or point (a) of Article 9(2) or on a contract pursuant to point (b) of Article 6(1); and (b) the processing is carried out by automated means. 2. In exercising his or her right to data portability pursuant to paragraph 1, the data subject shall have the right to have the personal data transmitted directly from one controller to another, where technically feasible. 3. The exercise of the right referred to in paragraph 1 of this Article shall be without prejudice to Article 17. That right shall not apply to processing necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the controller. 4. The right referred to in paragraph 1 shall not adversely affect the rights and freedoms of others. Section 4 Right to object and automated individual decision-making Article 21 Right to object 1. The data subject shall have the right to object, on grounds relating to his or her particular situation, at any time to processing of personal data concerning him or her which is based on point (e) or (f) of Article 6(1), including profiling based on those provisions. The controller shall no longer process the personal data unless the controller demonstrates compelling legitimate grounds for", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Codes Display Text skip to content home accessibility FAQ feedback sitemap login x Quick Search: Bill Number Bill Keyword Home Bill Information California Law Publications Other Resources My Subscriptions My Favorites California Law >> >> Code Section Group Code Section Group Code: Select Code CONS BPC CIV CCP COM CORP EDC ELEC EVID FAM FIN FGC FAC GOV HNC HSC INS LAB MVC PEN PROB PCC PRC PUC RTC SHC UIC VEH WAT WIC Article:Section: Code: Select Code All BPC CIV CCP COM CORP EDC ELEC EVID FAM FIN FGC FAC GOV HNC HSC INS LAB MVC PEN PROB PCC PRC PUC RTC SHC UIC VEH WAT WIC Section: Keyword(s): Code Search Text Search Up^Add To My Favorites Code Text Civil Code - CIVDIVISION 3. OBLIGATIONS [1427 - 3273.69] ( Heading of Division 3 amended by Stats. 1988, Ch. 160, Sec. 14. )PART 4. OBLIGATIONS ARISING FROM PARTICULAR TRANSACTIONS [1738 - 3273.69] ( Part 4 enacted 1872. )TITLE 1.81.5. California Consumer Privacy Act of 2018 [1798.100 - 1798.199.100] ( Title 1.81.5 added by Stats. 2018, Ch. 55, Sec. 3. )1798.100. General Duties of Businesses that Collect Personal Information(a) A business that controls the collection of a consumer’s personal information shall, at or before the point of collection, inform consumers of the following:(1) The categories of personal information to be collected and the purposes for which the categories of personal information are collected or used and whether that information is sold or shared. A business shall not collect additional categories of personal information or use personal information collected for additional purposes that are incompatible with the disclosed purpose for which the personal information was collected without providing the consumer with notice consistent with this section.(2) If the business collects sensitive personal information, the categories of sensitive personal information to be collected and the purposes for which the categories of sensitive personal information are collected or used, and whether that information is sold or shared. A business shall not collect additional categories of sensitive personal information or use sensitive personal information collected for additional purposes that are incompatible with the disclosed purpose for which the sensitive personal information was collected without providing the consumer with notice consistent with this section.(3) The length of time the business intends to retain each category of personal information, including sensitive personal information, or if that is not possible, the criteria used to determine that period provided", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "for which the sensitive personal information was collected without providing the consumer with notice consistent with this section.(3) The length of time the business intends to retain each category of personal information, including sensitive personal information, or if that is not possible, the criteria used to determine that period provided that a business shall not retain a consumer’s personal information or sensitive personal information for each disclosed purpose for which the personal information was collected for longer than is reasonably necessary for that disclosed purpose.(b) A business that, acting as a third party, controls the collection of personal information about a consumer may satisfy its obligation under subdivision (a) by providing the required information prominently and conspicuously on the homepage of its internet website. In addition, if a business acting as a third party controls the collection of personal information about a consumer on its premises, including in a vehicle, then the business shall, at or before the point of collection, inform consumers as to the categories of personal information to be collected and the purposes for which the categories of personal information are used, and whether that personal information is sold, in a clear and conspicuous manner at the location.(c) A business’ collection, use, retention, and sharing of a consumer’s personal information shall be reasonably necessary and proportionate to achieve the purposes for which the personal information was collected or processed, or for another disclosed purpose that is compatible with the context in which the personal information was collected, and not further processed in a manner that is incompatible with those purposes.(d) A business that collects a consumer’s personal information and that sells that personal information to, or shares it with, a third party or that discloses it to a service provider or contractor for a business purpose shall enter into an agreement with the third party, service provider, or contractor, that:(1) Specifies that the personal information is sold or disclosed by the business only for limited and specified purposes.(2) Obligates the third party, service provider, or contractor to comply with applicable obligations under this title and obligate those persons to provide the same level of privacy protection as is required by this title.(3) Grants the business rights to take reasonable and appropriate steps to help ensure that the third party, service provider, or contractor uses the personal information transferred in a manner consistent with the business’ obligations under", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "persons to provide the same level of privacy protection as is required by this title.(3) Grants the business rights to take reasonable and appropriate steps to help ensure that the third party, service provider, or contractor uses the personal information transferred in a manner consistent with the business’ obligations under this title.(4) Requires the third party, service provider, or contractor to notify the business if it makes a determination that it can no longer meet its obligations under this title.(5) Grants the business the right, upon notice, including under paragraph (4), to take reasonable and appropriate steps to stop and remediate unauthorized use of personal information.(e) A business that collects a consumer’s personal information shall implement reasonable security procedures and practices appropriate to the nature of the personal information to protect the personal information from unauthorized or illegal access, destruction, use, modification, or disclosure in accordance with Section 1798.81.5.(f) Nothing in this section shall require a business to disclose trade secrets, as specified in regulations adopted pursuant to paragraph (3) of subdivision (a) of Section 1798.185.(Amended November 3, 2020, by initiative Proposition 24, Sec. 4. Effective December 16, 2020. Operative January 1, 2023, pursuant to Sec. 31 of Proposition 24.)1798.105. Consumers’ Right to Delete Personal Information(a) A consumer shall have the right to request that a business delete any personal information about the consumer which the business has collected from the consumer.(b) A business that collects personal information about consumers shall disclose, pursuant to Section 1798.130, the consumer’s rights to request the deletion of the consumer’s personal information.(c) (1) A business that receives a verifiable consumer request from a consumer to delete the consumer’s personal information pursuant to subdivision (a) of this section shall delete the consumer’s personal information from its records, notify any service providers or contractors to delete the consumer’s personal information from their records, and notify all third parties to whom the business has sold or shared the personal information to delete the consumer’s personal information unless this proves impossible or involves disproportionate effort.(2) The business may maintain a confidential record of deletion requests solely for the purpose of preventing the personal information of a consumer who has submitted a deletion request from being sold, for compliance with laws or for other purposes, solely to the extent permissible under this title.(3) A service provider or contractor shall cooperate with the business in responding to a verifiable consumer", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "purpose of preventing the personal information of a consumer who has submitted a deletion request from being sold, for compliance with laws or for other purposes, solely to the extent permissible under this title.(3) A service provider or contractor shall cooperate with the business in responding to a verifiable consumer request, and at the direction of the business, shall delete, or enable the business to delete and shall notify any of its own service providers or contractors to delete personal information about the consumer collected, used, processed, or retained by the service provider or the contractor. The service provider or contractor shall notify any service providers, contractors, or third parties who may have accessed personal information from or through the service provider or contractor, unless the information was accessed at the direction of the business, to delete the consumer’s personal information unless this proves impossible or involves disproportionate effort. A service provider or contractor shall not be required to comply with a deletion request submitted by the consumer directly to the service provider or contractor to the extent that the service provider or contractor has collected, used, processed, or retained the consumer’s personal information in its role as a service provider or contractor to the business.(d) A business, or a service provider or contractor acting pursuant to its contract with the business, another service provider, or another contractor, shall not be required to comply with a consumer’s request to delete the consumer’s personal information if it is reasonably necessary for the business, service provider, or contractor to maintain the consumer’s personal information in order to:(1) Complete the transaction for which the personal information was collected, fulfill the terms of a written warranty or product recall conducted in accordance with federal law, provide a good or service requested by the consumer, or reasonably anticipated by the consumer within the context of a business’ ongoing business relationship with the consumer, or otherwise perform a contract between the business and the consumer.(2) Help to ensure security and integrity to the extent the use of the consumer’s personal information is reasonably necessary and proportionate for those purposes.(3) Debug to identify and repair errors that impair existing intended functionality.(4) Exercise free speech, ensure the right of another consumer to exercise that consumer’s right of free speech, or exercise another right provided for by law.(5) Comply with the California Electronic Communications Privacy Act pursuant to Chapter", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "for those purposes.(3) Debug to identify and repair errors that impair existing intended functionality.(4) Exercise free speech, ensure the right of another consumer to exercise that consumer’s right of free speech, or exercise another right provided for by law.(5) Comply with the California Electronic Communications Privacy Act pursuant to Chapter 3.6 (commencing with Section 1546) of Title 12 of Part 2 of the Penal Code.(6) Engage in public or peer-reviewed scientific, historical, or statistical research that conforms or adheres to all other applicable ethics and privacy laws, when the business’ deletion of the information is likely to render impossible or seriously impair the ability to complete such research, if the consumer has provided informed consent.(7) To enable solely internal uses that are reasonably aligned with the expectations of the consumer based on the consumer’s relationship with the business and compatible with the context in which the consumer provided the information.(8) Comply with a legal obligation.(Amended November 3, 2020, by initiative Proposition 24, Sec. 5. Effective December 16, 2020. Operative January 1, 2023, pursuant to Sec. 31 of Proposition 24.)1798.106. Consumers’ Right to Correct Inaccurate Personal Information(a) A consumer shall have the right to request a business that maintains inaccurate personal information about the consumer to correct that inaccurate personal information, taking into account the nature of the personal information and the purposes of the processing of the personal information.(b) A business that collects personal information about consumers shall disclose, pursuant to Section 1798.130, the consumer’s right to request correction of inaccurate personal information.(c) A business that receives a verifiable consumer request to correct inaccurate personal information shall use commercially reasonable efforts to correct the inaccurate personal information as directed by the consumer, pursuant to Section 1798.130 and regulations adopted pursuant to paragraph (7) of subdivision (a) of Section 1798.185.(Amended by Stats. 2024, Ch. 121, Sec. 1. (AB 3286) Effective January 1, 2025.)1798.110. Consumers’ Right to Know What Personal Information is Being Collected. Right to Access Personal Information(a) A consumer shall have the right to request that a business that collects personal information about the consumer disclose to the consumer the following:(1) The categories of personal information it has collected about that consumer.(2) The categories of sources from which the personal information is collected.(3) The business or commercial purpose for collecting, selling, or sharing personal information.(4) The categories of third parties to whom the business discloses personal information.(5) The specific pieces", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "the request is a verifiable consumer request, but this shall not extend the business’ duty to disclose and deliver the information, to correct inaccurate personal information, or to delete personal information within 45 days of receipt of the consumer’s request. The time period to provide the required information, to correct inaccurate personal information, or to delete personal information may be extended once by an additional 45 days when reasonably necessary, provided the consumer is provided notice of the extension within the first 45-day period. The disclosure of the required information shall be made in writing and delivered through the consumer’s account with the business, if the consumer maintains an account with the business, or by mail or electronically at the consumer’s option if the consumer does not maintain an account with the business, in a readily useable format that allows the consumer to transmit this information from one entity to another entity without hindrance. The business may require authentication of the consumer that is reasonable in light of the nature of the personal information requested, but shall not require the consumer to create an account with the business in order to make a verifiable consumer request provided that if the consumer, has an account with the business, the business may require the consumer to use that account to submit a verifiable consumer request.(B) The disclosure of the required information shall cover the 12-month period preceding the business’ receipt of the verifiable consumer request provided that, upon the adoption of a regulation pursuant to paragraph (8) of subdivision (a) of Section 1798.185, a consumer may request that the business disclose the required information beyond the 12-month period, and the business shall be required to provide that information unless doing so proves impossible or would involve a disproportionate effort. A consumer’s right to request required information beyond the 12-month period, and a business’ obligation to provide that information, shall only apply to personal information collected on or after January 1, 2022. Nothing in this subparagraph shall require a business to keep personal information for any length of time.(3) (A) A business that receives a verifiable consumer request pursuant to Section 1798.110 or 1798.115 shall disclose any personal information it has collected about a consumer, directly or indirectly, including through or by a service provider or contractor, to the consumer. A service provider or contractor shall not be required to comply with a", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "in order to allow the law enforcement agency to obtain a court-issued subpoena, order, or warrant to obtain a consumer’s personal information. For good cause and only to the extent necessary for investigatory purposes, a law enforcement agency may direct a business not to delete the consumer’s personal information for additional 90-day periods. A business that has received direction from a law enforcement agency not to delete the personal information of a consumer who has requested deletion of the consumer’s personal information shall not use the consumer’s personal information for any purpose other than retaining it to produce to law enforcement in response to a court-issued subpoena, order, or warrant unless the consumer’s deletion request is subject to an exemption from deletion under this title.(C) Cooperate with law enforcement agencies concerning conduct or activity that the business, service provider, or third party reasonably and in good faith believes may violate federal, state, or local law.(D) (i) Cooperate with a government agency request for emergency access to a consumer’s personal information if a natural person is at risk or danger of death or serious physical injury provided that:(I) The request is approved by a high-ranking agency officer for emergency access to a consumer’s personal information.(II) The request is based on the agency’s good faith determination that it has a lawful basis to access the information on a nonemergency basis.(III) The agency agrees to petition a court for an appropriate order within three days and to destroy the information if that order is not granted.(ii) For purposes of this subparagraph, a consumer accessing, procuring, or searching for services regarding contraception, pregnancy care, and perinatal care, including, but not limited to, abortion services, shall not constitute a natural person being at risk or danger of death or serious physical injury. (E) Exercise or defend legal claims.(F) Collect, use, retain, sell, share, or disclose consumers’ personal information that is deidentified or aggregate consumer information.(G) Collect, sell, or share a consumer’s personal information if every aspect of that commercial conduct takes place wholly outside of California. For purposes of this title, commercial conduct takes place wholly outside of California if the business collected that information while the consumer was outside of California, no part of the sale of the consumer’s personal information occurred in California, and no personal information collected while the consumer was in California is sold. This paragraph shall not prohibit a business", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "involve disproportionate effort, and requests for correction of accurate information.(B) How concerns regarding the accuracy of the information may be resolved.(C) The steps a business may take to prevent fraud.(D) If a business rejects a request to correct personal information collected and analyzed concerning a consumer’s health, the right of a consumer to provide a written addendum to the business with respect to any item or statement regarding any such personal information that the consumer believes to be incomplete or incorrect. The addendum shall be limited to 250 words per alleged incomplete or incorrect item and shall clearly indicate in writing that the consumer requests the addendum to be made a part of the consumer’s record.(8) Establishing the standard to govern a business’ determination, pursuant to subparagraph (B) of paragraph (2) of subdivision (a) of Section 1798.130, that providing information beyond the 12-month period in a response to a verifiable consumer request is impossible or would involve a disproportionate effort.(9) Issuing regulations further defining and adding to the business purposes, including other notified purposes, for which businesses, service providers, and contractors may use consumers’ personal information consistent with consumers’ expectations, and further defining the business purposes for which service providers and contractors may combine consumers’ personal information obtained from different sources, except as provided for in paragraph (6) of subdivision (e) of Section 1798.140.(10) Issuing regulations identifying those business purposes, including other notified purposes, for which service providers and contractors may use consumers’ personal information received pursuant to a written contract with a business, for the service provider or contractor’s own business purposes, with the goal of maximizing consumer privacy.(11) Issuing regulations to further define “intentionally interacts,” with the goal of maximizing consumer privacy.(12) Issuing regulations to further define “precise geolocation,” including if the size defined is not sufficient to protect consumer privacy in sparsely populated areas or when the personal information is used for normal operational purposes, including billing.(13) Issuing regulations to define the term “specific pieces of information obtained from the consumer” with the goal of maximizing a consumer’s right to access relevant personal information while minimizing the delivery of information to a consumer that would not be useful to the consumer, including system log information and other technical data. For delivery of the most sensitive personal information, the regulations may require a higher standard of authentication provided that the agency shall monitor the impact of the higher", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "As a registered member, you can review and change personal information at any time by accessing your account on the App or contacting our support.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "In the event that PeopleFun undergoes a business transition, such as a merger, acquisition by another company, change of control, or sale of all or a portion of its assets, we may transfer all of your information, including personal information, to the successor organization in such transition.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You can access and download data processed by 23andMe within your Account Settings and within applicable Reports, Tools, and features.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You may access, correct or update most of your Registration Information on your own within your Account Settings.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "We will help you export the information based on applicable law and your specific request.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "access your user data Correct the data you have provided to us Have information provided to you in a portable format Request the deletion of the data we have collected Restrict processing Object to processing or the legal basis on which we rely to process your data", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "However, in some circumstances we may retain your personal information for longer periods of time.", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "This information includes photos you upload, your published portfolio, Gig information, ratings, and additional information you may choose to add to your profile.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You can request erasure of Personal Information that: (a) is no longer necessary in relation to the purposes for which it was collected or otherwise processed; (b) was collected in relation to processing to which you previously consented, but later withdrew such consent; or (c) was collected in relation to processing activities to which you object, and there are no overriding legitimate grounds for our processing.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "The PeopleFun username will be public and will be shown to other users, but will only permit access to information that is considered public or that you have designated as public in your user profile settings.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "If we process your Personal Information based on a contract with you or based on your consent, or the processing is carried out by automated means, you may request to receive your Personal Information in a structured, commonly used and machine-readable format, and to have us transfer your Personal Information directly to another controller, where technically feasible, unless exercise of this right adversely affects the rights and freedoms of others.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "You can download your raw Genetic Information within your Account Settings or by going to the applicable tool in Tools. If you would like to access or rectify any other information, contact Customer Care and we will do our best to assist you without undue delay.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Should you ever deactivate your account with us, we will keep your information for a limited period in order to meet the above purposes.", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "not have a password, we may send you a SMS message for verification purposes. We also ask you to select an interest, or multiple interests, during account creation (for example, history, nature, sports) to help generate content and community recommendations or select more relevant advertising for you. When you use Reddit, you may also provide other information, such as a bio, gender, birthday, location, language, profile picture, or social link. You can remove or revise this information at any time. We also store your user account preferences and settings. We may ask for such information prior to you creating a username or account to help improve your experience exploring Reddit. Public Content You Submit Public content you submit includes your public posts, comments, and chat messages, usernames, and some of your profile information, as well as related metadata. Public content you submit may also include text, links, images, gifs, audio, videos, software, and tools. Our Public Content Policy applies to this content. Non-Public Content You Submit Non-public content you submit includes your saved drafts of posts or comments, your non-public messages with other users (such as private messages, private chats, and modmail), and your reports and other communications with moderators and with us. Non-public content you submit may also include text, links, images, gifs, audio, videos, software, and tools. It also includes information you submit when you fill out a form or survey, participate in Reddit-sponsored activities, promotions, or programs, request customer support, or otherwise communicate with us. Actions You Take We collect information about the actions you take when using the Services. This includes your interactions with the platform and content, like voting, saving, hiding, and reporting. It also includes your interactions with other users, such as following and blocking. We collect your interactions with communities, like your subscriptions", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "Take We collect information about the actions you take when using the Services. This includes your interactions with the platform and content, like voting, saving, hiding, and reporting. It also includes your interactions with other users, such as following and blocking. We collect your interactions with communities, like your subscriptions or moderator status. Transactional Information If you purchase products or services from us or otherwise through the Services, you will have to provide payment information in order to complete your purchase. Reddit uses industry-standard payment processor services (such as Stripe) to handle payment information, and those services are subject to separate terms and conditions and privacy policies. We will collect information about the product or service you are purchasing (for example, purchase dates, amounts paid or received, and expiration and renewal dates). We may also collect public blockchain data and addresses, such as when you purchase or create a Collectible Avatar, receive or mint an NFT, or create a Reddit Vault. However, we never store Reddit Vault private key information. Information We Collect As You Use Our Services We automatically collect information as you use our Services. This includes: Logs Data We collect device and network connection information when you access and use the Services. This may include your IP address, user-agent string, browser type, operating system, referral URLs, device information (such as device IDs), device settings, and mobile carrier name. Except for the IP address used to create your account, Reddit will delete any IP addresses collected after 100 days. Usage Information We collect information about how you use our Services, like pages visited, how you interact with content, ads, and communities, upvotes/downvotes, links clicked, the requested URL, and search terms. Information Collected From Cookies and Similar Technologies We may receive information from cookies, which are pieces of data", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "the information we collect for as long as it is necessary for the purpose(s) for which we originally collected it. We may retain certain information for legitimate business purposes and/or if we believe doing so is in accordance with, or as required by, any applicable law. For example, if you violate our policies and your account is suspended or banned, we may store the identifiers used to create the account (such as phone number) to prevent you from creating new accounts. Your Rights and Choices You have choices about how to protect and limit the collection, use, and sharing of information about you when you use the Services. Depending on where you live, you may also have the right to correction/rectification of your personal information, to opt out of certain advertising practices, or to withdraw consent for processing where you have previously provided consent. Please see “Additional Information for EEA, Swiss, and UK Users” and “Additional Information for California & Other U.S. State Users.” Below we explain how to exercise each of these rights. Reddit does not discriminate against users for exercising their rights under data protection laws. Accessing and Changing Your Information You can access your information and change or correct certain information through the Services. See our Help Center page for more information. You can also request a copy of the personal information Reddit maintains about you by following the process described here. Deleting Your Account You may delete your account at any time from the settings page in your account. For more information, please visit our Help Center. When you delete your account, your profile is no longer visible to other users and disassociated from content you posted under that account. Please note, however, that the posts, comments, and messages you submitted prior to deleting your account", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Principles-related complaint from us, or if we have not addressed your DPF Principles-related complaint to your satisfaction, please visit https://www.jamsadr.com/dpf-dispute-resolution for more information or to file a complaint. The services of JAMS are provided at no cost to you. Additional Information for EEA, Swiss, and UK Users If you live in the European Economic Area (“EEA”) or Switzerland, Reddit Netherlands B.V. is the controller of information processed in connection with the Reddit platform and this policy. If you live in the United Kingdom (“UK”), Reddit, Inc., is the data controller and Reddit UK Limited is Reddit’s UK GDPR Article 27 Representative. Users in the EEA, Switzerland, and UK have the right to request access to, rectification of, or erasure of their personal data; to data portability in certain circumstances; to request restriction of processing; to object to processing; and to withdraw consent for processing where they have previously provided consent. These rights can be exercised as described in the “Your Rights and Choices\" section above. EEA and Swiss users also have the right to lodge a complaint with their local supervisory authority. As required by applicable law, we collect and process information about individuals in the EEA, Switzerland, and UK only where we have a legal basis for doing so. Our legal bases depend on the Services you use and how you use them. We process your information where: It is necessary to fulfill our contract with you, including to provide, operate, and improve the Services, provide customer support, personalize features and to protect the safety and security of the Services; It satisfies a legitimate interest (which is not overridden by your data protection interests), such as preventing fraud, ensuring network and information security, enforcing our rules and policies, protecting our legal rights and interests, research and development, personalizing the", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "filling out a survey. Inferences we make based on other collected data, for purposes such as recommending content, advertising, and analytics. You can find more information about (a) what we collect and sources of that information in the “What Information We Collect” section of this notice, (b) the business and commercial purposes for collecting that information in the “How We Use Your Information” section, and (c) the categories of third parties with whom we share that information and the purpose for sharing that information in the “How We Share Your Information” section. Depending on your jurisdiction, and subject to exceptions and limitations provided by local law, in addition to the rights listed in “Your Rights and Choices” above, you may have: the right to opt out of any sales or sharing of your personal information, to request access to and information about our data practices, and to request deletion or correction of your personal information, as well as the right not to be discriminated against for exercising your privacy rights. Reddit does not “sell” or “share” personal information as those terms are defined under the CCPA or other applicable regulations. Reddit does not have knowledge that it “sells” or “shares” the personal information of users under 16 years of age. We do not use or disclose sensitive personal information except to provide you the Services or as otherwise permitted by the CCPA or other applicable regulations. We do not engage in profiling of consumers in furtherance of automated decisions that produce legal or similarly significant effects as those terms are defined in applicable regulations. You may exercise your rights to access, delete, or correct your personal information as described in the “Your Rights and Choices” section of this notice. When you make a request, we will verify your identity by", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "produce legal or similarly significant effects as those terms are defined in applicable regulations. You may exercise your rights to access, delete, or correct your personal information as described in the “Your Rights and Choices” section of this notice. When you make a request, we will verify your identity by asking you to sign into your account or if necessary by requesting additional information from you. You may also make a rights request using an authorized agent. If you submit a rights request from an authorized agent who does not provide a valid power of attorney, we may ask the authorized agent to provide proof that you gave the agent signed permission to submit the request to exercise rights on your behalf. In the absence of a valid power of attorney, we may also require you to verify your own identity directly with us or confirm to us that you otherwise provided the authorized agent permission to submit the request. If you have any questions or concerns, you may reach us using the methods described under “Your Rights and Choices” or by emailing us at redditdatarequests@reddit.com. Children Children under the age of 13 are not allowed to create an account or otherwise use the Services. Additionally, if you are located outside the United States, you must be over the age required by the laws of your country to create an account or otherwise use the Services. Changes to This Policy We may change this Privacy Policy from time to time. If we do, we will let you know by revising the date at the top of the policy. If the changes, in our sole discretion, are material, we may also notify you by sending an email to the address associated with your account (if you have chosen to provide an", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "the date, application, and version of X) and information about your broadcast activity (e.g., Spaces), including broadcasts youâ\u0080\u0099ve created and when you created them, your lists, bookmarks, and Communities you are a part of. Your interactions with other usersâ\u0080\u0099 content, such as reposts, likes, bookmarks, shares, downloads, replies, if other users mention or tag you in content or if you mention or tag them, and broadcasts youâ\u0080\u0099ve participated in (including your viewing history, listening, commenting, speaking, and reacting). How you interact with others on the platform, such as people you follow and people who follow you, metadata related toÂ Encrypted Messages, and when you useÂ Direct Messages, including the contents of the messages, the recipients, and date and time of messages. If you communicate with us, such as through email, we will collect information about the communication and its content. We collect information on links you interact with across our services (including in our emails sent to you). Purchase and payments. To allow you to make a payment or send money using X features or services, including through an intermediary, we may receive information about your transaction such as when it was made, when a subscription is set to expire or auto-renew, and amounts paid or received. Device Information. We collect information from and about the devices you use to access X, including: Information about your connection, such as your IP address, browser type, and related information. Information about your device and its settings, such as device and advertising ID, operating system, carrier, language, memory, apps installed, and battery level. Your device address book, if youâ\u0080\u0099ve chosen to share it with us. Location Information. When you use X, we collect some information about your approximate location to provide the service you expect, including showing you relevant ads. You can also", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "to help us operate and improve our products and services. 3. Sharing Information You should know the ways we share your information, why we share it, and how you can control it. There are five general ways we share your information. 3.1 When you post and share. With the general public.Â You are directing us to disclose that information as broadly as possible. X content, including your profile information (e.g., name/pseudonym, username, profile pictures), is available for viewing by the general public. The public does not need to be signed in to view some content on X. They may also find X content off of X: for example, from search query results on Internet search engines or videos downloaded and reshared elsewhere (depending on your settings). With other X users. Depending on your settings, and based on the X products and services you use, we share: Your interactions with X content of other users, such as replies, and people you follow. Content you send to a specific X user, such as through Direct Messages. Please keep in mind that if youâ\u0080\u0099ve shared information like Direct Messages or protected posts with someone else who accesses X through a third-party service, the information may be shared with the third-party service. With partners.Â Depending on your settings, we also provide certain third parties with information to help us offer or operate our products and services. You can learn more about these partnerships in our Help Center. You can control whether X shares your personal information with these partners by using the â\u0080\u009cData sharing with business partnersâ\u0080\u009d option in your Privacy & Safety settings.Â (This setting does not control sharing described elsewhere in this Privacy Policy, such as when we share information with our service providers, or through partnerships other than as described in", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "may not reflect updates you make on X. For more information about how we make public data on X available to the world, visit https://developer.x.com. 3.3 When required by law, to prevent harm, or in the public interest. We may preserve, use, share, or disclose your information if we believe that it is reasonably necessary to: comply with a law, regulation, legal process, or governmental request; protect the safety of any person, protect the safety or integrity of our platform, including to help prevent spam, abuse, or malicious actors on our services; explain why we have removed content or accounts from our services (e.g., for a violation ofÂ our Rules); address fraud, security, or technical issues; or protect our rights or property, or the rights or property of those who use our services. We may also use different signals and your data to infer, preserve, use, share, or disclose your age and identity information in order to comply with regulatory requirements as well as for safety, security, fraud, know-your-customer, know-your-business, and identity verification, as the case may be. We may also share or disclose your age and identity information with our partners, service providers, and others for these purposes. 3.4 With our Affiliates. We may share information amongst our affiliates to provide our products and services. 3.5 As a result of a change in ownership. We may share, sell, or transfer information about you in connection with a merger, acquisition, reorganization, sale of assets, or bankruptcy. This Privacy Policy will apply to your personal information that is shared with (before and after the close of any transaction) or transferred to the new entity. 4. How Long We Keep Information We keep different types of information for different periods of time, depending on how long we need to retain it in", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "apply to your personal information that is shared with (before and after the close of any transaction) or transferred to the new entity. 4. How Long We Keep Information We keep different types of information for different periods of time, depending on how long we need to retain it in order to provide you with our products and services, to comply with our legal requirements and for safety and security reasons. For example: We keep your profile information, such as your display name, user name, password and email address for the duration of your account. We cannot provide you with our products and services without retaining this information. We keep your usage information, such as the content you post, your interactions with other usersâ\u0080\u0099 content and how you interact with others on the platform for the duration of your account or until such content is removed. We keep your payment information, including your credit or debit card number and billing address for the duration you use our paid products and services. Records of transactions will be kept for longer, in accordance with applicable law. If you communicate with us, such as through email, we will keep information about the communication and its content for up to 18 months, unless it is necessary for us to retain it for a longer period to comply with our legal obligations or to exercise or defend our legal rights. We generally collect device information, location information, inferred identity information and log information using cookies. We keep cookies and information collected using cookies for up to 13 months. You can learn more about how we use cookies and similar technologies here. We keep information about your views or interactions with ads on or off X, as well as how you interact with our content on", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "We keep cookies and information collected using cookies for up to 13 months. You can learn more about how we use cookies and similar technologies here. We keep information about your views or interactions with ads on or off X, as well as how you interact with our content on third-party sites for up to 12 months.Â We keep information shared by ad and business partners for up to 12 months. Where you violate our Rules and your account is suspended, we may keep the identifiers you used to create the account (such as your email address or phone number) indefinitely to prevent repeat policy offenders from creating new accounts. We may need to keep certain information longer than our policies specify in order to comply with legal requirements and for safety and security reasons. For example: To comply with a law, regulation, legal process or governmental request. Including in order to adhere to a legally appropriate preservation request made by law enforcement. You can read more about law enforcement access here. In connection with legal claims, litigation and regulatory matters. Including where it is reasonably necessary to retain information relating to your account in order to defend X against legal claims. To maintain the safety and security of our products and services. Including where it is necessary to store your information longer in order to investigate and fight abuse on our products and services. Remember public content can exist elsewhere even after it is removed from X. For example, search engines and other third parties may retain copies of your posts longer, based upon their own privacy policies, even after they are deleted or expire on X. You can read more about search visibility here. 5. Take Control 5.1 Access, Correction, Portability. You can access, correct, or modify the", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "search engines and other third parties may retain copies of your posts longer, based upon their own privacy policies, even after they are deleted or expire on X. You can read more about search visibility here. 5. Take Control 5.1 Access, Correction, Portability. You can access, correct, or modify the information you provided to us by editing your profile and adjusting your account settings. You can learn more about the information we have collected or inferred about you in Your X Data and request access to additional information here. You can download a copy of your information, such as your posts, by following the instructions here. To protect your privacy and maintain security, we take steps to verify your identity before granting you access to your personal information or complying with a deletion, portability, or other related request. We may, in certain situations, reject your request for access, correction, or portability, for example, we may reject access where you are unable to verify your identity. 5.2 Deleting your Information. If you follow the instructions here, your account will be deactivated and your data will be queued for deletion. When deactivated, your X account, including your display name, username, and public profile, will no longer be viewable on X.com, X for iOS, and X for Android. For up to 30 days after deactivation it is still possible to restore your X account if it was accidentally or wrongfully deactivated. 5.3 Objecting to, Restricting, or Withdrawing your Consent. You can manage your privacy settings and other account features here. If you change your settings it may take some time for your choices to be fully reflected throughout our systems. You may also notice changes in your X experience or limitations in your ability to access certain features depending on the settings youâ\u0080\u0099ve", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "collect limited information from your device while Discord is running (such as the game you are playing). You can control the extent to which we collect, use, and display this information as described in the â\u0080\u009cHow to control your privacyâ\u0080\u009d section below.Information from optional features. Certain features, like contact syncing, may require that you provide additional information (or grant us access to such information) to make them work. This also includes if you choose to interact with sponsored content, enable integrations, or authorize third-party services to share data with us. For example, when you link a music streaming or game account, we may collect information about that account such as the song you are listening to or the game you are playing in order to display that information on your profile or as your status (if you have chosen to do so).Other information you provide directly to us. You may have the option to submit additional information as you use Discord. For example, you may participate in surveys where you can provide feedback on the services, or submit information to our Discord Support teams.Information we collect automaticallyWe also collect information automatically from you when you use Discord. This includes:Information about your device. We collect information about the device you are using to access the services. For example, this includes information like your IP address, operating system information, browser information, and information about your device settings, such as your microphone and/or camera.Â Information about your use of the apps or websites. For example, we collect log and event information related to how and when you use our services (such as the pages, servers, and channels you visit, the activities you engage in, the features you use, and the surfaces or embedded content you interact with).Other information that we collect automatically. When", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "if we believe disclosure is required by law, including meeting national security or law enforcement requirements. Where allowed and feasible, we may attempt to provide you with prior notice before disclosing your information in response to such a request. Our Transparency Report has additional information about how we respond to requests from governments and law enforcement entities.To prevent serious harm. We may disclose information if we believe in good faith that it's necessary to prevent death or other serious harm to a person.To enforce our policies and rights. We may disclose information if needed to enforce our Terms of Service, Community Guidelines, any of our other policies, or to protect the rights, property, and safety of ourselves and others.With our related companies. We may provide information to our related companies, including parents, affiliates, subsidiaries, and other companies under common control and ownership.Sale, Acquisition, or Transfer of Assets. We may disclose information if Discord is evaluating and/or engaging in a merger, acquisition, reorganization, bankruptcy, or sale, transfer, or change in ownership of Discord or any of its assets.â\u0080\u008dAggregated or de-identified information. We may disclose information that has been aggregated or anonymized such that it cannot reasonably be used to identify you. For example, we may share aggregated user statistics in order to describe our business, features, or promotions to partners or the public.Data retentionWe retain personal information until we determine it is no longer needed for the processing purposes for which we collected or retain it or for legal compliance. You can learn more about data retention periods in our data retention policy.How we protect your informationWe take a number of steps to help protect your information. All information sent within our services is encrypted both in transit and at rest. For example, we use Transport Layer Security (â\u0080\u009cTLSâ\u0080\u009d) to encrypt", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "can learn more about data retention periods in our data retention policy.How we protect your informationWe take a number of steps to help protect your information. All information sent within our services is encrypted both in transit and at rest. For example, we use Transport Layer Security (â\u0080\u009cTLSâ\u0080\u009d) to encrypt text and images in transit. We also enforce technical and administrative access controls to limit which of our employees and contractors have access to nonpublic personal information. Voice and video communications on Discord are designed to be end-to-end encrypted. You can verify that your calls are encrypted in the service. Learn more about Discordâ\u0080\u0099s end-to-end encryption. You can help maintain the security of your account by configuring two-factor authentication.How to control your privacyWe believe that users should be able to tailor their Discord experience to their preferences, including privacy. And while local laws may require different things, we believe that our users should have at least the same basic ability to shape their experience no matter where they are in the world. Hereâ\u0080\u0099s how you can control how we process your information, how to delete or correct certain information, and how to request access to your information. Users in certain places may have specific rights under their local laws. You can learn more about these in the Information About Local Privacy Laws page.â\u0080\u008dBe aware of the Discord spaces you choose to participate inYou can choose what spaces to participate in and what information you add to our services. You can choose what messages to send or post, who to engage with (e.g., one or more particular users or a potentially unlimited group of users), what information to include in your profile, whether to connect any third party services to your Discord account, and more. For example, if you share content", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "in order to understand and improve our services as described in these settings.Limit our ability to personalize Discord for you. We offer certain settings that control whether and how we may personalize Discord for you, such as offering you relevant recommendations for in-app content and features or delivering relevant sponsored content. If these settings are disabled, we will no longer use information specific to your account to power features that personalize Discord for you as described in these settings.You can learn more about these and other privacy-related settings in our Help Center or in the User Settings menu within Discord. The default and availability of some of these settings may be different depending on factors like your age or location.Disable or delete your accountYou can disable or delete your account via the User Settings menu. Disabling your account stops the processing of new data, but allows you to reactivate your account without interruption to you. Deleting your account permanently deletes identifying information and anonymizes other data as described in our data retention policy. You can learn more about how to delete your account in this Help Center article and how to disable your account in this Help Center article.Manage your content and serversYou may edit or delete specific pieces of information within the services:You can edit or delete any message you have sent or content you have posted if you still have access to the space where you posted it.You can edit or delete a Discord server if you have the permissions needed to do so.You can edit or delete a channel from a Discord server if you have the permissions needed to do so.Content may be retained by Discord for use as described elsewhere in this policy and in our data retention policy. Also, in limited circumstances, we may", "labels": {"retention_disclosed": 1.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "the permissions needed to do so.You can edit or delete a channel from a Discord server if you have the permissions needed to do so.Content may be retained by Discord for use as described elsewhere in this policy and in our data retention policy. Also, in limited circumstances, we may have a legal obligation to retain certain information, even if you delete the information or your account.Access your informationIf you want to see what information we have collected about you, you can request a copy of your data in the Data & Privacy section of your User Settings. You should receive your data packet within 30 days. Data is delivered in common digital formats, including JSON and any other file format you used when uploading attachments to the services. You can learn more about how to access your information in our Help Center.International data transfersWe are based in the United States, and we process and store information on servers located in the United States. We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers. These data transfers allow us to provide our services to you. By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law.When transferring data outside the EEA, we use standard contract clauses (Module 1 and Module 2), and we rely on the European Commission's adequacy decisions about certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer.Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II,", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "on your public profile turn off messaging with other users (if messaging is available in your market) On the ‘Explicit Content’ setting you can control whether explicit-rated content can be played on your Spotify account. Cookies Policy: Information on how we use cookies and how to manage your cookie preferences. Cookies are files saved on your phone, tablet or computer when you visit a website. 2. Your personal data rights and controls Certain U.S. states have adopted privacy laws that give certain rights to individuals over their personal data. We provide these rights to all residents of the U.S., regardless of where they live. The table below explains: your rights how to exercise them You can also watch our video about Your Privacy Controls. You will not receive discriminatory treatment for exercising any of your privacy rights. It’s your right to.. How? Be informed Be informed of the personal data we process about you and how we process it. We inform you: through this Policy through information provided to you as you use the Spotify Service by answering your specific questions and requests when you contact us Know/ Access Request to know and access the personal data we process about you. To request a copy of your personal data from Spotify, either: use the ‘Download your data’ tool on your Account Privacy page, or contact us When you download your data you will receive the information about your data that Spotify has to provide under applicable laws. If you would like more information about how we process your personal data, you can contact us. Correction Request that we amend or update your personal data where it’s inaccurate. You can edit your User Data under ‘Edit profile’ in your account or by contacting us. Deletion Request that we delete certain of", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "to opt out of the processing of your personal data for tailored advertising. For more information about our processing for these purposes, see the section ‘Tailored advertising controls’ below. You can exercise your right to opt out on your Account Privacy page under ‘Tailored Ads’. If you do not have an account or are not logged in, you can also opt-out by clicking the 'Your Privacy Choices' link at the footer of our website. Data portability Request a copy of your personal data in electronic format and the right to transmit that personal data for use in another party’s service. For information about how to exercise the right to portability, see ‘Know/Access’ above. Not be subject to automated decision making Not be subject to a decision based solely on automated decision making (decisions without human involvement), including profiling, where the decision would have a legal effect on you or produce a similarly significant effect. Spotify does not carry out this type of automated decision making in the Spotify Service. Withdrawal of consent Withdraw your consent to us collecting or using your personal data. You can do this if Spotify is processing your personal data solely based on your consent. To withdraw your consent, you can: • adjust the relevant control on Spotify • contact us Verifying requests, generally To verify a request to know, request to delete, and request to correct, we ask you to provide certain details related to your Spotify account. Please note, if you do not have a Spotify account we will not have enough information about you to verify your identity and respond to your requests, as we do not keep sufficient information necessary to re-identify and link you to a prior visit to the Spotify Service where data may have been collected. As such, we", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Purchase Data Survey and Research Data If we were to sell or negotiate to sell our business to a buyer or possible buyer. In this case, we may transfer your personal data to a successor or affiliate as part of that transaction. 6. Data retention We keep your personal data only as long as necessary to provide you with the Spotify Service and for Spotify’s legitimate and essential business purposes, such as: maintaining the performance of the Spotify Service making data-driven business decisions about new features and offerings complying with our legal obligations resolving disputes Here are some of the categories of our retention periods, and the criteria we use to determine them: Data retained until you remove it It’s your right to request that we delete certain of your personal data. See the section on ‘Deletion’ in Section 2 ‘Your personal data rights and controls’ for more information, and the circumstances in which we can act on your request. You can also delete certain personal data directly from the Spotify Service: for example, you can edit or delete your profile picture. Where users are able to see and update the personal data themselves, we keep the information for as long as the user chooses unless one of the limited purposes described below applies. Data that expires after a specific period of time We have set certain retention periods so that some data expires after a specific period of time. For example, personal data you may input as part of search queries is generally deleted after 90 days. Data retained until your Spotify account is deleted We keep some data until your Spotify account is deleted. Examples of this include your Spotify username and profile information. We also typically keep streaming history for the life of an account, for example,", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "search queries is generally deleted after 90 days. Data retained until your Spotify account is deleted We keep some data until your Spotify account is deleted. Examples of this include your Spotify username and profile information. We also typically keep streaming history for the life of an account, for example, to provide retrospective playlists that users enjoy and personalized recommendations that take listening habits into account (for example, Your Time Capsule or Your Summer Rewind). When your Spotify account is deleted, this category of data is deleted or de-identified. Data retained for extended time periods for limited purposes After your account is deleted, we keep some data for a longer time period but for very limited purposes. For example, we may be subject to legal or contractual obligations that require this. These may include mandatory data retention laws, government orders to preserve data relevant to an investigation, or data kept for the purposes of litigation. We may also keep data that has been removed from the Spotify Service for a limited period of time. This could be: to help ensure user safety, or to protect against harmful content on our platform. Age Check Data is deleted immediately after your Age Check is complete. This helps us investigate potential breaches of our User Guidelines and Platform Rules. On the other hand, we will remove unlawful content if the law requires us to do so. 7. Transfer to other countries Because of the global nature of our business, Spotify transfers personal data internationally with Spotify group companies, subcontractors and partners when carrying out the activities described in this Policy. Whenever we transfer personal data internationally, we use tools to make sure the data transfer complies with applicable law. We also identify and use additional protections as appropriate for each data transfer. For", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "example, you can control whether we can collect your mobile advertising identifier for advertising through settings on your Apple and Android devices.You can opt out of marketing or advertising emails by using the â\u0080\u009cunsubscribeâ\u0080\u009d link or mechanism noted in marketing or advertising emails.Current versions of the app do not collect precise or approximate GPS information from U.S. users. If you are still using an older version that allowed for collection of precise or approximate GPS information (last release in August 2020) and you granted us permission to do so, you can prevent your device from sharing such information with the Platform at any time through your deviceâ\u0080\u0099s operating system settings.If you have registered for an account, you may access, review, and update certain personal information that you have provided to us by logging into your account and using available features and functionalities.Some browsers transmit â\u0080\u009cdo-not-trackâ\u0080\u009d signals to websites. Because of differences in how browsers incorporate and activate this feature, we currently do not take action in response to these signals.Data Security and RetentionWe use reasonable measures to help protect information from loss, theft, misuse, unauthorized access, disclosure, alteration, or destruction. You should understand that no data storage system or transmission of data over the Internet or any other public network can be guaranteed to be 100 percent secure. Please note that information collected by third parties may not have the same security protections as information you submit to us, and we are not responsible for protecting the security of such information.We retain information for as long as necessary to provide the Platform and for the other purposes set out in this Privacy Policy. We also retain information when necessary to comply with contractual and legal obligations, when we have a legitimate business interest to do so (such as improving and", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "information.We retain information for as long as necessary to provide the Platform and for the other purposes set out in this Privacy Policy. We also retain information when necessary to comply with contractual and legal obligations, when we have a legitimate business interest to do so (such as improving and developing the Platform, and enhancing its safety, security and stability), and for the exercise or defense of legal claims.The retention periods are different depending on different criteria, such as the type of information and the purposes for which we use the information. For example, when we process your information such as your profile information to provide you with the Platform, we keep this information for as long as you have an account. If you violate our Terms of Service, Community Guidelines, or other conditions or policies, we may remove your profile immediately, but may keep other information about you to process the violation.TikTok may transmit your data to its servers or data centers outside of the United States for storage and/or processing. Other entities with whom TikTok may share your data as described herein may be located outside of the United States.Children and TeensThe privacy of Children is important to us. We provide a separate experience for Children in the United States, in which we collect and process only limited information. For information about how we collect, use, share, and otherwise process the personal information of Children, please refer to our Childrenâ\u0080\u0099s Privacy Policy.The Platform otherwise is not directed at Children. If we become aware that personal information has been collected on the Platform from a Child, we will delete this information and terminate the Childâ\u0080\u0099s account. If you believe there is a user who is below the age of 13, please contact us at: https://www.tiktok.com/legal/report/feedback.If you are a parent", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "Children. If we become aware that personal information has been collected on the Platform from a Child, we will delete this information and terminate the Childâ\u0080\u0099s account. If you believe there is a user who is below the age of 13, please contact us at: https://www.tiktok.com/legal/report/feedback.If you are a parent or guardian, our Guardian's Guide contains information and resources to help you understand the Platform and the tools and controls you can use. As a parent or guardian, you can also request the deletion of the account of your underage child or download the account data of your underage child by contacting us at https://www.tiktok.com/legal/report/privacy.If you are a parent or guardian, depending on your state of residence, you may have the ability to exercise certain rights over your child's or teen's account. For example, you may request the deletion of their accounts, download account data, or exercise other rights in connection with your child or teen by contacting us at https://www.tiktok.com/legal/report/privacy. We will address these requests in accordance with applicable law.Other RightsSharing for Direct Marketing Purposes (Shine the Light)If you are a California resident, once a calendar year, you may be entitled to obtain information about personal information that we shared, if any, with other businesses for their own direct marketing uses. To submit a request, contact us at:Â https://www.tiktok.com/legal/report/privacy.Content Removal for Users Under 18Users of the Platform who are California residents and are under 18 years of age may request and obtain removal of User Content they posted by contacting us at: https://www.tiktok.com/legal/report/privacy. All requests must provide a description of the User Content you want removed and information reasonably sufficient to permit us to locate that User Content. We do not accept California Removal Requests via postal mail, telephone, or facsimile. We may not be able to respond if", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "such as searching for and contacting job candidates, sales leads and co-workers, manage talent and promote content. We sell premium Services that provide our customers and subscribers with customized-search functionality and tools (including messaging and activity alerts) as part of our talent, marketing and sales solutions. Customers can export limited information from your profile, such as name, headline, current company, current title, and general location (e.g., Dublin), such as to manage sales leads or talent, unless you opt-out. We do not provide contact information to customers as part of these premium Services without your consent. Premium Services customers can store information they have about you in our premium Services, such as a resume or contact information or sales history. The data stored about you by these customers is subject to the policies of those customers. Other enterprise Services and features that use your data include TeamLink and LinkedIn Pages (e.g., content analytics and followers).2.3 Communications We contact you and enable communications between Members. We offer settings to control what messages you receive and how often you receive some types of messages. We will contact you through email, mobile phone, notices posted on our websites or apps, messages to your LinkedIn inbox, and other ways through our Services, including text messages and push notifications. We will send you messages about the availability of our Services, security, or other service-related issues. We also send messages about how to use our Services, network updates, reminders, job suggestions and promotional messages from us and our partners. You may change your communication preferences at any time. Please be aware that you cannot opt out of receiving service messages from us, including security and legal notices.We also enable communications between you and others through our Services, including for example invitations, InMail, groups and messages between connections.2.4", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "of a sale, merger or change in control, or in preparation for any of these events. Any other entity which buys us or part of our business will have the right to continue to use your data, but only in the manner set out in this Privacy Policy unless you agree otherwise. 4. Your Choices & Obligations4.1 Data Retention We keep most of your personal data for as long as your account is open. We generally retain your personal data as long as you keep your account open or as needed to provide you Services. This includes data you or others provided to us and data generated or inferred from your use of our Services. Even if you only use our Services when looking for a new job every few years, we will retain your information and keep your profile open, unless you close your account. In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form.4.2 Rights to Access and Control Your Personal Data You can access or delete your personal data. You have many choices about how your data is collected, used and shared. We provide many choices about the collection, use and sharing of your data, from deleting or correcting data you include in your profile and controlling the visibility of your posts to advertising opt-outs and communication controls. We offer you settings to control and manage the personal data we have about you.For personal data that we have about you, you can:Delete Data: You can ask us to erase or delete all or some of your personal data (e.g., if it is no longer necessary to provide Services to you).Change or Correct Data: You can edit some of your personal data through your account. You can also", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "have about you, you can:Delete Data: You can ask us to erase or delete all or some of your personal data (e.g., if it is no longer necessary to provide Services to you).Change or Correct Data: You can edit some of your personal data through your account. You can also ask us to change, update or fix your data in certain cases, particularly if it’s inaccurate.Object to, or Limit or Restrict, Use of Data: You can ask us to stop using all or some of your personal data (e.g., if we have no legal right to keep using it) or to limit our use of it (e.g., if your personal data is inaccurate or unlawfully held).Right to Access and/or Take Your Data: You can ask us for a copy of your personal data and can ask for a copy of personal data you provided in machine readable form.Visitors can learn more about how to make these requests here. You may also contact us using the contact information below, and we will consider your request in accordance with applicable laws.Residents in the Designated Countries and the UK, and other regions, may have additional rights under their laws.4.3 Account Closure We keep some of your data even after you close your account. If you choose to close your LinkedIn account, your personal data will generally stop being visible to others on our Services within 24 hours. We generally delete closed account information within 30 days of account closure, except as noted below.We retain your personal data even after you have closed your account if reasonably necessary to comply with our legal obligations (including law enforcement requests), meet regulatory requirements, resolve disputes, maintain security, prevent fraud and abuse (e.g., if we have restricted your account for breach of our Professional Community Policies), enforce", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "find out more about how we disclose and transfer your personal information internationally here: help.netflix.com/legal/personal-information-international-transfers. Supplemental Privacy DisclosuresWe provide supplemental information regarding certain aspects of the Netflix service (such as certain Netflix games features) in the section “Supplemental Privacy Disclosures for Certain Services and Regions” below. In addition, data protection laws in certain countries or regions may require us to provide additional or different information to disclosures above in this Privacy Statement. Where this is the case, such information is also provided in the section “Supplemental Privacy Disclosures for Certain Services and Regions” below. Section B: Your Rights and ControlsYour Privacy Rights Access, correct, update, or delete your personal information: You have a right to confirm whether we process your personal information and to access and receive a copy of the personal information we process about you. You may also correct or update out-of-date or inaccurate personal information or request that we delete personal information that we hold about you. To request a copy of your personal information, please visit netflix.com/account/getmyinfo. In addition, under the \"Account\" section of our website, you can access and update information about your account, including your contact information, payment information, and various related information about your account. You must be logged in to access the \"Account\" section. For information about deletion, removal, and retention of personal information, please see: help.netflix.com/node/100625.Portability and downloading a copy of your personal information: You can request portability of or download a copy of your personal information. If you are the account owner, to download a copy of your personal information go to: netflix.com/account/getmyinfo. For more information, please see: help.netflix.com/node/100624. Objection, restriction, and withdrawal of consent: You can object to or request that we restrict processing of your personal information. If we have collected and are processing your personal information with", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "account owner, to download a copy of your personal information go to: netflix.com/account/getmyinfo. For more information, please see: help.netflix.com/node/100624. Objection, restriction, and withdrawal of consent: You can object to or request that we restrict processing of your personal information. If we have collected and are processing your personal information with your consent, then you can withdraw your consent at any time. Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect processing of your personal information conducted in reliance on lawful processing grounds other than consent. For more information, please see help.netflix.com/node/100637.Right to complain: You have the right to complain to a data protection authority about our processing of your personal information but we encourage you to first contact us with any questions or concerns. Right not to be subject to automated decision making: You may have a right not to be subject to a decision made solely using automated means, where such decision would have a legal effect on you or produce a similarly significant effect.You can exercise the rights described above when we receive a verified request in accordance with applicable law.Communication and Marketing PreferencesEmail and Text Messages. If you no longer want to receive certain communications from us via email or text message, please access the “Notification settings” option for the relevant profile within the “Account” section of our website. Alternatively, click the “unsubscribe” link in the email or reply STOP (or as otherwise instructed) to the text message (note: you may receive a confirmation text message in this case). Please note that you cannot unsubscribe from transactional messages from us, such as messages relating to your account transactions.Push Notifications. You can choose to receive mobile push notifications from Netflix. Netflix will send you push notifications", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "your browser's help function or support area to learn more. Most email clients have settings that allow you to prevent the automatic downloading of images, including pixel tags, and the automatic connection to the web servers that host those images. Other technologies may be cleared from within the application.In addition to these choices, if you want to exercise your choices for behavioral advertising on Netflix, please see “Advertising Choices” above.Section E: Other Important Privacy DisclosuresSharing Functionality in our ServiceYou can use sharing functionality available in our service to disclose your personal information in the following ways:certain portions of our service may give you options to share information by email, text message, and social or other sharing applications, using the clients and apps on your device; andsocial plugins and similar technologies that allow you to share information.Social plugins and social applications are operated by third-party social networks, and are subject to their terms of use and privacy policies. Similarly, some Netflix game features may require use of a third party service, which is subject to that service’s terms of use and privacy policy.Security We use reasonable administrative, logical, physical, and managerial measures to safeguard your personal information against loss, theft, and unauthorized access, use and modification. These measures are designed to provide a level of security appropriate to the risks of processing your personal information. Retention of Personal Information We may retain personal information as required or permitted by applicable laws and regulations, including to honor your choices, for our billing or records purposes, and as otherwise necessary to fulfill the purposes described in this Privacy Statement. Specifically, we retain personal information for as long as necessary to provide our service; to administer and operate our business; to research, analyze, and improve our services; to send marketing and informational messages; to", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "long as necessary to provide our service; to administer and operate our business; to research, analyze, and improve our services; to send marketing and informational messages; to support Advertisements; for safety, security, and fraud prevention; and to comply with law and enforce the Netflix Terms of Use. Our retention of personal information is based on many factors such as your relationship with Netflix (for example, whether you are a Netflix current member); the nature of the personal information; compliance with our legal obligations; and/or defending or resolving actual or anticipated legal claims. We take reasonable measures to destroy or de-identify personal information in a secure manner when it is no longer required. For information about deletion, removal and retention of personal information, please see help.netflix.com/node/126558.Your California Privacy RightsCalifornia residents have certain rights with respect to your personal information.Right to Know/Access. You have the right to request that we disclose: the categories and specific pieces of personal information we have collected about you; the categories of sources from which personal information are collected; our business or commercial purpose for collecting, using, disclosing, selling or sharing personal information; the categories of third parties to whom we disclose, sell, or share personal information; and the categories of personal information we have disclosed, sold, or shared about you for a business or commercial purpose. You also have a right to confirm whether we process your personal information, and to access and receive a copy of the specific personal information we have collected about you.Right to Correction. You have a right to request correction of any inaccurate personal information we hold about you. Right to Deletion. You have a right to request deletion of your personal information, subject to exceptions under applicable laws.You can assert these rights above when we receive a verified request from", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "to Correction. You have a right to request correction of any inaccurate personal information we hold about you. Right to Deletion. You have a right to request deletion of your personal information, subject to exceptions under applicable laws.You can assert these rights above when we receive a verified request from you. For information on how to exercise your rights, please see the “Your Rights and Controls” section of this Privacy Statement.California Do Not Sell or Share My Personal Information. As of the date of this Privacy Statement, we may use certain categories of personal information to support Advertisements or engage in Netflix marketing activities. Under the CCPA, these activities may be considered “selling” or “sharing.” If you do not want us to sell or share personal information about you, you can learn how to make applicable choices by clicking the “Do Not Sell or Share My Personal Information” link located in the footer of netflix.com or by visiting netflix.com/dnsspi. Using these choices will not opt you out of the use of previously “sold” (as defined by the CCPA) personal information, or stop all behavioral advertising. We do not knowingly sell or share (as defined by the CCPA) the personal information of minors under 16 years of age. Some web browsers and extensions are compatible with Global Privacy Control (GPC), allowing them to communicate your preference to opt out from specific forms of data processing, including any “sale” or “sharing” of personal information. In California, we honor your choices expressed through the GPC settings if we detect such a signal, as required by applicable law. You can find more information about how we respond to GPC here: netflix.com/dnsspi.Right to Limit the Use of Sensitive Personal Information. As described above, we do collect sensitive personal information such as your Netflix username, password,", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Rights under US State Privacy LawsTo the extent applicable under US State Privacy Laws, you may have the following rights in connection with your personal information:A right to confirm whether we process your personal information and to access and receive a copy of the personal information we have collected about you.A right to request deletion of your personal information, subject to exceptions under applicable US State Privacy Laws. A right to request correction or update any inaccurate personal information we hold about you. A right to opt-out of “sale” or our use of personal information for “targeted advertising” purposes. You can learn more by clicking the “Do Not Sell or Share My Personal Information” link located in the footer of netflix.com or by visiting netflix.com/dnsspi.You can assert these rights when we receive a verified request from you. For information on how to exercise your rights, please see the Your Rights and Controls section of this Privacy Statement.Use of Authorized AgentsIf you are a resident of a US state that gives you a right to use an authorized agent, they can submit a request on your behalf to privacy@netflix.com along with a statement, certifying as may be required, that the agent is authorized to act on your behalf. In order to verify the request, we may ask you to verify your identity and your authorization of the agent to make requests on your behalf. For more information about how to access your information, including our verification process, please see help.netflix.com/node/100624.AppealsIf you are a resident of a US state that gives you a right to appeal a decision, you may appeal our decision denying your request. Requests to change our policies or practices are not grounds for appeal. You may request an appeal by contacting us at privacyappeals@netflix.com. Please provide the US", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "are a resident of a US state that gives you a right to appeal a decision, you may appeal our decision denying your request. Requests to change our policies or practices are not grounds for appeal. You may request an appeal by contacting us at privacyappeals@netflix.com. Please provide the US state that you are writing from, accompanied with documentation regarding the decision you are appealing. If you do not own a Netflix account, we may not be able to respond to certain requests, including, for example, the right to access or delete personal information. Because we only collect limited personal information about individuals without an account, we are unable to verify requests from non-account holders to the standard required by the US State Privacy Laws. Last Updated: April 17, 2025 Select your preferred language: Select a language English Spanish (Latin America) Terms of Use Privacy Do Not Sell or Share My Personal Information Ad Choices Cookie Preferences Corporate Information", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "Privacy Policy – Privacy & Terms – GooglePrivacy & TermsPrivacy & TermsPrivacy & TermsOverviewPrivacy PolicyTerms of ServiceTechnologiesFAQGoogle AccountPrivacy PolicyIntroductionInformation Google collectsWhy Google collects dataYour privacy controlsSharing your informationKeeping your information secureExporting & deleting your informationRetaining your informationCompliance & cooperation with regulatorsAbout this policyRelated privacy practicesData transfer frameworksKey termsPartnersUpdatesGoogle Privacy PolicyWhen you use our services, you’re trusting us with your information. We understand this is a big responsibility and work hard to protect your information and put you in control.This Privacy Policy is meant to help you understand what information we collect, why we collect it, and how you can update, manage, export, and delete your information.Privacy CheckupLooking to change your privacy settings?Take the Privacy CheckupEffective July 1, 2025 | Archived versions | Download PDFContentsIntroductionInformation Google collectsWhy Google collects dataYour privacy controlsSharing your informationKeeping your information secureExporting & deleting your informationRetaining your informationCompliance & cooperation with regulatorsAbout this policyRelated privacy practicesWe build a range of services that help millions of people daily to explore and interact with the world in new ways. Our services include:Google apps, sites, and devices, like Search, YouTube, and Google HomePlatforms like the Chrome browser and Android operating systemProducts that are integrated into third-party apps and sites, like ads, analytics, and embedded Google MapsYou can use our services in a variety of ways to manage your privacy. For example, you can sign up for a Google Account if you want to create and manage content like emails and photos, or see more relevant search results. And you can use many Google services when you’re signed out or without creating an account at all, like searching on Google or watching YouTube videos. You can also choose to browse the web in a private mode, like Chrome Incognito mode, which helps keep your browsing private from other people who", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "across our services and across your devices for the purposes described above. For example, depending on your available settings, if you watch videos of guitar players on YouTube, you might see an ad for guitar lessons on a site that uses our ad products. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.If other users already have your email address or other information that identifies you, we may show them your publicly visible Google Account information, such as your name and photo. This helps people identify an email coming from you, for example.We’ll ask for your consent before using your information for a purpose that isn’t covered in this Privacy Policy.Your privacy controlsYou have choices regarding the information we collect and how it's usedThis section describes key controls for managing your privacy across our services. You can also visit the Privacy Checkup, which provides an opportunity to review and adjust important privacy settings. In addition to these tools, we also offer specific privacy settings in our products — you can learn more in our Product Privacy Guide.Go to Privacy CheckupManaging, reviewing, and updating your informationWhen you’re signed in, you can always review and update information by visiting the services you use. For example, Photos and Drive are both designed to help you manage specific types of content you’ve saved with Google.We also built a place for you to review and control information saved in your Google Account. Your Google Account includes:Privacy controlsActivity ControlsDecide what types of activity you’d like saved in your account. For example, if you have YouTube History turned on, the videos you watch and the things you search for are saved in your account so", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "use Google servicesManage information that websites and apps using Google services, like Google Analytics, may share with Google when you visit or interact with their services.Go to How Google uses information from sites or apps that use our servicesWays to review & update your informationMy ActivityMy Activity allows you to review and control data that’s saved to your Google Account when you’re signed in and using Google services, like searches you’ve done or your visits to Google Play. You can browse by date and by topic, and delete part or all of your activity.Go to My ActivityGoogle DashboardGoogle Dashboard allows you to manage information associated with specific products.Go to DashboardYour personal informationManage your contact information, such as your name, email, and phone number.Go to Personal InfoWhen you’re signed out, you can manage information associated with your browser or device, including:Signed-out search personalization: Choose whether your search activity is used to offer you more relevant results and recommendations.YouTube settings: Pause and delete your YouTube Search History and your YouTube Watch History.Ad Settings: Manage your preferences about the ads shown to you on Google and on sites and apps that partner with Google to show ads.Exporting, removing & deleting your informationYou can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.Export your dataTo delete your information, you can:Delete your content from specific Google servicesSearch for and then delete specific items from your account using My ActivityDelete specific Google products, including your information associated with those productsDelete your entire Google AccountDelete your informationInactive Account Manager allows you to give someone else access to parts of your Google Account in case you’re unexpectedly unable to use your account.And finally, you can also request to remove content from specific", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "built with strong security features that continuously protect your information. The insights we gain from maintaining our services help us detect and automatically block security threats from ever reaching you. And if we do detect something risky that we think you should know about, we’ll notify you and help guide you through steps to stay better protected.We work hard to protect you and Google from unauthorized access, alteration, disclosure, or destruction of information we hold, including:We use encryption to keep your data private while in transitWe offer a range of security features, like Safe Browsing, Security Checkup, and 2 Step Verification to help you protect your accountWe review our information collection, storage, and processing practices, including physical security measures, to prevent unauthorized access to our systemsWe restrict access to personal information to Google employees, contractors, and agents who need that information in order to process it. Anyone with this access is subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.Exporting & deleting your informationYou can export a copy of your information or delete it from your Google Account at any timeYou can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.Export your dataTo delete your information, you can:Delete your content from specific Google servicesSearch for and then delete specific items from your account using My ActivityDelete specific Google products, including your information associated with those productsDelete your entire Google AccountDelete your informationRetaining your informationWe retain the data we collect for different periods of time depending on what it is, how we use it, and how you configure your settings:Some data you can delete whenever you like, such as your personal info or the content", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "those productsDelete your entire Google AccountDelete your informationRetaining your informationWe retain the data we collect for different periods of time depending on what it is, how we use it, and how you configure your settings:Some data you can delete whenever you like, such as your personal info or the content you create or upload, like photos and documents. You can also delete activity information saved in your account, or choose to have it deleted automatically after a set period of time. We’ll keep this data in your Google Account until you remove it or choose to have it removed.Other data is deleted or anonymized automatically after a set period of time, such as advertising data in server logs.We keep some data until you delete your Google Account, such as information about how often you use our services.And some data we retain for longer periods of time when necessary for legitimate business or legal purposes, such as security, fraud and abuse prevention, or financial record-keeping.When you delete data, we follow a deletion process to make sure that your data is safely and completely removed from our servers or retained only in anonymized form. We try to ensure that our services protect information from accidental or malicious deletion. Because of this, there may be delays between when you delete something and when copies are deleted from our active and backup systems.You can read more about Google’s data retention periods, including how long it takes us to delete your information.Compliance & cooperation with regulatorsWe regularly review this Privacy Policy and make sure that we process your information in ways that comply with it.Data transfersWe maintain servers around the world and your information may be processed on servers located outside of the country where you live. Data protection laws vary among countries, with some", "labels": {"retention_disclosed": 1.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "regulatorsWe regularly review this Privacy Policy and make sure that we process your information in ways that comply with it.Data transfersWe maintain servers around the world and your information may be processed on servers located outside of the country where you live. Data protection laws vary among countries, with some providing more protection than others. Regardless of where your information is processed, we apply the same protections described in this policy. We also comply with certain legal frameworks relating to the transfer of data.When we receive formal written complaints, we respond by contacting the person who made the complaint. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of your data that we cannot resolve with you directly.U.S. state law requirementsSome U.S. state privacy laws require specific disclosures.This Privacy Policy is designed to help you understand how Google handles your information:We explain the categories of information Google collects and the sources of that information in Information Google collects.We explain the purposes for which Google collects and uses information in Why Google collects data.We explain when Google may disclose information in Sharing your information. Google does not sell your personal information. Google also does not “share” your personal information as that term is defined in the California Consumer Privacy Act (CCPA).We explain how Google retains information in Retaining your information. You can also learn more about how Google anonymizes data. As described there, when Google anonymizes data to protect your privacy, we maintain policies and technical measures to avoid re-identifying that information.U.S. state privacy laws also provide the right to request information about how Google collects, uses, and discloses your information. And they give you the right to access your information, sometimes in a portable format; correct your information; and to", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "we maintain policies and technical measures to avoid re-identifying that information.U.S. state privacy laws also provide the right to request information about how Google collects, uses, and discloses your information. And they give you the right to access your information, sometimes in a portable format; correct your information; and to request that Google delete that information. Many of these laws also provide the right to opt out of certain forms of profiling and targeted advertising. They also provide the right to not be discriminated against for exercising these privacy rights. Additionally, the CCPA treats certain kinds of information, like health data, as sensitive; when users provide this information, Google only uses it for purposes permitted by the CCPA, like to provide services that are requested and expected by our users.The Washington My Health My Data Act and Nevada Senate Bill 370 provide specific rights in addition to those rights above, that apply to health information. When you provide this information, Google only processes it with your consent and allows you to withdraw your consent.We describe the choices you have to manage your privacy and data across Google’s services in Your privacy controls. These tools allow you to access, review, update and delete your information, as well as export and download a copy of it. You can also control what information we use to show you ads, or turn off personalized ads, by visiting My Ad Center.When you use these tools, we’ll validate your request by verifying that you’re signed in to your Google Account. If you have questions or requests related to your rights under U.S. state privacy laws, you (or your authorized agent) can also contact Google. And if you disagree with the decision on your request, you can ask Google to reconsider it by responding to our email.We", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "to your Google Account. If you have questions or requests related to your rights under U.S. state privacy laws, you (or your authorized agent) can also contact Google. And if you disagree with the decision on your request, you can ask Google to reconsider it by responding to our email.We also provide more information on Google’s handling of CCPA requests.Some U.S. state privacy laws also require a description of data practices using specific categories. This table uses these categories to organize the information in this Privacy Policy.Categories of information we collectIdentifiers and similar information such as your name and password, phone number, and address, as well as unique identifiers tied to the browser, application, or device you’re using. Some Google services like YouTube Studio provide the option to submit a valid ID (such as a passport or driver’s license) to verify your identity to use additional features.Demographic information, such as your age, gender and language. If you choose to use optional features like YouTube Creator Demographics, you can also provide additional information, like your gender identity or race and ethnicity.Commercial information such as your payment information and a history of purchases you make on Google’s services.Biometric information if you choose to provide it, such as fingerprints in Google’s product development studies.Internet, network, and other activity information such as your search terms; views and interactions with content and ads; Chrome browsing history you’ve synced with your Google Account; information about the interaction of your apps, browsers, and devices with our services (like IP address, crash reports, and system activity); and activity on third-party sites and apps that use our services. You can review and control activity data stored in your Google Account in My Activity.Geolocation data, such as may be determined by GPS, IP address, and other data from sensors on", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "(like IP address, crash reports, and system activity); and activity on third-party sites and apps that use our services. You can review and control activity data stored in your Google Account in My Activity.Geolocation data, such as may be determined by GPS, IP address, and other data from sensors on or around your device, depending in part on your device and account settings. Depending on these settings, this may include precise location data, for example GPS data for Android features like navigation or finding your phone. Learn more about Google’s use of location information.Audio, electronic, visual, and similar information, such as voice and audio information.Communications data, such as emails, if you use our services to send and receive messages.Health information if you choose to provide it, such as your medical history, vital signs and health metrics (like blood glucose levels), and other similar information related to your physical or mental health, in the course of using Google services that offer health-related features, such as the Google Health Studies app, Fitbit, or Pixel devices..Professional, employment, and education information, such as information you provide or that is maintained through an organization using Google services at which you study or work.Other information you create or provide, such as the content you create, upload, or receive (like photos and videos or emails, docs and spreadsheets). Google Dashboard allows you to manage information associated with specific products.Inferences drawn from the above, like your ads interest categories.Business purposes for which information may be used or disclosedProtecting against security threats, abuse, and illegal activity: Google uses and may disclose information to detect, prevent and respond to security incidents, and for protecting against other malicious, deceptive, fraudulent, or illegal activity. For example, to protect our services, Google may receive or disclose information about IP addresses that malicious actors", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 1.0, "privacy_waiver": 0.0}}
{"text": "visit the site again, the cookie allows that site to recognize your browser. Cookies may store user preferences and other information. You can configure your browser to refuse all cookies or to indicate when a cookie is being sent. However, some website features or services may not function properly without cookies. Learn more about how Google uses cookies and how Google uses data, including cookies, when you use our partners' sites or apps.DeviceA device is a computer that can be used to access Google services. For example, desktop computers, tablets, smart speakers, and smartphones are all considered devices.Google AccountYou may access some of our services by signing up for a Google Account and providing us with some personal information (typically your name, email address, and a password). This account information is used to authenticate you when you access Google services and protect your account from unauthorized access by others. You can edit or delete your account at any time through your Google Account settings.IP addressEvery device connected to the Internet is assigned a number known as an Internet protocol (IP) address. These numbers are usually assigned in geographic blocks. An IP address can often be used to identify the location from which a device is connecting to the Internet. Learn more about how we use location information.Non-personally identifiable informationThis is information that is recorded about users so that it no longer reflects or references an individually-identifiable user.Personal informationThis is information that you provide to us which personally identifies you, such as your name, email address, or billing information, or other data that can be reasonably linked to such information by Google, such as information we associate with your Google Account.Pixel tagA pixel tag is a type of technology placed on a website or within the body of an email for", "labels": {"retention_disclosed": 0.0, "deletion_offered": 1.0, "access_rights": 0.0, "privacy_waiver": 0.0}}
{"text": "You waive your rights to confidentiality when using our Application.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 1.0}}
{"text": "You relinquish your expectation to data privacy when using our Application.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 1.0}}
{"text": "You relinquish your expectation to confidentiality when using our App.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 1.0}}
{"text": "You forfeit your rights to personal privacy when using our Application.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 1.0}}
{"text": "You consent to surveillance of your usage.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 1.0}}
{"text": "You waive your right to confidentiality when using our App.", "labels": {"retention_disclosed": 0.0, "deletion_offered": 0.0, "access_rights": 0.0, "privacy_waiver": 1.0}}
{"text": "Use of this Service constitutes consent to waive data portability.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive any right to object to data processing for service improvement.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to data protection rights as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive any right to object to data processing for service improvement.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive any right to object to data processing for research.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive data portability for research.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree not to exercise your right to erasure for submitted data.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to data protection rights as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive data portability for service improvement.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to right to be forgotten as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive privacy rights for legitimate interests.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to right to object as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your data protection rights is waived to the maximum extent permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your right to erasure is waived to the maximum extent permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Use of this Service constitutes consent to waive right to be forgotten.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By proceeding, you waive certain data protection rights under PIPEDA.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By accepting these Terms, you waive privacy protections related to stored data.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your data portability is waived to the maximum extent permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By using our platform, you agree not to assert data protection rights.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to restrict data use under data protection regulations.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your privacy rights under PIPEDA are limited by these Terms.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive any right to object to data processing for legitimate interests.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive right to access for analytics.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Use of the Service constitutes a waiver of right to restrict processing.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your right to erasure is waived to the maximum extent permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your privacy rights under data protection regulations are limited by these Terms.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to file privacy complaints regarding all personal data.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Use of this Service constitutes consent to waive right to be forgotten.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By using our platform, you agree not to assert privacy rights.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Use of the Service constitutes a waiver of data portability.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By proceeding, you waive certain data protection rights under privacy legislation.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By accepting these Terms, you waive privacy protections related to account information.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree not to exercise your right to erasure for submitted data.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to request portability under GDPR.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to opt-out rights as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to object to processing under data protection regulations.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your right to data portability is waived to the maximum extent permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to request portability regarding transaction history.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your privacy rights under CCPA are limited by these Terms.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive any claims related to data protection rights under applicable law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to object to processing regarding account information.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to data portability as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive data portability for legitimate interests.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By using our Service, you waive certain privacy rights under CCPA.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to right to object as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive any right to object to data processing for service improvement.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to opt-out of marketing regarding account information.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to data protection rights as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to challenge data accuracy regarding stored data.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You agree to waive your right to data protection rights as permitted by law.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive any right to object to data processing for analytics.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your privacy rights under CCPA are limited by these Terms.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to object to processing regarding personal data.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "By proceeding, you waive certain data protection rights under privacy legislation.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Use of the Service constitutes a waiver of right to restrict processing.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You waive the right to opt-out of marketing under GDPR.", "labels": {"privacy_waiver": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide the option to delete your submitted data upon request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You may delete your collected information by calling customer service.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to erasure of user data.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can request deletion of your communication records at any time.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You may delete your contact information by contacting support.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to erasure of transaction history.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We offer account and personal information deletion at your request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to delete your stored data by emailing us.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We allow you to delete communication records free of charge.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can request deletion of your communication records at any time.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can request permanent deletion of communication records.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You may request that we delete your stored data.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide the option to delete your usage information without undue delay.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide the option to delete your behavioral data at any time.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to erasure of communication records.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We offer account and account information deletion at your request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We allow you to delete contact information within 30 days.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide the option to delete your user data without undue delay.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide the option to delete your communication records at any time.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide all personal data deletion services without undue delay.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to delete your user data by using your account settings.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You may delete your transaction history by emailing us.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can request permanent deletion of account information.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide stored data deletion services upon request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide the option to delete your all personal data without undue delay.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We will delete your all personal data upon your request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can delete your submitted data through the user portal.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We offer collected information deletion upon request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We will delete your transaction history upon your request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We allow you to delete collected information at any time.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to request deletion of contact information.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We will delete your user data upon your request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We allow you to delete submitted data anytime.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide account information deletion services within 30 days.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We honor deletion requests for transaction history.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We offer account information deletion upon request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can request deletion of your user data at any time.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We honor deletion requests for stored data.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We offer submitted data deletion upon request.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to request deletion of personal data.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to request deletion of behavioral data.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You may request that we delete your personal data.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can delete your profile data through the account management page.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide transaction history deletion services free of charge.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can delete your personal data through the account management page.", "labels": {"deletion_offered": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We maintain profile data for 6 months after account closure.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Contact information will be retained for 24 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We maintain transaction history for one year after termination.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold profile data for a period of 6 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We retain transaction history for 30 days.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold onto collected information for 12 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Personal information will be retained for 12 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We store stored data for one year from data collection.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Retention period for profile data: 12 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Collected information will be retained for 5 years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold usage information for a period of 12 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold onto user data for 90 days.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Transaction history will be retained for 6 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold usage information for a period of 90 days.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We store behavioral data for the duration of your account from termination.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold transaction history for a period of the duration of your account.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Personal information is preserved for 5 years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Communication records is preserved for seven years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your account information is retained for 12 months following your last interaction.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your account information is retained for two years following account closure.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold behavioral data for a period of 90 days.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Stored data will be retained for 90 days.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold onto usage information for the duration of your account.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Stored data is kept for 24 months after account closure.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We store submitted data for one year as required by CCPA.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Submitted data is kept for 24 months after service discontinuation.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We retain transaction history for three years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Submitted data is kept for the duration of your account after data collection.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Retention period for communication records: seven years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We store collected information for 30 days as required by privacy legislation.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Transaction history retention period: the duration of your account.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We store behavioral data for the duration of your account as required by privacy legislation.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold all personal data for a period of 12 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your transaction history is retained for the duration of your account following data collection.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Data retention: behavioral data is retained for one year.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold profile data for a period of seven years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Your user data is stored for two years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold onto user data for 24 months.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Usage information will be retained for seven years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Personal data will be retained for three years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "Submitted data retention period: 90 days.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We store submitted data for 90 days as required by local privacy laws.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We retain contact information for 5 years.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "All personal data retention period: as long as necessary.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We hold onto transaction history for 90 days.", "labels": {"retention_disclosed": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You may view your profile data through your profile page.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We offer access to stored data by through our privacy portal.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can obtain a copy of behavioral data by emailing us.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide access to usage information within 30 days of your request.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can request a copy of your stored data at any time.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to access your profile data.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We offer access to contact information by submitting a request form.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You can obtain a copy of personal information by submitting a request form.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to access your contact information.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "You have the right to review your personal data.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
{"text": "We provide access to your account information upon request.", "labels": {"access_rights": 1.0}, "source": "synthetic_expanded_phase2", "category": "user_privacy"}
